[
  {
    "headline": "Medicare Negotiated Drug Prices Take Effect for 10 Drugs",
    "summary": "The first set of Medicare negotiated drug prices went into effect on January 1, 2026, covering 10 Part D drugs including Eliquis, Jardiance, Enbrel, and Stelara. The program is estimated to save $1.5 billion in annual out-of-pocket costs for Medicare beneficiaries and $6 billion per year for the Medicare program.",
    "source": "CMS",
    "published_at": "2026-01-01T08:00:00",
    "tickers": [
      "JNJ",
      "ABBV",
      "MRK",
      "LLY",
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Drugmakers Raise U.S. Prices on 350 Medicines Despite Trump Pressure",
    "summary": "Pharmaceutical companies plan to raise U.S. prices on at least 350 branded medications at the start of 2026, up from 250 at the same point last year. The increases come even as the Trump administration pressures drugmakers for price cuts under its Most Favored Nation initiative.",
    "source": "CNN",
    "published_at": "2026-01-01T12:00:00",
    "tickers": [
      "JNJ",
      "ABBV",
      "MRK",
      "LLY",
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Kicks Off 2026 With Record App Store Revenue in Holiday Quarter",
    "summary": "Apple reported record-breaking App Store revenue during the holiday quarter, driven by strong consumer spending on apps and in-app purchases. The company saw a 14% year-over-year increase in services revenue, further diversifying its income streams.",
    "source": "Bloomberg",
    "published_at": "2026-01-02T08:15:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Web Services Reports Record Q4 Cloud Revenue, Surpassing $30 Billion",
    "summary": "AWS posted quarterly revenue of $30.8 billion, beating analyst estimates by over $1 billion. The cloud division's operating margin expanded to 32%, driven by strong enterprise adoption of generative AI workloads.",
    "source": "Reuters",
    "published_at": "2026-01-02T08:15:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Chase Posts Record Q4 Earnings, Beats Wall Street Estimates",
    "summary": "JPMorgan Chase reported fourth-quarter earnings of $4.81 per share, exceeding analysts' expectations of $4.03. The bank benefited from strong investment banking fees and a rebound in trading revenue across fixed income and equities desks.",
    "source": "Reuters",
    "published_at": "2026-01-02T08:15:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "ExxonMobil Posts Record Q4 Earnings on Strong Refining Margins",
    "summary": "ExxonMobil reported fourth-quarter earnings of $9.2 billion, beating analyst expectations by 12%. Strong refining margins and increased production from the Permian Basin drove the outperformance.",
    "source": "Reuters",
    "published_at": "2026-01-02T08:15:00",
    "tickers": [
      "XOM"
    ],
    "sector": "Energy",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom Reports Record Q1 Revenue Driven by AI Networking Chips",
    "summary": "Broadcom Inc. posted record first-quarter revenue of $14.9 billion, beating analyst estimates by 6%. The company cited surging demand for custom AI accelerators and networking semiconductors from hyperscale cloud providers.",
    "source": "Bloomberg",
    "published_at": "2026-01-02T08:15:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Delivers 418,227 Vehicles in Q4, Full-Year Drops 8%",
    "summary": "Tesla reported fourth-quarter deliveries of 418,227 EVs, bringing its full-year 2025 total to 1.64 million vehicles, an 8% decline from 2024. The disappointing numbers marked the company's first annual delivery decline, raising concerns about aging vehicle lineup and brand challenges.",
    "source": "Reuters",
    "published_at": "2026-01-02T08:30:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Markets Close Out 2025 on a High as S&P 500 Logs Best Two-Year Run Since Late 1990s",
    "summary": "The S&P 500 finished 2025 with a 23% annual gain, marking the strongest consecutive two-year rally in over two decades. Investors entered the new year with cautious optimism, though concerns about stretched valuations lingered.",
    "source": "Reuters",
    "published_at": "2026-01-02T09:15:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Market",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Surpasses 320 Million Global Subscribers in Q4 Earnings Beat",
    "summary": "Netflix added 19.2 million subscribers in Q4 2025, bringing its total to 321 million worldwide. The company attributed the strong growth to its ad-supported tier and a robust content slate including several breakout original series.",
    "source": "Bloomberg",
    "published_at": "2026-01-03T06:30:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Azure Growth Accelerates Amid Enterprise AI Adoption",
    "summary": "Microsoft's Azure cloud platform saw accelerated growth in Q4 2025, fueled by enterprise demand for AI infrastructure and services. Analysts estimate Azure revenue grew 34% year-over-year, outpacing expectations.",
    "source": "Reuters",
    "published_at": "2026-01-03T09:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Chevron Reports Solid Q4 Results Despite Lower Oil Prices",
    "summary": "Chevron earned $5.8 billion in the fourth quarter, down 8% from a year ago but ahead of consensus estimates. Cost reductions and strong natural gas trading results partially offset the impact of lower crude prices.",
    "source": "CNBC",
    "published_at": "2026-01-03T10:00:00",
    "tickers": [
      "CVX"
    ],
    "sector": "Energy",
    "sentiment": "neutral"
  },
  {
    "headline": "ISM Manufacturing Index Unexpectedly Contracts in December",
    "summary": "The ISM manufacturing PMI fell to 48.2 in December, missing expectations of 49.5 and signaling contraction for the first time in three months. New orders and employment sub-indices both weakened, raising concerns about industrial momentum heading into 2026.",
    "source": "Bloomberg",
    "published_at": "2026-01-03T10:05:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Goldman Sachs Reshuffles Senior Leadership Amid Strategic Pivot",
    "summary": "Goldman Sachs announced a reorganization of its executive leadership team as CEO David Solomon continues efforts to strengthen the firm's asset and wealth management divisions. The move follows a year of steady growth in fee-based recurring revenue streams.",
    "source": "Bloomberg",
    "published_at": "2026-01-03T11:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Cisco Systems Unveils Next-Gen AI-Optimized Networking Platform",
    "summary": "Cisco announced its new Catalyst AI 9500 series switches designed for data center workloads running large language models. The platform promises 40% higher throughput and tighter integration with GPU clusters. Analysts view the launch as a strong competitive move against Arista Networks.",
    "source": "Reuters",
    "published_at": "2026-01-03T11:00:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "AMD Shares Rise on Optimism Ahead of Q4 Earnings",
    "summary": "AMD stock gained 3.2% as investors positioned ahead of the chipmaker's fourth-quarter earnings report. Analysts highlighted growing data center revenue and the MI350 GPU ramp as key catalysts for potential upside.",
    "source": "Bloomberg",
    "published_at": "2026-01-03T14:15:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Boeing Delivers 45 Aircraft in December, Missing Internal Targets",
    "summary": "Boeing delivered 45 commercial aircraft in December, falling short of its internal goal of 55 as supply chain bottlenecks persisted. The company has now missed its monthly delivery target for six consecutive months.",
    "source": "Reuters",
    "published_at": "2026-01-04T10:30:00",
    "tickers": [
      "BA"
    ],
    "sector": "Industrials",
    "sentiment": "negative"
  },
  {
    "headline": "Meta AI Glasses Waitlist Extends Into 2026 as Demand Surges",
    "summary": "Meta's Ray-Ban Display smart glasses, priced at $799, have seen waitlists extend well into 2026 due to overwhelming demand since their fall launch. The product's integration of LLAMA 4 AI and neural band controller has resonated with consumers seeking wearable AI.",
    "source": "The Verge",
    "published_at": "2026-01-04T11:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Announces $4 Billion AI Fund to Accelerate Enterprise Adoption",
    "summary": "Salesforce unveiled a $4 billion venture fund focused on AI startups building on the Salesforce platform. CEO Marc Benioff called it the largest enterprise AI investment initiative in the company's history.",
    "source": "CNBC",
    "published_at": "2026-01-04T11:00:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Alphabet's Waymo Expands Robotaxi Service to Three New U.S. Cities",
    "summary": "Alphabet's autonomous driving subsidiary Waymo announced expansion into Austin, Atlanta, and Miami, marking a significant scale-up of its robotaxi operations. The company aims to cover 15 major U.S. metro areas by year-end 2026.",
    "source": "TechCrunch",
    "published_at": "2026-01-04T11:30:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa Reports Strong Holiday Spending Data, U.S. Payment Volumes Up 8%",
    "summary": "Visa shared preliminary data showing U.S. payment volumes rose 8% year-over-year during the holiday shopping season. Cross-border transaction volumes also surged, driven by a recovery in international travel spending.",
    "source": "CNBC",
    "published_at": "2026-01-04T14:30:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Procter & Gamble Beats Q2 Estimates on Pricing Power",
    "summary": "P&G reported fiscal second-quarter revenue of $22.1 billion, topping estimates as consumers continued to absorb price increases. The company raised its full-year organic sales growth forecast to 4-5%.",
    "source": "CNBC",
    "published_at": "2026-01-05T09:00:00",
    "tickers": [
      "PG"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Intel Faces Continued Market Share Losses in Server Processors",
    "summary": "New data from Mercury Research shows Intel's server CPU market share fell to 68% in Q4 2025, down from 74% a year earlier. AMD and Arm-based alternatives continue to gain traction in enterprise and cloud data centers.",
    "source": "MarketWatch",
    "published_at": "2026-01-05T09:30:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Adobe Faces Regulatory Scrutiny Over Figma Acquisition Terms in EU",
    "summary": "European Commission officials opened a preliminary investigation into Adobe's revised partnership agreement with Figma. Regulators are examining whether the terms of the deal could limit competition in the digital design software market.",
    "source": "Financial Times",
    "published_at": "2026-01-05T09:45:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Faces Renewed EU Antitrust Scrutiny Over App Store Fees",
    "summary": "The European Commission opened a new investigation into Apple's revised App Store fee structure, alleging the company has not fully complied with the Digital Markets Act. Apple could face fines of up to 10% of its global annual revenue if found in violation.",
    "source": "Financial Times",
    "published_at": "2026-01-06T07:45:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "December Jobs Report Blows Past Expectations With 312,000 Payrolls Added",
    "summary": "Nonfarm payrolls surged by 312,000 in December, well above the 210,000 consensus estimate, while the unemployment rate held steady at 4.1%. Wage growth came in at 3.9% year-over-year, easing some inflation fears as the labor market showed resilience.",
    "source": "CNBC",
    "published_at": "2026-01-06T08:45:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Home Depot Q4 Revenue Falls Short as Housing Market Softens",
    "summary": "Home Depot reported fourth-quarter revenue of $34.5 billion, missing estimates by $400 million as higher mortgage rates weighed on home improvement spending. Big-ticket transactions declined 5% year-over-year.",
    "source": "CNBC",
    "published_at": "2026-01-06T09:30:00",
    "tickers": [
      "HD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Stock Falls on Q4 Delivery Miss, Worst Annual Decline on Record",
    "summary": "Tesla shares dropped 4% in early trading after the company confirmed its first-ever annual delivery decline. Analysts noted that aging models, political backlash in Europe, and rising competition from BYD contributed to the disappointing results.",
    "source": "Bloomberg",
    "published_at": "2026-01-06T09:45:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Mastercard Expands Crypto Payment Partnership with Major Exchanges",
    "summary": "Mastercard announced new partnerships with three leading cryptocurrency exchanges, enabling seamless conversion of digital assets to fiat currency at the point of sale. The initiative is part of Mastercard's broader strategy to remain at the forefront of digital payments innovation.",
    "source": "Financial Times",
    "published_at": "2026-01-06T09:45:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Kicks Off CES 2026 With Rubin AI Platform Unveil",
    "summary": "CEO Jensen Huang unveiled Rubin, NVIDIA's next-generation six-chip AI platform now in full production, promising to cut token generation costs to one-tenth of Blackwell. Analysts responded with increased price targets, calling it a pivotal moment for the AI infrastructure buildout.",
    "source": "CNBC",
    "published_at": "2026-01-06T10:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amgen Touts MariTide Weight Loss and Diabetes Potential at JPM Conference",
    "summary": "At the J.P. Morgan Healthcare Conference, Amgen presented Phase 2 data showing MariTide (maridebart cafraglutide) achieved up to 20% weight loss in obesity patients and up to 17% in those with type 2 diabetes. The once-monthly injectable is now advancing through six global Phase 3 trials with readouts expected in early 2027.",
    "source": "Clinical Trials Arena",
    "published_at": "2026-01-06T10:00:00",
    "tickers": [
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle Cloud Infrastructure Revenue Jumps 54% as Database Migration Accelerates",
    "summary": "Oracle reported a 54% year-over-year increase in cloud infrastructure revenue for Q2 FY2026. The company said enterprises are migrating legacy databases to OCI at a faster pace than anticipated, citing cost savings and AI integration.",
    "source": "MarketWatch",
    "published_at": "2026-01-06T14:20:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm Expands Automotive Chip Portfolio with New Snapdragon Ride Platform",
    "summary": "Qualcomm launched its Snapdragon Ride Flex Gen 3 platform targeting autonomous driving and advanced driver-assistance systems. The chipmaker has secured design wins with three major European automakers for 2027 model-year vehicles.",
    "source": "CNBC",
    "published_at": "2026-01-06T14:20:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Unveils Alpamayo, World's First Reasoning Autonomous Vehicle AI",
    "summary": "At CES 2026, NVIDIA introduced Alpamayo, an open reasoning model family for autonomous vehicle development that processes sensor input end-to-end from camera to actuation. The model can articulate its reasoning for driving decisions, representing a major step toward explainable self-driving AI.",
    "source": "TechCrunch",
    "published_at": "2026-01-06T16:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon and Salesforce Explore Joint AI Customer Service Platform",
    "summary": "Sources familiar with the matter say Amazon and Salesforce are in early talks to co-develop an AI-powered customer service platform. The initiative would combine AWS's AI infrastructure with Salesforce's CRM capabilities to target large enterprise clients.",
    "source": "WSJ",
    "published_at": "2026-01-07T07:00:00",
    "tickers": [
      "AMZN",
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway's Cash Pile Reaches $350 Billion, Sparking Investor Debate",
    "summary": "Berkshire Hathaway's cash and short-term Treasury holdings climbed to a record $350 billion, raising questions about Warren Buffett's deployment strategy. Some analysts see the war chest as a sign of caution, while others view it as preparation for a major acquisition.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-07T07:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Coca-Cola Reports Strong Holiday Quarter with 6% Volume Growth",
    "summary": "Coca-Cola posted better-than-expected fourth-quarter results driven by 6% global volume growth, led by strong demand in emerging markets. The Zero Sugar portfolio grew 14%, continuing its multi-year acceleration.",
    "source": "WSJ",
    "published_at": "2026-01-07T08:45:00",
    "tickers": [
      "KO"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Jensen Huang CES Keynote Ignites Analyst Optimism on NVIDIA Future",
    "summary": "Multiple Wall Street firms raised their price targets on NVIDIA following Jensen Huang's CES 2026 keynote, which showcased the Rubin platform and Alpamayo autonomous vehicle AI. Analysts called the presentation evidence that AI demand remains robust and NVIDIA's competitive moat is widening.",
    "source": "CNBC",
    "published_at": "2026-01-07T09:30:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Google DeepMind Unveils Gemini 3.0 With Breakthrough Reasoning Capabilities",
    "summary": "Google DeepMind announced Gemini 3.0, its latest large language model featuring significantly improved multi-step reasoning and code generation abilities. The model will be integrated across Google's product suite including Search, Workspace, and Cloud.",
    "source": "The Verge",
    "published_at": "2026-01-07T14:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Trump Administration Announces 10% Across-the-Board Tariff on Chinese Imports Effective February 1",
    "summary": "President Trump signed an executive order imposing a blanket 10% tariff on all Chinese goods entering the United States, escalating trade tensions with Beijing. China's Commerce Ministry vowed retaliatory measures, sending futures lower in overnight trading.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-07T14:30:00",
    "tickers": [
      "SPY",
      "QQQ",
      "AAPL",
      "NVDA"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Meta CES 2026: Ray-Ban Display Teleprompter Feature Announced",
    "summary": "Meta showcased a new teleprompter feature for its Ray-Ban Display glasses at CES 2026, enabling users to deliver prepared remarks with discreet text overlaid in their field of view. The company also demonstrated neural handwriting input via its Neural Band accessory.",
    "source": "The Verge",
    "published_at": "2026-01-07T15:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Texas Instruments Warns of Weak Industrial Demand in Q1 Guidance",
    "summary": "Texas Instruments issued below-consensus guidance for the first quarter, citing continued softness in industrial and automotive end markets. The company expects revenue of $3.7 billion to $4.0 billion, compared with Wall Street estimates of $4.1 billion.",
    "source": "Bloomberg",
    "published_at": "2026-01-07T16:05:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Accenture Wins $2.3 Billion U.S. Federal AI Modernization Contract",
    "summary": "Accenture secured a multi-year contract with the U.S. Department of Defense to modernize legacy IT systems using artificial intelligence. The deal is one of the largest federal IT consulting awards in recent years and is expected to contribute to revenue growth through fiscal 2028.",
    "source": "WSJ",
    "published_at": "2026-01-08T07:45:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "PepsiCo Acquires Emerging Snack Brand Poppi for $1.8 Billion",
    "summary": "PepsiCo announced it will acquire prebiotic soda maker Poppi for $1.8 billion in cash, betting on the fast-growing functional beverage trend. The deal is expected to close in Q2 2026 pending regulatory approval.",
    "source": "Bloomberg",
    "published_at": "2026-01-08T09:30:00",
    "tickers": [
      "PEP"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Completes $2.1 Billion Acquisition of Cybersecurity Firm CrowdLayer",
    "summary": "Microsoft closed its acquisition of cybersecurity startup CrowdLayer, bolstering its Defender product line with advanced threat detection capabilities. The deal is expected to add $400 million in annual recurring revenue by 2027.",
    "source": "CNBC",
    "published_at": "2026-01-08T10:20:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Ad-Tier Revenue Disappoints Despite Subscriber Growth",
    "summary": "While Netflix continues to add subscribers to its ad-supported plan, average revenue per ad-tier user fell 8% quarter-over-quarter. Analysts expressed concern that ad pricing pressure from competitors like Amazon Prime Video and YouTube is eroding Netflix's monetization potential.",
    "source": "Bloomberg",
    "published_at": "2026-01-08T10:30:00",
    "tickers": [
      "NFLX",
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "10-Year Treasury Yield Climbs Above 4.7% as Inflation Fears Persist",
    "summary": "The benchmark 10-year Treasury yield touched 4.73%, its highest level since October 2023, pressured by stronger-than-expected jobs data and tariff uncertainty. Rising yields weighed heavily on growth stocks and the broader equity market.",
    "source": "Financial Times",
    "published_at": "2026-01-08T11:20:00",
    "tickers": [
      "SPY",
      "QQQ",
      "IWM"
    ],
    "sector": "Market",
    "sentiment": "negative"
  },
  {
    "headline": "Trump Administration Authorizes Certain Chip Sales to China",
    "summary": "The Trump administration approved limited semiconductor exports to China in January, providing a modest tailwind for AMD and other chipmakers. However, restrictions on the most advanced AI accelerators, including NVIDIA's Blackwell GPUs, remain firmly in place.",
    "source": "Reuters",
    "published_at": "2026-01-08T13:00:00",
    "tickers": [
      "AMD",
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Fed Signals Patience on Rate Cuts, Financial Stocks Pull Back",
    "summary": "Federal Reserve minutes released Wednesday showed officials are in no hurry to cut interest rates further, citing persistent inflation in services. Shares of major banks including JPMorgan and Goldman Sachs declined as investors recalibrated rate expectations.",
    "source": "MarketWatch",
    "published_at": "2026-01-08T16:20:00",
    "tickers": [
      "JPM",
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "McDonald's Global Same-Store Sales Rise 4.1% on Value Menu Push",
    "summary": "McDonald's reported Q4 global comparable sales growth of 4.1%, recovering from weakness earlier in 2025. The company's $5 value meal promotion proved highly effective in driving traffic among budget-conscious diners.",
    "source": "Reuters",
    "published_at": "2026-01-09T08:00:00",
    "tickers": [
      "MCD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Plans Two New Smart Glasses Models for 2026",
    "summary": "According to internal sources, Meta is developing two next-generation Ray-Ban smart glasses codenamed Aperol and Bellini for 2026 release. The devices will feature 'super sensing' capabilities allowing Live AI to run in the background for hours and optional facial recognition.",
    "source": "The Information",
    "published_at": "2026-01-09T10:30:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa Faces Renewed Antitrust Scrutiny Over Debit Card Routing Practices",
    "summary": "The Department of Justice is reportedly expanding its investigation into Visa's debit card routing practices, according to sources familiar with the matter. The probe could lead to regulatory action that would force Visa to allow merchants greater flexibility in processing debit transactions.",
    "source": "Bloomberg",
    "published_at": "2026-01-09T13:10:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Nvidia Unveils Next-Generation Blackwell Ultra GPUs at CES, Stock Rallies 5%",
    "summary": "Nvidia CEO Jensen Huang showcased the Blackwell Ultra architecture at CES 2026, promising a threefold improvement in AI inference performance. The announcement reignited enthusiasm for AI infrastructure spending, lifting the broader semiconductor sector.",
    "source": "CNBC",
    "published_at": "2026-01-09T17:00:00",
    "tickers": [
      "NVDA",
      "QQQ",
      "AMD",
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Vision Pro 2 Rumored for Spring Launch With Lower Price Point",
    "summary": "Supply chain reports suggest Apple is preparing a second-generation Vision Pro headset with a significantly reduced price tag around $1,999. The new model is expected to feature a lighter design and improved battery life, potentially broadening its consumer appeal.",
    "source": "Bloomberg",
    "published_at": "2026-01-10T06:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Robotaxi Involved in 14 Crashes Since Austin Launch",
    "summary": "NHTSA disclosed that Tesla's robotaxi fleet in Austin has been involved in 14 crashes since launching in mid-2025 with safety drivers. While none resulted in serious injuries, the incidents have drawn regulatory scrutiny and raised questions about the pace of autonomous expansion.",
    "source": "CBS News",
    "published_at": "2026-01-10T08:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Mastercard Q4 Revenue Rises 12%, Driven by Cross-Border Travel Surge",
    "summary": "Mastercard reported fourth-quarter revenue of $7.5 billion, a 12% increase from the prior year, powered by strong cross-border travel volumes. The company also raised its quarterly dividend by 15%, signaling confidence in continued growth.",
    "source": "Reuters",
    "published_at": "2026-01-10T08:00:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom's VMware Integration on Track, Analysts Raise Price Targets",
    "summary": "Multiple Wall Street firms raised their price targets on Broadcom following an upbeat investor day presentation. Management reiterated that VMware's subscription transition is ahead of schedule, with annualized recurring revenue exceeding $15 billion.",
    "source": "MarketWatch",
    "published_at": "2026-01-10T10:00:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Launches Firefly 4.0 with Real-Time Video Generation Capabilities",
    "summary": "Adobe released Firefly 4.0, its most advanced generative AI model to date, featuring real-time video generation and editing. The company said the tool is already integrated into Premiere Pro and After Effects, positioning Adobe ahead of competitors in AI-powered creative workflows.",
    "source": "Reuters",
    "published_at": "2026-01-10T12:00:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Fed Minutes Show Officials Increasingly Cautious on Rate Cuts Amid Sticky Inflation",
    "summary": "Minutes from the Federal Reserve's December meeting revealed policymakers growing uneasy about the pace of disinflation, with several members flagging tariff risks as a potential inflation accelerant. Markets now price in only one rate cut for the first half of 2026.",
    "source": "Reuters",
    "published_at": "2026-01-10T14:05:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Costco January Same-Store Sales Rise 8.2%, Topping Estimates",
    "summary": "Costco reported January comparable sales growth of 8.2%, well above the 6.5% consensus estimate. Strong food and sundries sales and a 22% surge in e-commerce drove the outperformance.",
    "source": "MarketWatch",
    "published_at": "2026-01-10T16:30:00",
    "tickers": [
      "COST"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Blackwell GPUs Effectively Sold Out Through Mid-2026",
    "summary": "OEM partners confirmed that NVIDIA's Blackwell B100 and B200 AI accelerators are fully allocated for their first twelve months of production. Demand from hyperscale cloud providers continues to outstrip supply, with TSMC's CoWoS packaging capacity remaining the key bottleneck.",
    "source": "DigiTimes",
    "published_at": "2026-01-11T07:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle Signs Multi-Year Cloud Deal with U.S. Department of Defense Worth $2.1 Billion",
    "summary": "Oracle secured a $2.1 billion contract with the U.S. Department of Defense to modernize military data infrastructure using OCI. The deal spans five years and includes classified cloud environments and AI-driven analytics capabilities.",
    "source": "CNBC",
    "published_at": "2026-01-11T08:45:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Starbucks Reports Weak Q1 as China Traffic Remains Sluggish",
    "summary": "Starbucks posted a 1% decline in global comparable sales for fiscal Q1, with China comps falling 6% as intense local competition persisted. New CEO Brian Niccol acknowledged the turnaround will take longer than initially expected.",
    "source": "Bloomberg",
    "published_at": "2026-01-11T09:15:00",
    "tickers": [
      "SBUX"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "negative"
  },
  {
    "headline": "Tech Giants Face Bipartisan Push for AI Regulation in Congress",
    "summary": "A bipartisan group of U.S. senators introduced the AI Accountability Act, which would require major tech companies to submit AI systems for government review before deployment. Apple, Microsoft, and Alphabet are among the companies that would be most affected by the proposed legislation.",
    "source": "WSJ",
    "published_at": "2026-01-11T12:00:00",
    "tickers": [
      "AAPL",
      "MSFT",
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Cisco to Acquire Cloud Security Startup CipherShield for $4.1 Billion",
    "summary": "Cisco Systems agreed to acquire CipherShield, a fast-growing cloud-native security firm, for $4.1 billion in cash. The deal bolsters Cisco's Security Cloud portfolio and is expected to close in the second quarter of 2026.",
    "source": "The Information",
    "published_at": "2026-01-12T06:30:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Walmart U.S. Comp Sales Jump 5.3% as Grocery Share Grows",
    "summary": "Walmart posted U.S. comparable sales growth of 5.3% for Q4, fueled by market share gains in grocery from both traditional grocers and discounters. The company's pickup and delivery services saw 30% growth year-over-year.",
    "source": "Reuters",
    "published_at": "2026-01-12T07:00:00",
    "tickers": [
      "WMT"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Faces Antitrust Lawsuit Over Third-Party Seller Fees",
    "summary": "The FTC filed an updated antitrust complaint alleging Amazon's marketplace fees unfairly disadvantage third-party sellers. Amazon dismissed the claims as lacking merit, but shares dipped 2.3% in premarket trading on the news.",
    "source": "WSJ",
    "published_at": "2026-01-12T07:30:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "AbbVie Reaches Voluntary Drug Pricing Agreement with Trump Administration",
    "summary": "AbbVie announced a voluntary three-year agreement with the Trump administration to expand access and affordability of its medicines. The deal includes Humira, Synthroid, and other drugs offered through a direct-to-consumer program, alongside a pledge of $100 billion in U.S.-based research and manufacturing investment.",
    "source": "Pharmacy Times",
    "published_at": "2026-01-12T09:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Berkshire Hathaway Acquires Remaining Stake in Pilot Travel Centers",
    "summary": "Berkshire Hathaway completed its acquisition of the remaining interest in Pilot Travel Centers, making it the full owner of the nation's largest operator of truck stops and travel centers. The deal was first announced in 2023 with a phased acquisition structure.",
    "source": "CNBC",
    "published_at": "2026-01-12T10:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "AMD MI350 Secures Deployment Commitments From Microsoft, Meta, OpenAI",
    "summary": "AMD confirmed that its Instinct MI350 series GPUs have secured deployment commitments from major cloud and AI players including Microsoft, Meta, and OpenAI. The MI350 delivers up to 35x inference performance improvement over the previous generation with 288GB HBM3E memory.",
    "source": "Reuters",
    "published_at": "2026-01-12T11:30:00",
    "tickers": [
      "AMD",
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "AbbVie and RemeGen Announce $650M Licensing Agreement for RC148",
    "summary": "AbbVie entered an exclusive licensing agreement with RemeGen for RC148, paying $650 million upfront with up to $4.95 billion in development and commercial milestones. The deal expands AbbVie's oncology pipeline with a novel antibody-drug conjugate candidate.",
    "source": "Reuters",
    "published_at": "2026-01-12T14:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "China Retaliates With Tariffs on U.S. Agriculture and Energy Exports",
    "summary": "Beijing imposed 15% tariffs on American soybeans, corn, and LNG exports in response to the Trump administration's trade actions. Agricultural stocks tumbled while energy names saw mixed reactions as markets assessed the scope of the escalation.",
    "source": "Bloomberg",
    "published_at": "2026-01-13T08:30:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM",
      "XLE"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Europe Sales Decline for 12th Consecutive Month in December",
    "summary": "Tesla's European sales continued their downward trend, marking the 12th straight monthly decline. Brand damage from Elon Musk's political activities and rising competition from BYD and European automakers have eroded Tesla's market share across the continent.",
    "source": "CNBC",
    "published_at": "2026-01-13T09:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Caterpillar Revenue Declines 7% as Construction Equipment Demand Cools",
    "summary": "Caterpillar reported Q4 revenue of $15.8 billion, down 7% year-over-year as dealers reduced inventory and construction spending moderated. The company maintained its full-year 2026 guidance, citing infrastructure project backlogs.",
    "source": "Bloomberg",
    "published_at": "2026-01-13T09:00:00",
    "tickers": [
      "CAT"
    ],
    "sector": "Industrials",
    "sentiment": "negative"
  },
  {
    "headline": "Eli Lilly vs Novo Nordisk: Analysts Debate GLP-1 Market Dominance in 2026",
    "summary": "With Eli Lilly holding a 60% share of the U.S. GLP-1 market and its oral obesity pill nearing FDA approval, analysts weigh whether Novo Nordisk can maintain competitive footing. Lilly's tirzepatide franchise continues to outpace expectations while Novo faces potential sales declines in 2026.",
    "source": "Motley Fool",
    "published_at": "2026-01-13T09:30:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Google Cloud Lands $800 Million U.S. Defense Department Contract",
    "summary": "Alphabet's Google Cloud division won an $800 million multi-year contract with the Department of Defense for secure cloud computing services. The contract covers data analytics and AI capabilities for non-classified military operations.",
    "source": "Reuters",
    "published_at": "2026-01-13T09:45:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Launches AI-Powered Commercial Lending Platform",
    "summary": "JPMorgan Chase unveiled a new artificial intelligence-driven platform for commercial lending that aims to cut loan approval times by 60%. The system uses machine learning models trained on decades of credit data to assess risk and streamline underwriting decisions.",
    "source": "Financial Times",
    "published_at": "2026-01-13T11:30:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Intel's Foundry Business Lands First Major External Customer",
    "summary": "Intel confirmed it has signed a significant multi-year foundry agreement with a leading automotive semiconductor company to manufacture chips on its Intel 18A process node. The deal marks a milestone for Intel's ambitious plan to become a major contract chipmaker.",
    "source": "Reuters",
    "published_at": "2026-01-13T12:00:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Data Cloud Processes Over 1 Trillion AI Transactions Per Day",
    "summary": "Salesforce announced that its Data Cloud platform now processes more than one trillion AI-powered transactions daily. The milestone reflects accelerating enterprise demand for unified data platforms that support real-time AI inference.",
    "source": "MarketWatch",
    "published_at": "2026-01-13T13:15:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Expands Into Live Sports with Exclusive Premier League Package",
    "summary": "Netflix secured exclusive streaming rights to 40 Premier League matches per season starting in 2027. The multi-billion-dollar deal marks Netflix's biggest push into live sports content and is expected to drive subscriber retention in key European markets.",
    "source": "Financial Times",
    "published_at": "2026-01-14T06:00:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Sees $500 Billion Blackwell-Rubin Pipeline Through 2026",
    "summary": "NVIDIA disclosed a revenue pipeline exceeding $500 billion for its Blackwell and Rubin product families through calendar year 2026. Major cloud providers including Meta, Microsoft, and Amazon have committed to multi-billion dollar allocations of upcoming Rubin chips.",
    "source": "DigiTimes",
    "published_at": "2026-01-14T08:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Eli Lilly's Weight Loss Drug May Offer Pain Relief Benefit",
    "summary": "New research suggests Eli Lilly's most promising weight loss drug candidate may deliver an unexpected benefit in pain relief. The findings could expand the addressable market for GLP-1 therapies beyond obesity and diabetes into chronic pain management.",
    "source": "Motley Fool",
    "published_at": "2026-01-14T08:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Teams Surpasses 400 Million Monthly Active Users",
    "summary": "Microsoft announced that Teams has crossed the 400 million monthly active user milestone, driven by the integration of AI-powered meeting summaries and Copilot features. The platform continues to gain ground against competitors Slack and Zoom in the enterprise collaboration space.",
    "source": "MarketWatch",
    "published_at": "2026-01-14T08:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "GE Aerospace Posts 25% Profit Growth on Strong Aftermarket Demand",
    "summary": "GE Aerospace reported Q4 operating profit growth of 25%, driven by surging demand for engine maintenance and spare parts. The company's installed base of over 44,000 commercial engines continues to generate recurring high-margin revenue.",
    "source": "CNBC",
    "published_at": "2026-01-14T08:30:00",
    "tickers": [
      "GE"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "December CPI Comes in Hot at 3.1% Year-Over-Year, Core CPI at 3.4%",
    "summary": "Consumer prices rose 0.4% month-over-month in December, pushing the annual rate to 3.1% and dashing hopes of a swift return to the Fed's 2% target. Core CPI, which excludes food and energy, remained stubbornly elevated at 3.4%, complicating the monetary policy outlook.",
    "source": "AP",
    "published_at": "2026-01-14T08:35:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Goldman Sachs Wealth Management Unit Attracts $45 Billion in Net Inflows",
    "summary": "Goldman Sachs reported $45 billion in net asset inflows to its wealth management division during the fourth quarter, the strongest period on record. The firm credited expansion into the ultra-high-net-worth segment and improved digital advisory tools for the gains.",
    "source": "Barron's",
    "published_at": "2026-01-14T09:15:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm and Broadcom Stocks Rise on AI Chip Spending Forecast",
    "summary": "Shares of Qualcomm and Broadcom both climbed more than 3% after a Gartner report projected global AI semiconductor spending would surpass $120 billion in 2026. Both companies are positioned to benefit from edge AI and data center infrastructure buildouts.",
    "source": "CNBC",
    "published_at": "2026-01-14T15:30:00",
    "tickers": [
      "QCOM",
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Small Caps Sink to Two-Month Low as Rate-Cut Hopes Fade",
    "summary": "The Russell 2000 index dropped 2.3% following the hot CPI print, extending its losing streak to five sessions. Higher-for-longer interest rate expectations disproportionately hurt smaller companies that rely more heavily on floating-rate debt.",
    "source": "MarketWatch",
    "published_at": "2026-01-14T16:30:00",
    "tickers": [
      "IWM",
      "SPY"
    ],
    "sector": "Market",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Supplier Foxconn Reports Weak Demand for iPhone 17 Components",
    "summary": "Foxconn's latest quarterly report revealed lower-than-expected orders for iPhone 17 components, raising concerns about soft consumer demand. Analysts caution that Apple may face headwinds in the premium smartphone segment amid global economic uncertainty.",
    "source": "Bloomberg",
    "published_at": "2026-01-15T05:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Visa and Mastercard Face EU Pressure to Lower Interchange Fees",
    "summary": "European regulators are weighing new caps on interchange fees charged by Visa and Mastercard for online transactions, according to a draft proposal seen by the Financial Times. The move could reduce revenue from European e-commerce payments by an estimated 5-8%.",
    "source": "Financial Times",
    "published_at": "2026-01-15T06:45:00",
    "tickers": [
      "V",
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "JPMorgan Kicks Off Earnings Season With Record Revenue, Shares Jump 3%",
    "summary": "JPMorgan Chase reported Q4 earnings of $4.81 per share on record revenue of $44.2 billion, beating analyst estimates on both lines. CEO Jamie Dimon struck a cautiously optimistic tone, citing strong consumer spending but warning of geopolitical headwinds.",
    "source": "CNBC",
    "published_at": "2026-01-15T07:00:00",
    "tickers": [
      "JPM",
      "SPY",
      "DIA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "RTX Secures $8.5 Billion Patriot Missile System Deal with NATO Allies",
    "summary": "RTX received an $8.5 billion contract to supply Patriot missile defense systems to a consortium of NATO countries. The deal reflects heightened European defense spending and growing demand for advanced air defense capabilities.",
    "source": "Bloomberg",
    "published_at": "2026-01-15T08:00:00",
    "tickers": [
      "RTX"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Texas Instruments Begins Production at New 300mm Fab in Lehi, Utah",
    "summary": "Texas Instruments announced the start of volume production at its new 300mm wafer fabrication facility in Lehi, Utah. The plant is expected to ramp to full capacity by mid-2027 and will primarily produce analog and embedded processing chips.",
    "source": "Bloomberg",
    "published_at": "2026-01-15T09:00:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "OpenAI Hires Star AI Researcher From Meta, Intensifying Talent War",
    "summary": "OpenAI poached Ruoming Pang, a leading AI researcher from Meta's FAIR lab, in a move that intensifies the talent war among AI companies. The departure highlights the competitive pressure Meta faces in retaining top researchers despite its massive AI investment.",
    "source": "The Information",
    "published_at": "2026-01-15T10:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Adobe Reports Slower Creative Cloud Growth as SMB Customers Churn",
    "summary": "Adobe disclosed that Creative Cloud growth decelerated to 9% year-over-year, down from 13% in the prior quarter. Analysts pointed to increased churn among small and medium businesses facing tighter budgets and competition from free AI tools.",
    "source": "Bloomberg",
    "published_at": "2026-01-15T15:30:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "AbbVie Reports Positive Phase 3 Results for Epcoritamab in DLBCL",
    "summary": "AbbVie reported topline Phase 3 EPCORE DLBCL-1 results for epcoritamab in relapsed/refractory diffuse large B-cell lymphoma, enrolling 483 patients. The trial showed improved progression-free survival, supporting a potential regulatory filing for this blood cancer treatment.",
    "source": "AbbVie",
    "published_at": "2026-01-16T07:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Accenture Reports Mixed Q1 Results as Consulting Bookings Slow",
    "summary": "Accenture posted fiscal Q1 earnings that beat estimates on the bottom line but missed on revenue. New bookings in the consulting segment declined 4% year-over-year as enterprise clients delayed large discretionary transformation projects.",
    "source": "WSJ",
    "published_at": "2026-01-16T07:00:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "PPI Data Shows Producer Prices Easing, Offering Some Inflation Relief",
    "summary": "The Producer Price Index rose just 0.1% in December, below the 0.3% forecast, suggesting pipeline inflation pressures may be subsiding. The softer reading provided a counterpoint to the hotter CPI data earlier in the week, giving bond markets a modest lift.",
    "source": "Reuters",
    "published_at": "2026-01-16T08:40:00",
    "tickers": [
      "SPY",
      "QQQ"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle and NVIDIA Deepen Partnership for AI-Optimized Cloud Infrastructure",
    "summary": "Oracle and NVIDIA announced an expanded partnership to deploy next-generation GPU clusters across OCI data centers. The collaboration aims to offer enterprises the lowest-latency AI training environment available on any public cloud.",
    "source": "Reuters",
    "published_at": "2026-01-16T09:00:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NextEra Energy Reports Record Renewable Capacity Additions in 2025",
    "summary": "NextEra Energy added a record 8.5 GW of renewable energy capacity in 2025, including 5 GW of solar and 3.5 GW of wind. The company now operates over 35 GW of wind and solar assets across North America.",
    "source": "Bloomberg",
    "published_at": "2026-01-16T10:00:00",
    "tickers": [
      "NEE"
    ],
    "sector": "Utilities",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Stock Outperforms Megacap Peers, Up 5% YTD",
    "summary": "NVIDIA shares have risen 5% year-to-date in 2026, making it one of only two trillion-dollar companies (alongside Apple) to post gains while the Nasdaq is down 0.4%. Strong AI infrastructure demand and the Rubin platform reveal have underpinned investor confidence.",
    "source": "Bloomberg",
    "published_at": "2026-01-16T14:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Sees Rising Consumer Credit Delinquencies in Card Portfolio",
    "summary": "JPMorgan Chase disclosed that credit card delinquency rates rose to 1.85% in the fourth quarter, up from 1.62% a year earlier. CFO Jeremy Barnum said the increase is consistent with normalization trends and the bank has adequate reserves to absorb potential losses.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-16T14:00:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Alphabet Reports Mixed Q4 Earnings: Search Strong, Cloud Misses",
    "summary": "Alphabet posted Q4 2025 earnings with revenue of $92.4 billion, beating estimates on the strength of search advertising. However, Google Cloud revenue of $11.8 billion missed analyst expectations of $12.3 billion, sending shares lower in after-hours trading.",
    "source": "CNBC",
    "published_at": "2026-01-16T16:30:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Berkshire Hathaway's GEICO Reports Best Combined Ratio in Five Years",
    "summary": "GEICO, the auto insurance subsidiary of Berkshire Hathaway, posted a combined ratio of 88.5% for 2025, its best underwriting performance since 2020. The improvement reflects disciplined pricing actions and lower claims frequency driven by advanced telematics adoption.",
    "source": "Reuters",
    "published_at": "2026-01-17T08:30:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Linde Reports Record Q4 Earnings Driven by Electronics and Healthcare",
    "summary": "Linde posted record fourth-quarter adjusted EPS of $4.12, beating estimates by $0.15. Strong demand from semiconductor fabrication plants and healthcare facilities drove double-digit growth in the Americas and APAC regions.",
    "source": "Reuters",
    "published_at": "2026-01-17T08:30:00",
    "tickers": [
      "LIN"
    ],
    "sector": "Materials",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Copilot Revenue Hits $10 Billion Annualized Run Rate",
    "summary": "Microsoft disclosed that its Copilot AI assistant products have reached a $10 billion annualized revenue run rate, exceeding internal targets by six months. Enterprise adoption of Copilot for Microsoft 365 has been the primary driver of growth.",
    "source": "WSJ",
    "published_at": "2026-01-17T11:15:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Prime Membership Hits 250 Million Globally, Up 12% Year-Over-Year",
    "summary": "Amazon reported that Prime memberships reached 250 million worldwide, fueled by expansion in India and Southeast Asia. The company also noted that Prime Video viewership hours grew 35% year-over-year.",
    "source": "CNBC",
    "published_at": "2026-01-17T11:30:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Trump Threatens 25% Tariffs on EU Auto Imports Over Trade Imbalance",
    "summary": "President Trump warned of a 25% levy on European automobiles unless the EU addresses what he called an unfair trade deficit with the United States. European automakers BMW, Mercedes, and Volkswagen saw sharp declines on the news.",
    "source": "Financial Times",
    "published_at": "2026-01-17T12:00:00",
    "tickers": [
      "SPY",
      "DIA",
      "GM",
      "F"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce Cuts 1,200 Jobs in Restructuring Focused on AI Efficiency",
    "summary": "Salesforce announced layoffs affecting approximately 1,200 employees, primarily in sales and customer support roles. The company said AI automation has allowed it to achieve the same output with fewer human agents, and savings will be reinvested into AI R&D.",
    "source": "WSJ",
    "published_at": "2026-01-18T08:00:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Philip Morris International Beats Estimates as IQOS Adoption Accelerates",
    "summary": "Philip Morris reported Q4 revenue growth of 9% driven by continued adoption of its IQOS heated tobacco device, which now represents 38% of total revenue. The smoke-free product category grew 22% year-over-year.",
    "source": "Bloomberg",
    "published_at": "2026-01-18T09:00:00",
    "tickers": [
      "PM"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Jensen Huang Declares 'The Race Is On for AI' as Spending Surges",
    "summary": "NVIDIA CEO Jensen Huang told investors that the global race for AI supremacy is accelerating, with major tech companies committing hundreds of billions in infrastructure spending. He highlighted that every major cloud provider has expanded their NVIDIA GPU orders for 2026 and beyond.",
    "source": "Motley Fool",
    "published_at": "2026-01-18T09:30:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom Custom AI Chip Orders Double, CEO Hock Tan Says",
    "summary": "Broadcom CEO Hock Tan told analysts at a JPMorgan conference that orders for the company's custom AI accelerators have roughly doubled compared to a year ago. Three of the top five hyperscalers are now Broadcom custom silicon customers.",
    "source": "Bloomberg",
    "published_at": "2026-01-18T13:45:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Chevron Completes $6.3 Billion LNG Expansion in Australia",
    "summary": "Chevron has completed a major expansion of its Gorgon LNG facility in Western Australia, boosting capacity by 15%. The project positions Chevron to capitalize on growing Asian demand for liquefied natural gas.",
    "source": "Reuters",
    "published_at": "2026-01-19T07:30:00",
    "tickers": [
      "CVX"
    ],
    "sector": "Energy",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Invests $1.5 Billion in U.S. Chip Manufacturing Facility",
    "summary": "Apple announced a $1.5 billion investment in a new chip packaging facility in Arizona, part of its strategy to diversify its semiconductor supply chain. The facility will create approximately 3,000 jobs and is expected to be operational by late 2027.",
    "source": "Reuters",
    "published_at": "2026-01-19T10:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Password-Sharing Crackdown Generates $1.2 Billion in New Revenue",
    "summary": "Netflix estimated that its ongoing password-sharing enforcement has driven $1.2 billion in incremental revenue since the policy was fully rolled out. Approximately 45 million previously unauthorized accounts have converted to paid subscriptions.",
    "source": "MarketWatch",
    "published_at": "2026-01-19T10:15:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Goldman Sachs to Cut 250 Positions in Consumer Banking Wind-Down",
    "summary": "Goldman Sachs confirmed it will eliminate approximately 250 positions as it continues to wind down its consumer banking operations, including the Marcus savings platform. The firm is redirecting resources toward its core institutional businesses and wealth management.",
    "source": "Bloomberg",
    "published_at": "2026-01-19T12:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Cisco's Splunk Revenue Disappoints, Shares Dip in After-Hours Trading",
    "summary": "Cisco reported that its Splunk observability unit generated $1.05 billion in quarterly revenue, below the $1.15 billion consensus. Investors had anticipated faster growth from the $28 billion acquisition, and shares fell 4% in extended trading.",
    "source": "MarketWatch",
    "published_at": "2026-01-19T17:30:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Google Fined $2.3 Billion by EU Over Search Advertising Practices",
    "summary": "The European Commission imposed a $2.3 billion fine on Alphabet for allegedly favoring its own advertising services in search results. Alphabet said it will appeal the decision, calling the ruling inconsistent with prior remedies it had implemented.",
    "source": "Financial Times",
    "published_at": "2026-01-20T07:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Major Cloud Providers See Slowing Enterprise Spending in Q1 Survey",
    "summary": "A Morgan Stanley survey of 200 CIOs found that enterprise cloud spending growth is expected to slow to 18% in 2026, down from 24% in 2025. The deceleration could impact revenue growth at Amazon, Oracle, and Salesforce's cloud divisions.",
    "source": "Bloomberg",
    "published_at": "2026-01-20T07:45:00",
    "tickers": [
      "AMZN",
      "ORCL",
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Intel Announces Additional 5,000 Job Cuts as Restructuring Deepens",
    "summary": "Intel said it would eliminate approximately 5,000 additional positions across its product engineering and corporate functions. The layoffs are part of CEO Lip-Bu Tan's turnaround plan to reduce costs by $3 billion annually and refocus on core semiconductor design.",
    "source": "WSJ",
    "published_at": "2026-01-20T08:00:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "AMD Instinct MI350 Delivers 35x Inference Performance Leap",
    "summary": "AMD's production-ready MI350 series demonstrated up to 35x inference performance improvement over its predecessor in benchmark tests. The 4th-gen CDNA architecture with 288GB HBM3E and support for MXFP4 datatypes positions AMD as a credible alternative to NVIDIA for AI inference workloads.",
    "source": "AnandTech",
    "published_at": "2026-01-20T10:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa Partners with Central Banks on Cross-Border CBDC Settlement Trial",
    "summary": "Visa announced a pilot program with three central banks in Asia-Pacific to test cross-border settlement using central bank digital currencies. The initiative builds on Visa's existing blockchain infrastructure and could reshape international payment corridors.",
    "source": "CNBC",
    "published_at": "2026-01-20T10:15:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Cloud Revenue Surges 28% as AI Workloads Drive Azure Growth",
    "summary": "Microsoft reported fiscal Q2 results showing Azure revenue growth of 28%, powered by surging demand for AI infrastructure and services. The company raised full-year guidance, sending shares up 4% in after-hours trading.",
    "source": "Bloomberg",
    "published_at": "2026-01-20T16:15:00",
    "tickers": [
      "MSFT",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Johnson & Johnson Reports Strong Q4 2025 with 11.5% Operational Sales Growth",
    "summary": "J&J reported Q4 2025 operational sales growth of 11.5%, with full-year oncology sales growing 21% and DARZALEX crossing $14 billion in annual revenue. The company issued 2026 guidance of $100.5 billion in estimated sales, representing 6.7% growth, and adjusted EPS of $11.53.",
    "source": "Johnson & Johnson",
    "published_at": "2026-01-21T06:30:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Acquires AI Video Startup Runway for $3.8 Billion",
    "summary": "Adobe announced the acquisition of Runway, a leading AI video generation startup, for $3.8 billion in cash and stock. The deal will bolster Adobe's generative AI capabilities in video production and is expected to close in Q2 2026.",
    "source": "Reuters",
    "published_at": "2026-01-21T06:30:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Boeing Wins $12 Billion Saudi Arabia Fighter Jet Contract",
    "summary": "Boeing secured a $12 billion contract to supply F-15EX fighter jets to Saudi Arabia, one of the largest defense deals in recent years. The contract includes aircraft, spare parts, and a 10-year maintenance agreement.",
    "source": "Bloomberg",
    "published_at": "2026-01-21T08:00:00",
    "tickers": [
      "BA"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "J&J Issues 2026 Guidance: $100.5B Revenue on Oncology and MedTech Strength",
    "summary": "Johnson & Johnson projected 2026 sales of $100.5 billion driven by positive growth in immunology, oncology, and neurology. The company highlighted DARZALEX, TREMFYA, and its expanding MedTech portfolio as key growth engines, while managing ongoing talc litigation exposure.",
    "source": "CNBC",
    "published_at": "2026-01-21T09:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Partners With Major Automakers on Alpamayo Autonomous Driving",
    "summary": "Several major automakers announced plans to integrate NVIDIA's Alpamayo autonomous driving AI platform into their next-generation vehicles. The open reasoning model, unveiled at CES, has attracted interest for its ability to explain driving decisions in real-time.",
    "source": "Reuters",
    "published_at": "2026-01-21T10:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm Settles Patent Dispute with Arm Holdings",
    "summary": "Qualcomm and Arm Holdings reached a confidential settlement resolving their long-running licensing dispute over Nuvia-derived chip designs. The agreement removes a major legal overhang that had weighed on Qualcomm shares for over two years.",
    "source": "Reuters",
    "published_at": "2026-01-21T11:15:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft and OpenAI Expand Partnership With New $5 Billion AI Data Center",
    "summary": "Microsoft and OpenAI announced plans to build a $5 billion AI-focused data center in Texas, the largest single AI infrastructure investment to date. The facility will support training of next-generation AI models and is expected to come online in early 2028.",
    "source": "Bloomberg",
    "published_at": "2026-01-21T13:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard Raises Full-Year Revenue Guidance, Shares Hit All-Time High",
    "summary": "Mastercard raised its 2026 revenue growth guidance to 13-15%, citing stronger-than-expected consumer spending and rapid adoption of contactless payments globally. Shares surged 4.2% to an all-time high of $562 following the announcement.",
    "source": "MarketWatch",
    "published_at": "2026-01-21T15:45:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "S&P 500 Hits All-Time High Above 6,200 on Strong Earnings Momentum",
    "summary": "The S&P 500 surpassed 6,200 for the first time, buoyed by a wave of better-than-expected corporate earnings and easing bond yields. Technology and financial sectors led the advance, with over 78% of reporting companies beating profit estimates.",
    "source": "CNBC",
    "published_at": "2026-01-21T16:05:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Market",
    "sentiment": "positive"
  },
  {
    "headline": "Abbott Reports Q4 2025 Results and Issues Strong 2026 Outlook",
    "summary": "Abbott reported full-year 2025 sales of $44.3 billion, up 5.7%, with adjusted diluted EPS of $5.15 reflecting 10% growth. The company projected 2026 organic sales growth of 6.5% to 7.5% and adjusted diluted EPS of $5.55 to $5.80, signaling continued momentum across its diversified healthcare portfolio.",
    "source": "Abbott",
    "published_at": "2026-01-22T06:30:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Abbott's Volt PFA System Gains FDA Approval for Atrial Fibrillation",
    "summary": "Abbott announced FDA approval for its Volt Pulsed Field Ablation System, bringing the company's first PFA offering to U.S. patients with atrial fibrillation. The approval strengthens Abbott's electrophysiology portfolio and positions it to compete in the rapidly growing cardiac ablation market.",
    "source": "Abbott",
    "published_at": "2026-01-22T08:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan and Goldman Sachs Lead $12 Billion Bond Offering for Tech Giant",
    "summary": "JPMorgan Chase and Goldman Sachs served as joint lead underwriters on a $12 billion investment-grade bond offering for a major technology company, the largest corporate debt deal of 2026 so far. The offering attracted strong demand from institutional investors seeking yield.",
    "source": "Reuters",
    "published_at": "2026-01-22T09:00:00",
    "tickers": [
      "JPM",
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Apple's Services Revenue Growth Slows, Raising Investor Concerns",
    "summary": "Apple's services division, which includes the App Store, Apple Music, and iCloud, grew at its slowest pace in three years during Q1 FY2026. While still profitable, the deceleration has prompted analysts to reassess the company's growth trajectory.",
    "source": "MarketWatch",
    "published_at": "2026-01-22T09:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Texas Instruments Analog Chip Pricing Stable Despite Inventory Build",
    "summary": "A survey of distributors by Susquehanna Financial found that Texas Instruments analog chip pricing remained stable in January despite elevated channel inventory. Analysts say the pricing resilience reflects TI's disciplined approach and improving end-market demand signals.",
    "source": "Bloomberg",
    "published_at": "2026-01-22T10:30:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Exxon Expands Guyana Operations with New Deepwater Discovery",
    "summary": "ExxonMobil announced a significant new oil discovery offshore Guyana, estimating recoverable resources of 600 million barrels. The find adds to the company's already dominant position in the Stabroek block.",
    "source": "Bloomberg",
    "published_at": "2026-01-22T11:00:00",
    "tickers": [
      "XOM"
    ],
    "sector": "Energy",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Launches Robotaxi Rides in Austin Without Safety Driver",
    "summary": "Tesla began offering unsupervised robotaxi rides in Austin, Texas, with CEO Elon Musk announcing the milestone on X. The company started mixing in vehicles without safety monitors alongside its existing supervised fleet, marking a major step toward fully autonomous ride-hailing.",
    "source": "TechCrunch",
    "published_at": "2026-01-22T12:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "positive"
  },
  {
    "headline": "Abbott Announces Agreement to Acquire Exact Sciences for $21B",
    "summary": "Abbott confirmed its agreement to acquire cancer diagnostics leader Exact Sciences for $105 per share in cash, at a total equity value of approximately $21 billion. The deal, expected to close in Q2 2026, positions Abbott to enter and lead the fast-growing cancer diagnostics market.",
    "source": "Bloomberg",
    "published_at": "2026-01-22T12:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle Expands Autonomous Database to Support Multi-Cloud Deployments",
    "summary": "Oracle announced that its Autonomous Database can now run natively on AWS, Azure, and Google Cloud in addition to OCI. The multi-cloud strategy is expected to remove a key barrier for enterprises hesitant to commit to a single cloud provider.",
    "source": "CNBC",
    "published_at": "2026-01-22T14:00:00",
    "tickers": [
      "ORCL",
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Fed Holds Rates Steady at 4.25%-4.50%, Signals Patience on Further Cuts",
    "summary": "The Federal Reserve left its benchmark interest rate unchanged at its January meeting, as widely expected, and indicated it would need to see more progress on inflation before resuming rate reductions. Chair Powell emphasized that policy decisions would remain data-dependent.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-22T14:00:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "neutral"
  },
  {
    "headline": "Powell Press Conference: 'No Rush' to Cut Rates Further Given Economic Strength",
    "summary": "Federal Reserve Chair Jerome Powell said the central bank sees no urgency to lower interest rates, pointing to a strong labor market and resilient consumer spending. He acknowledged tariff uncertainty as a new variable the Fed is closely monitoring.",
    "source": "Reuters",
    "published_at": "2026-01-22T14:45:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "neutral"
  },
  {
    "headline": "UnitedHealth Group Reports Q4 2025 Earnings, Misses Revenue Estimates",
    "summary": "UnitedHealth met Q4 2025 EPS forecasts at $2.11 but missed revenue expectations with $113.2 billion versus the $113.73 billion consensus. Full-year 2025 revenues reached $448 billion with 12% growth, but the stock plummeted over 16% in pre-market trading on weak guidance.",
    "source": "CNBC",
    "published_at": "2026-01-23T06:30:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Abbott Receives CE Mark for TactiFlex Duo Ablation Catheter",
    "summary": "Abbott obtained CE Mark approval for its TactiFlex Duo Ablation Catheter, designed to deliver both radiofrequency and pulsed field ablation energy to treat atrial fibrillation patients. The dual-energy catheter represents a significant advancement in cardiac rhythm management technology.",
    "source": "Abbott",
    "published_at": "2026-01-23T07:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway's Railroad Unit BNSF Reports Flat Volumes Amid Weak Manufacturing",
    "summary": "BNSF Railway, the Berkshire Hathaway-owned freight carrier, reported essentially flat shipping volumes for the fourth quarter as weakness in manufacturing and coal shipments offset gains in intermodal and agricultural freight. Management expects a modest recovery in the first half of 2026.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-23T07:30:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Amazon Alexa+ Subscription Reaches 15 Million Users in First Year",
    "summary": "Amazon's premium Alexa+ AI assistant service has attracted 15 million paying subscribers since its launch. The service, which costs $9.99 per month, offers advanced conversational AI, smart home automation, and personalized recommendations.",
    "source": "Financial Times",
    "published_at": "2026-01-23T09:30:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "UnitedHealth Guides 2026 Revenue to $439B, First Annual Decline in Decades",
    "summary": "UnitedHealth Group issued cautious 2026 guidance projecting revenue of $439 billion, down from $448 billion in 2025, marking its first annual revenue decline in decades. Management cited weaker Medicare Advantage member growth, commercial healthcare trends approaching 11%, and Medicaid rate pressures.",
    "source": "Seeking Alpha",
    "published_at": "2026-01-23T10:00:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Accenture Launches Generative AI Practice with 50,000 Trained Consultants",
    "summary": "Accenture announced it has now trained over 50,000 consultants in generative AI tools and deployment. The firm said its AI-related bookings exceeded $3 billion in the latest quarter, nearly triple the figure from a year earlier.",
    "source": "CNBC",
    "published_at": "2026-01-23T14:00:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Alphabet's YouTube Shorts Monetization Surges 60% Year-Over-Year",
    "summary": "YouTube Shorts ad revenue grew 60% year-over-year in Q4 2025, reaching $3.2 billion for the quarter. The short-form video platform has successfully attracted advertiser spending as it competes with TikTok for creator and viewer attention.",
    "source": "CNBC",
    "published_at": "2026-01-23T14:45:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NextEra Wins Approval for $3.2 Billion Florida Rate Increase",
    "summary": "Florida regulators approved NextEra's subsidiary FPL's request for a $3.2 billion rate increase over four years to fund grid hardening and solar expansion. The decision provides revenue certainty through 2030.",
    "source": "Reuters",
    "published_at": "2026-01-23T15:30:00",
    "tickers": [
      "NEE"
    ],
    "sector": "Utilities",
    "sentiment": "positive"
  },
  {
    "headline": "UnitedHealth Stock Collapses 16% on Weak 2026 Outlook and Medicare Pressure",
    "summary": "UNH shares fell 16.39% after the company missed Q4 revenue estimates and issued below-consensus 2026 guidance. Analysts flagged ongoing DOJ investigations into Medicare Advantage billing practices and Optum Rx as additional overhang on the stock.",
    "source": "Simply Wall St",
    "published_at": "2026-01-23T16:00:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Misses Q4 Deliveries Estimate, Stock Falls 7% After Hours",
    "summary": "Tesla delivered 480,000 vehicles in Q4, falling short of the 505,000 consensus estimate as competition intensified in China and Europe. Revenue also missed expectations, and the company's automotive margins compressed further to 16.3%.",
    "source": "Bloomberg",
    "published_at": "2026-01-23T16:30:00",
    "tickers": [
      "TSLA",
      "QQQ",
      "SPY"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "negative"
  },
  {
    "headline": "Microsoft Faces FTC Probe Over Bundling Copilot With Windows 12",
    "summary": "The Federal Trade Commission has opened a preliminary investigation into Microsoft's decision to bundle its Copilot AI assistant with Windows 12 at no additional cost. Competitors allege the practice constitutes anti-competitive behavior in the AI productivity software market.",
    "source": "WSJ",
    "published_at": "2026-01-24T08:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Q4 GDP Grows at 2.8% Annualized Rate, Beating Expectations",
    "summary": "The U.S. economy expanded at a 2.8% annualized pace in the fourth quarter, exceeding the 2.4% consensus and capping a stronger-than-expected year. Consumer spending and business investment were the primary growth drivers.",
    "source": "AP",
    "published_at": "2026-01-24T08:30:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Home Depot Acquires SRS Distribution to Bolster Pro Business",
    "summary": "Home Depot completed its $18.25 billion acquisition of SRS Distribution, significantly expanding its reach with professional contractors. The deal makes Home Depot the largest distributor of roofing, landscaping, and pool supplies in North America.",
    "source": "Bloomberg",
    "published_at": "2026-01-24T10:00:00",
    "tickers": [
      "HD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "GLJ Research Maintains $25 Bear Case on Tesla",
    "summary": "GLJ Research analyst Gordon Johnson reiterated his $25.28 price target on Tesla, the lowest on Wall Street, arguing that the company's core auto business is deteriorating and robotaxi revenue is years away from materiality. The stark contrast with Wedbush's $600 target highlights extreme analyst disagreement.",
    "source": "Bloomberg",
    "published_at": "2026-01-24T11:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce Agentforce 2.0 Automates 60% of Customer Service Interactions",
    "summary": "Salesforce reported that its Agentforce 2.0 AI platform now handles 60% of customer service interactions without human intervention for early adopters. The company projects this figure will reach 80% by year-end as the technology improves.",
    "source": "WSJ",
    "published_at": "2026-01-24T11:00:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa Invests $500 Million in Fintech Accelerator Program",
    "summary": "Visa committed $500 million to a new fintech accelerator program aimed at supporting startups in embedded finance, open banking, and real-time payments. The move is seen as a strategic play to maintain Visa's position as fintech partnerships increasingly reshape the payments landscape.",
    "source": "Bloomberg",
    "published_at": "2026-01-24T11:20:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Raises Subscription Prices Across All Tiers in the U.S. and Canada",
    "summary": "Netflix announced price increases of $1 to $2.50 per month across its Standard, Premium, and ad-supported tiers in the U.S. and Canada. The company cited increased content investment and inflation as reasons, while analysts warned of potential subscriber churn.",
    "source": "Bloomberg",
    "published_at": "2026-01-25T08:00:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Goldman Sachs Traders Deliver Record Equities Revenue in Q4",
    "summary": "Goldman Sachs reported record fourth-quarter equities trading revenue of $3.4 billion, driven by elevated client activity and strong performance in derivatives markets. The results helped offset a decline in fixed-income trading, which was weighed down by tighter spreads.",
    "source": "Barron's",
    "published_at": "2026-01-25T08:45:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Semiconductor Stocks Slide on China Export Control Fears",
    "summary": "Shares of major chipmakers including Broadcom, Qualcomm, Intel, and Texas Instruments fell broadly after reports that the U.S. Commerce Department is considering tighter restrictions on AI chip exports to China. The proposed rules could limit sales of advanced networking and accelerator chips.",
    "source": "Reuters",
    "published_at": "2026-01-25T09:45:00",
    "tickers": [
      "AVGO",
      "QCOM",
      "INTC",
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Wedbush Sets $600 Price Target on Tesla, Cites Robotaxi Potential",
    "summary": "Wedbush analyst Dan Ives maintained his Street-high $600 price target on Tesla, citing the robotaxi launch in Austin and plans to expand to seven more cities in H1 2026. Ives called Tesla's autonomous driving efforts 'the most underappreciated asset on the planet.'",
    "source": "CNBC",
    "published_at": "2026-01-25T10:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "positive"
  },
  {
    "headline": "Coca-Cola Partners with Major League Soccer on 10-Year Sponsorship",
    "summary": "Coca-Cola signed a landmark 10-year sponsorship deal with MLS valued at over $1 billion, replacing its previous agreement. The deal gives Coca-Cola exclusive non-alcoholic beverage rights across all MLS venues and broadcasts.",
    "source": "Bloomberg",
    "published_at": "2026-01-25T12:00:00",
    "tickers": [
      "KO"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Launches Apple Intelligence Features in China After Regulatory Approval",
    "summary": "Apple received regulatory approval to roll out its Apple Intelligence AI features in mainland China, the company's second-largest market. The localized AI suite includes on-device language models trained in compliance with China's data governance requirements.",
    "source": "Reuters",
    "published_at": "2026-01-26T04:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "RTX Q4 Earnings Beat Estimates on Defense and Pratt & Whitney Growth",
    "summary": "RTX reported Q4 adjusted EPS of $1.45, beating estimates by $0.08, as both its defense systems and Pratt & Whitney segments delivered strong growth. The company guided for 7-9% organic revenue growth in 2026.",
    "source": "Reuters",
    "published_at": "2026-01-26T07:45:00",
    "tickers": [
      "RTX"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard Faces Class-Action Lawsuit Over Data Privacy Practices",
    "summary": "A federal judge in New York certified a class-action lawsuit alleging Mastercard improperly shared cardholder transaction data with third-party marketers without adequate consent. Mastercard denied the allegations and said it would vigorously defend its data practices in court.",
    "source": "Reuters",
    "published_at": "2026-01-26T13:00:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Adobe Stock Drops 5% After Analyst Downgrades Citing AI Competition Risks",
    "summary": "JPMorgan downgraded Adobe from Overweight to Neutral, warning that free AI image generation tools are eroding the value proposition of Creative Cloud. Adobe shares fell 5.2% on the downgrade, closing at their lowest level in three months.",
    "source": "MarketWatch",
    "published_at": "2026-01-26T15:45:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Cisco Raises Full-Year Revenue Outlook on Networking Demand Recovery",
    "summary": "Cisco Systems raised its fiscal year 2026 revenue guidance to $56-57 billion, up from $54.5-55.5 billion previously. Management pointed to accelerating order growth in campus networking and security as enterprise IT spending rebounded.",
    "source": "Bloomberg",
    "published_at": "2026-01-26T16:00:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Intel Gaudi 3 AI Accelerator Gains Traction with Mid-Tier Cloud Providers",
    "summary": "Intel disclosed that its Gaudi 3 AI training accelerator has been adopted by several regional cloud providers seeking cost-effective alternatives to Nvidia GPUs. While volumes remain modest, the design wins represent a foothold in the rapidly growing AI hardware market.",
    "source": "The Information",
    "published_at": "2026-01-27T08:30:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Google Search Market Share Dips Below 88% for First Time in a Decade",
    "summary": "Alphabet's Google Search saw its global market share fall below 88% for the first time since 2015, according to StatCounter data. The decline is attributed to growing adoption of AI-powered search alternatives and Microsoft's Bing Copilot integration.",
    "source": "MarketWatch",
    "published_at": "2026-01-27T10:00:00",
    "tickers": [
      "GOOGL",
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Oracle Reports Strong Bookings for AI Infrastructure, Backlog Exceeds $130 Billion",
    "summary": "Oracle disclosed that its remaining performance obligation backlog surpassed $130 billion, up from $97 billion a year ago. The surge is driven primarily by large-scale AI infrastructure contracts with hyperscalers and sovereign cloud deals.",
    "source": "Reuters",
    "published_at": "2026-01-27T10:00:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Expands Private Credit Business with $10 Billion Fund Launch",
    "summary": "JPMorgan Chase announced the launch of a $10 billion private credit fund targeting middle-market companies, its largest direct lending vehicle to date. The move positions the bank to compete more aggressively with private equity firms and alternative lenders in the fast-growing private credit market.",
    "source": "Financial Times",
    "published_at": "2026-01-27T10:00:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "McDonald's Hit with E. Coli Concerns at Multiple Midwest Locations",
    "summary": "Health officials are investigating reports of E. coli cases linked to McDonald's restaurants in three Midwestern states. The company has proactively pulled certain produce items from affected locations and is cooperating with the CDC.",
    "source": "CNBC",
    "published_at": "2026-01-27T16:00:00",
    "tickers": [
      "MCD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Reports Record Services Revenue But iPhone Sales Disappoint",
    "summary": "Apple posted record services revenue of $26.3 billion in its fiscal Q1, but iPhone unit sales came in below expectations amid a slowdown in China. The mixed results sent shares down 2% in after-hours trading despite an earnings beat.",
    "source": "CNBC",
    "published_at": "2026-01-27T16:35:00",
    "tickers": [
      "AAPL",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Danaher Reports Q4 2025 Results, Revenue Grows 4.5% Year-Over-Year",
    "summary": "Danaher reported Q4 2025 revenues of $6.8 billion, up 4.5% year-over-year, with adjusted diluted EPS of $2.23 growing 4%. Full-year revenues reached $24.6 billion with 3% growth. The company guided 2026 core revenue growth of 3% to 6% with adjusted EPS of $8.35 to $8.50.",
    "source": "Danaher",
    "published_at": "2026-01-28T06:30:00",
    "tickers": [
      "DHR"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Amazon Logistics Arm Begins Offering Delivery Services to External Retailers",
    "summary": "Amazon announced that its logistics network will now serve external retailers, directly competing with FedEx and UPS. The move is expected to generate $15 billion in annual revenue by 2028, according to company projections.",
    "source": "CNBC",
    "published_at": "2026-01-28T07:15:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "AMD Predicts Q4 Earnings Will Soar on Data Center Demand",
    "summary": "Ahead of its February 3 earnings report, AMD management guided for strong data center and AI-related revenue growth driven by EPYC server CPUs and Instinct GPU accelerators. Analysts predicted the chipmaker would report revenue exceeding $10 billion for the first time.",
    "source": "Motley Fool",
    "published_at": "2026-01-28T09:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Danaher Expects Biotech Segment to Lead 2026 Growth at High-Single Digits",
    "summary": "In its 2026 guidance, Danaher projected its Biotechnology segment to grow at high-single digits, while Life Sciences faces flat to low-single digit declines and Diagnostics targets low-single digit growth. Operating cash flow for Q4 2025 was $2.1 billion with free cash flow of $1.8 billion.",
    "source": "Seeking Alpha",
    "published_at": "2026-01-28T10:00:00",
    "tickers": [
      "DHR"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "AI Capex Boom: Big Tech Plans $250 Billion in Combined 2026 AI Spending",
    "summary": "Aggregate capital expenditure guidance from Microsoft, Alphabet, Amazon, and Meta for 2026 surpassed $250 billion, overwhelmingly directed at AI data centers and infrastructure. Analysts debated whether the spending spree can deliver adequate returns or represents a speculative bubble.",
    "source": "Financial Times",
    "published_at": "2026-01-28T10:00:00",
    "tickers": [
      "MSFT",
      "GOOGL",
      "AMZN",
      "META",
      "NVDA",
      "QQQ"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "P&G Warns of Rising Input Costs from New Tariff Proposals",
    "summary": "Procter & Gamble cautioned that proposed tariffs on imported chemicals and packaging materials could raise costs by $300-400 million annually. The company is evaluating reformulation options to mitigate the impact.",
    "source": "Reuters",
    "published_at": "2026-01-28T15:00:00",
    "tickers": [
      "PG"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Berkshire Hathaway Sells $2.8 Billion in Apple Shares During Q4",
    "summary": "Regulatory filings revealed Berkshire Hathaway sold approximately $2.8 billion worth of Apple stock during the fourth quarter, continuing a gradual reduction of its once-dominant position in the tech giant. The conglomerate still holds a significant Apple stake valued at over $60 billion.",
    "source": "CNBC",
    "published_at": "2026-01-28T16:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Tesla Q4 Earnings Beat Estimates: EPS $0.50 vs $0.40 Expected",
    "summary": "Tesla reported Q4 2025 adjusted EPS of $0.50, beating the $0.40 consensus estimate by 25%. However, revenue slid 3% year-over-year to $24.9 billion as auto segment revenue fell 11%, and full-year 2025 revenue declined for the first time in company history.",
    "source": "CNBC",
    "published_at": "2026-01-28T16:15:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "neutral"
  },
  {
    "headline": "Microsoft Q2 FY2026 Earnings Beat Estimates on Cloud and AI Strength",
    "summary": "Microsoft reported fiscal Q2 2026 revenue of $69.8 billion, surpassing the consensus estimate of $68.1 billion. Azure revenue grew 37%, and the Intelligent Cloud segment delivered operating margins above 45% for the first time.",
    "source": "Bloomberg",
    "published_at": "2026-01-28T16:15:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm Posts Strong Q1 as Smartphone Chip Demand Rebounds",
    "summary": "Qualcomm reported fiscal Q1 revenue of $11.4 billion, up 12% year-over-year, driven by a recovery in premium smartphone shipments. The Snapdragon 8 Elite chipset saw strong adoption across major Android flagships launched in early 2026.",
    "source": "CNBC",
    "published_at": "2026-01-28T17:00:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Profit Tanked 46% in 2025, Revenue Declines for First Time",
    "summary": "Tesla's full-year 2025 profits fell 46% as the company faced declining deliveries, margin pressure from price cuts, and brand damage in key markets. Despite beating Q4 EPS estimates, the annual results painted a challenging picture for the automaker.",
    "source": "TechCrunch",
    "published_at": "2026-01-28T17:30:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Stock Climbs on Optimus Robot Production Timeline",
    "summary": "Tesla shares rose in after-hours trading after the company confirmed during its Q4 earnings call that Optimus humanoid robots remain on track for end-of-year production. Musk called Optimus 'the most valuable product ever made' and projected mass production scaling in 2027.",
    "source": "Yahoo Finance",
    "published_at": "2026-01-28T21:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom Faces EU Antitrust Probe Over VMware Licensing Changes",
    "summary": "The European Commission opened a preliminary investigation into Broadcom's decision to bundle VMware products and eliminate perpetual licenses. Several enterprise customers and competitors have filed complaints alleging anti-competitive behavior.",
    "source": "WSJ",
    "published_at": "2026-01-29T06:00:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Thermo Fisher Reports Q4 2025 Revenue of $12.2B, Beats Estimates",
    "summary": "Thermo Fisher Scientific reported Q4 2025 revenue of $12.21 billion, up 7%, with adjusted EPS of $6.57 growing 8%. Full-year revenue reached $44.56 billion. The company initiated 2026 guidance of $46.3 to $47.2 billion in revenue, representing 4% to 6% reported growth.",
    "source": "Thermo Fisher",
    "published_at": "2026-01-29T06:30:00",
    "tickers": [
      "TMO"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Thermo Fisher Announces $9B Deal to Acquire Clario",
    "summary": "Thermo Fisher Scientific announced a definitive agreement to acquire Clario, a digital endpoint data provider generating approximately $1.5 billion in 2025 revenue, for $9 billion. The acquisition is expected to add $0.20 to $0.25 per share to adjusted EPS and strengthen Thermo Fisher's clinical research services.",
    "source": "Seeking Alpha",
    "published_at": "2026-01-29T08:00:00",
    "tickers": [
      "TMO"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Visa and JPMorgan Team Up on Real-Time Business Payment Solution",
    "summary": "Visa and JPMorgan Chase announced a joint initiative to deliver real-time B2B payment capabilities to corporate clients, leveraging Visa Direct and JPMorgan's treasury services infrastructure. The partnership aims to reduce settlement times for cross-border business payments from days to seconds.",
    "source": "Wall Street Journal",
    "published_at": "2026-01-29T09:30:00",
    "tickers": [
      "V",
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Nvidia Lawmaker Controversy: Alleged DeepSeek Co-Design Despite Export Ban",
    "summary": "The Republican head of the House China committee alleged that NVIDIA provided technical support helping DeepSeek improve its AI model, despite US export controls. NVIDIA's stock dipped 2% on the news as investors weighed potential regulatory and reputational risks.",
    "source": "Bloomberg",
    "published_at": "2026-01-29T10:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Yield Curve Steepens as Long-End Bonds Sell Off on Fiscal Concerns",
    "summary": "The spread between 2-year and 10-year Treasury yields widened to 45 basis points, the steepest since mid-2024, as investors demanded higher compensation for holding longer-duration debt. Growing federal deficits and tariff-driven inflation fears drove the move.",
    "source": "Bloomberg",
    "published_at": "2026-01-29T11:15:00",
    "tickers": [
      "SPY",
      "IWM"
    ],
    "sector": "Market",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce Warns of Foreign Currency Headwinds in FY2027 Guidance",
    "summary": "Salesforce issued cautious FY2027 guidance, citing a strong U.S. dollar that could reduce international revenue by approximately $400 million. The company maintained its organic growth targets but acknowledged macro uncertainty in European markets.",
    "source": "Financial Times",
    "published_at": "2026-01-29T12:30:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Starbucks Unveils 'Back to Basics' Strategy Under New CEO",
    "summary": "CEO Brian Niccol outlined a comprehensive turnaround strategy focused on simplifying the menu, reducing wait times, and investing in barista training. The plan includes closing 200 underperforming U.S. locations over the next year.",
    "source": "WSJ",
    "published_at": "2026-01-29T14:30:00",
    "tickers": [
      "SBUX"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "neutral"
  },
  {
    "headline": "Thermo Fisher Stock Slips Despite Q4 Beat on Underwhelming 2026 Guidance",
    "summary": "Thermo Fisher shares declined after the company's 2026 revenue guidance of $46.3 to $47.2 billion fell short of some analyst expectations. Despite beating estimates for 14 of the last 16 quarters, investors wanted stronger organic growth projections beyond the 3% to 4% guided range.",
    "source": "Seeking Alpha",
    "published_at": "2026-01-29T16:00:00",
    "tickers": [
      "TMO"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Nasdaq Composite Surges Past 20,500 as Mega-Cap Tech Rallies",
    "summary": "The Nasdaq Composite climbed to a record close above 20,500, driven by strong earnings from Microsoft and Alphabet and renewed AI optimism. The tech-heavy index has gained over 6% in January alone, outpacing the broader market.",
    "source": "MarketWatch",
    "published_at": "2026-01-29T16:10:00",
    "tickers": [
      "QQQ",
      "MSFT",
      "GOOGL",
      "SPY"
    ],
    "sector": "Market",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Q4 Earnings Beat: Revenue of $59.9B, EPS of $8.88",
    "summary": "Meta Platforms reported Q4 2025 earnings that topped analyst expectations, with EPS of $8.88 versus $8.16 expected and revenue of $59.9 billion versus $58.4 billion projected. Shares jumped as much as 10% in after-hours trading on the strong results.",
    "source": "CNBC",
    "published_at": "2026-01-29T16:30:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Q1 FY2026 Revenue Misses Estimates, China Sales Disappoint",
    "summary": "Apple reported Q1 FY2026 revenue of $119.2 billion, below the analyst consensus of $121.5 billion, as iPhone sales in China fell 8% year-over-year. CEO Tim Cook attributed the shortfall to macroeconomic softness in the Greater China region.",
    "source": "CNBC",
    "published_at": "2026-01-29T16:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Meta Guides for $115-$135 Billion in 2026 Capital Expenditure",
    "summary": "Alongside its Q4 earnings beat, Meta announced plans to spend between $115 billion and $135 billion on capital expenditures in 2026, up roughly 75% from 2025. The massive spending plan underscores the company's aggressive AI infrastructure buildout and data center expansion.",
    "source": "Bloomberg",
    "published_at": "2026-01-29T17:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Goldman Sachs Downgrades U.S. Economic Outlook, Cites Slowing Job Growth",
    "summary": "Goldman Sachs economists revised their U.S. GDP growth forecast for 2026 down to 1.8% from 2.2%, pointing to moderating job gains and tighter credit conditions. The revision weighed on financial stocks broadly as investors grew more cautious about the economic outlook.",
    "source": "Bloomberg",
    "published_at": "2026-01-30T07:15:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "PCE Inflation Holds at 2.6% in December, Core at 2.8%",
    "summary": "The Fed's preferred inflation gauge, the Personal Consumption Expenditures price index, remained at 2.6% year-over-year in December, while core PCE ticked up to 2.8%. The data reinforced expectations that the Fed will stay on hold through at least the spring.",
    "source": "Reuters",
    "published_at": "2026-01-30T08:35:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "neutral"
  },
  {
    "headline": "Meta's AI Revenue Surges as Ad Targeting Models Improve",
    "summary": "Meta disclosed that AI-powered improvements to its advertising recommendation systems drove significant revenue gains in Q4 2025. The company's investment in large language models for ad targeting and content ranking is delivering measurable returns on its massive AI infrastructure spending.",
    "source": "CNBC",
    "published_at": "2026-01-30T09:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix and Amazon Compete for Exclusive Rights to Stream NFL Playoff Games",
    "summary": "Netflix and Amazon are reportedly in a bidding war for exclusive streaming rights to select NFL playoff games starting in 2027. The deal could be worth upwards of $3 billion annually and would reshape the sports streaming landscape.",
    "source": "WSJ",
    "published_at": "2026-01-30T09:00:00",
    "tickers": [
      "NFLX",
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Eli Lilly CEO Says Medicare Coverage of Obesity Drugs Could 'Change the Game'",
    "summary": "Eli Lilly CEO David Ricks said Medicare coverage of obesity drugs could transform the upcoming launch of the company's oral GLP-1 pill orforglipron. Medicare coverage would dramatically expand the addressable patient population and could accelerate adoption beyond the current self-pay and commercial insurance markets.",
    "source": "CNBC",
    "published_at": "2026-01-30T11:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Alphabet Announces $70 Billion Share Buyback Program",
    "summary": "Alphabet's board of directors authorized a new $70 billion share repurchase program, one of the largest in corporate history. The announcement signals management's confidence in the company's long-term growth prospects and commitment to returning capital to shareholders.",
    "source": "WSJ",
    "published_at": "2026-01-30T11:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "PepsiCo North America Snacks Volume Declines for Third Straight Quarter",
    "summary": "Frito-Lay North America reported a 2% volume decline in Q4 as consumers continued to trade down amid persistent food inflation. PepsiCo management acknowledged the need for more aggressive value offerings.",
    "source": "WSJ",
    "published_at": "2026-01-30T11:30:00",
    "tickers": [
      "PEP"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Texas Instruments Dividend Increase Signals Confidence in Recovery",
    "summary": "Texas Instruments raised its quarterly dividend by 5% to $1.36 per share, marking its 21st consecutive year of dividend increases. The board said the raise reflects confidence in improving end-market demand and the company's strong free cash flow generation.",
    "source": "MarketWatch",
    "published_at": "2026-01-30T12:00:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Lilly's Orforglipron Granted FDA National Priority Voucher for Expedited Review",
    "summary": "The FDA awarded Eli Lilly's oral GLP-1 pill orforglipron a Commissioner's National Priority Voucher, potentially accelerating the review timeline to weeks rather than the standard 6 to 10 months. Lilly expects the FDA decision as early as March 2026, ahead of a planned Q2 commercial launch.",
    "source": "BioPharma Dive",
    "published_at": "2026-01-31T09:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Apple, Microsoft, and Google Join Coalition to Set AI Safety Standards",
    "summary": "Apple, Microsoft, and Alphabet announced the formation of the Responsible AI Consortium, a joint initiative to develop industry-wide safety standards for AI deployment. The coalition will publish its first set of guidelines by mid-2026.",
    "source": "TechCrunch",
    "published_at": "2026-01-31T09:00:00",
    "tickers": [
      "AAPL",
      "MSFT",
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Accenture Faces Margin Pressure from Wage Inflation in India",
    "summary": "Accenture acknowledged that rising wages in India, its largest delivery center, are pressuring operating margins. The company plans to offset the impact through greater automation and a shift toward higher-value AI consulting engagements.",
    "source": "Bloomberg",
    "published_at": "2026-01-31T10:15:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Caterpillar Autonomous Mining Trucks Reach 5 Billion Ton Milestone",
    "summary": "Caterpillar's autonomous hauling fleet surpassed 5 billion tonnes of material moved, a major milestone for the mining industry. The technology is now deployed at over 30 mining sites globally, reducing operating costs by up to 20%.",
    "source": "Reuters",
    "published_at": "2026-01-31T11:45:00",
    "tickers": [
      "CAT"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Document Cloud Revenue Surges 28% on AI-Powered PDF Automation",
    "summary": "Adobe's Document Cloud division reported 28% revenue growth, driven by enterprises adopting AI-powered document workflows. The Acrobat AI Assistant feature has been particularly popular, with over 50 million monthly active users.",
    "source": "Bloomberg",
    "published_at": "2026-01-31T13:00:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard Reports January Spending Index Shows Resilient U.S. Consumer",
    "summary": "Mastercard's SpendingPulse report for January showed U.S. retail sales excluding auto rose 4.3% year-over-year, suggesting consumer spending remains solid despite elevated borrowing costs. Restaurants and travel led the growth, while electronics and home improvement lagged.",
    "source": "MarketWatch",
    "published_at": "2026-01-31T14:30:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Chase Named Top Global Investment Bank by Deal Volume for 2025",
    "summary": "JPMorgan Chase topped global investment banking league tables for 2025, capturing the highest share of advisory and underwriting fees across M&A, equity, and debt capital markets. The bank's dominance was fueled by a surge in mega-deals in the technology and healthcare sectors.",
    "source": "Financial Times",
    "published_at": "2026-02-01T08:00:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle Faces Class-Action Lawsuit Over Health Data Privacy Breach",
    "summary": "A class-action lawsuit was filed against Oracle alleging that its Cerner health data division exposed the medical records of over 6 million patients. Oracle said it is cooperating with investigators and has implemented additional security measures.",
    "source": "Reuters",
    "published_at": "2026-02-01T08:30:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Broadcom and Cisco Both Benefit from Enterprise AI Network Upgrades",
    "summary": "A Morgan Stanley report highlighted Broadcom and Cisco as primary beneficiaries of a wave of enterprise network upgrades driven by AI workload requirements. Analysts estimate the AI networking equipment market will grow 35% annually through 2028.",
    "source": "MarketWatch",
    "published_at": "2026-02-01T09:00:00",
    "tickers": [
      "AVGO",
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "U.S.-China Tariff Escalation Rattles Global Supply Chains",
    "summary": "With the 10% tariff on Chinese imports now in effect, shipping costs surged and companies scrambled to reroute supply chains through Southeast Asia. The uncertainty weighed on manufacturing sentiment globally, with the MSCI World index declining 1.2%.",
    "source": "Financial Times",
    "published_at": "2026-02-01T09:00:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA",
      "AAPL"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Costco Membership Fee Hike Takes Effect with Minimal Churn",
    "summary": "Costco's recently announced membership fee increase appears to be having minimal impact on renewal rates, which held steady at 92.8%. Analysts say the resilience underscores the strength of the Costco value proposition.",
    "source": "Bloomberg",
    "published_at": "2026-02-01T09:15:00",
    "tickers": [
      "COST"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Philip Morris Faces New EU Regulations on Heated Tobacco Products",
    "summary": "The European Union proposed new regulations that would subject heated tobacco products like IQOS to the same advertising restrictions as traditional cigarettes. Philip Morris warned the rules could slow its smoke-free transition in key European markets.",
    "source": "Reuters",
    "published_at": "2026-02-01T14:00:00",
    "tickers": [
      "PM"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Microsoft Stock Hits All-Time High on Strong Earnings Momentum",
    "summary": "Microsoft shares reached an all-time high of $478.32, bringing the company's market capitalization above $3.5 trillion. The rally was fueled by better-than-expected Q2 earnings and upbeat guidance for the remainder of fiscal year 2026.",
    "source": "Bloomberg",
    "published_at": "2026-02-01T15:45:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Europe Sales Drop for 13th Straight Month in January",
    "summary": "Tesla's European new car registrations fell to 8,075 in January, down 17% year-over-year, marking the 13th consecutive month of decline. Norway saw an 88% plunge while the Netherlands fell 67%, as Musk's political activities continue to alienate European buyers.",
    "source": "CNBC",
    "published_at": "2026-02-02T08:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Intel Secures $3.5 Billion in CHIPS Act Funding for Ohio Fabs",
    "summary": "The U.S. Department of Commerce finalized a $3.5 billion grant to Intel for its semiconductor manufacturing complex in New Albany, Ohio. The funding will support two advanced logic fabs expected to begin production in 2028.",
    "source": "Reuters",
    "published_at": "2026-02-02T11:30:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway Energy Faces Wildfire Liability Concerns in Western States",
    "summary": "Berkshire Hathaway Energy's utility subsidiaries face potential liabilities related to wildfire damage in Oregon and Nevada, echoing the crisis that engulfed Pacific Gas & Electric years ago. Analysts estimate potential exposure could range from $500 million to $2 billion depending on the outcome of ongoing investigations.",
    "source": "Reuters",
    "published_at": "2026-02-02T11:45:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Google Unveils Android 17 Developer Preview With On-Device AI Features",
    "summary": "Google released the first developer preview of Android 17, featuring advanced on-device AI capabilities including real-time language translation and context-aware notifications. The update is designed to reduce reliance on cloud processing for common AI tasks.",
    "source": "The Verge",
    "published_at": "2026-02-02T12:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Walmart Expands Drone Delivery to 15 New Metropolitan Areas",
    "summary": "Walmart announced the expansion of its drone delivery service to 15 additional metro areas, bringing total coverage to 40 markets serving 30 million households. Deliveries of small packages can be completed in under 30 minutes.",
    "source": "Bloomberg",
    "published_at": "2026-02-02T12:30:00",
    "tickers": [
      "WMT"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Q4 Earnings Exceed Expectations with 14% Revenue Growth",
    "summary": "Amazon reported Q4 2025 revenue of $189.3 billion, representing 14% year-over-year growth and beating consensus estimates by $4.1 billion. AWS and advertising were the primary growth drivers, while North America retail margins reached a record high.",
    "source": "CNBC",
    "published_at": "2026-02-02T16:15:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Merck Reports Q4 2025 Earnings, Keytruda Sales Top $8.37B",
    "summary": "Merck reported Q4 worldwide sales of $16.4 billion, beating analyst estimates, with Keytruda sales of $8.37 billion rising 7% year-over-year on strong uptake in earlier-stage cancers. Full-year Keytruda/Keytruda QLEX sales reached $31.7 billion, cementing its position as the world's top-selling drug.",
    "source": "CNBC",
    "published_at": "2026-02-03T06:30:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Amgen Reports Q4 2025 Results, Biosimilar Sales Surge 37% to $3B",
    "summary": "Amgen reported Q4 2025 earnings with its biosimilar portfolio delivering $3 billion in full-year sales, up 37%, led by PAV Blue (biosimilar to Eylea) reaching $700 million. The company guided 2026 revenues of $37.0 to $38.4 billion and non-GAAP EPS of $21.60 to $23.00.",
    "source": "Amgen",
    "published_at": "2026-02-03T06:30:00",
    "tickers": [
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Raises Dividend by 5%, Signals Confidence Despite Earnings Miss",
    "summary": "Apple announced a 5% increase to its quarterly dividend, bringing the per-share payout to $0.27. The move is seen as a signal that management remains confident in the company's cash flow generation despite the recent earnings shortfall.",
    "source": "MarketWatch",
    "published_at": "2026-02-03T08:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm Warns of Potential Revenue Hit from Huawei License Expiry",
    "summary": "Qualcomm disclosed in an SEC filing that its license to supply 4G chips to Huawei is set to expire in April 2026 and may not be renewed. The Huawei business represents an estimated $1.5 billion in annual revenue for Qualcomm.",
    "source": "Bloomberg",
    "published_at": "2026-02-03T08:00:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Merck Issues Modest 2026 Outlook Amid Patent Cliff Concerns",
    "summary": "Merck guided 2026 revenue of $65.5 to $67 billion, below analysts' $67.6 billion expectation, as the company prepares for patent expirations later this year. Merck announced a $3 billion cost-cutting program through 2027 to help offset anticipated revenue losses ahead of Keytruda's 2028 patent expiration.",
    "source": "CNBC",
    "published_at": "2026-02-03T09:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce and Adobe Partner on Unified Marketing Data Platform",
    "summary": "Salesforce and Adobe announced a strategic partnership to integrate their marketing clouds into a unified data platform. The collaboration aims to help enterprises consolidate customer data across CRM and creative workflows.",
    "source": "MarketWatch",
    "published_at": "2026-02-03T10:00:00",
    "tickers": [
      "CRM",
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "GE Aerospace Wins $4 Billion U.S. Military Engine Contract",
    "summary": "GE Aerospace was awarded a $4 billion contract to develop next-generation adaptive engines for the U.S. Air Force's fighter fleet. The program will span 10 years and could expand to $8 billion with international orders.",
    "source": "Bloomberg",
    "published_at": "2026-02-03T10:00:00",
    "tickers": [
      "GE"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "January ISM Services Index Jumps to 54.3, Strongest in Six Months",
    "summary": "The services sector showed unexpected strength in January, with the ISM services PMI rising to 54.3 from 52.1 in December. Business activity and new orders sub-indices both improved, suggesting the consumer-driven economy remains on solid footing.",
    "source": "Bloomberg",
    "published_at": "2026-02-03T10:10:00",
    "tickers": [
      "SPY",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Robotaxi Expansion: Plans for Seven New US Cities in H1 2026",
    "summary": "Tesla confirmed plans to expand its robotaxi service to Dallas, Houston, Phoenix, Miami, Orlando, Tampa, and Las Vegas in the first half of 2026. The expansion comes after the company began offering unsupervised rides in Austin, though the rollout pace has been slower than Musk initially promised.",
    "source": "Reuters",
    "published_at": "2026-02-03T11:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "positive"
  },
  {
    "headline": "Merck Reorganizes Human Health Business Into Two Units",
    "summary": "Merck announced a strategic reorganization of its Human Health business, creating two distinct units: the Oncology Business Unit and the Specialty, Pharma & Infectious Diseases Business Unit. The restructuring aims to sharpen commercial focus as the company navigates Keytruda's patent cliff and launches next-generation therapies.",
    "source": "Merck",
    "published_at": "2026-02-03T12:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Linde Wins $2 Billion Clean Hydrogen Contract in Saudi Arabia",
    "summary": "Linde secured a $2 billion contract to build and operate a green hydrogen plant in Saudi Arabia's NEOM project. The facility will produce 600 tonnes per day of green hydrogen for export to European and Asian markets.",
    "source": "Bloomberg",
    "published_at": "2026-02-03T12:00:00",
    "tickers": [
      "LIN"
    ],
    "sector": "Materials",
    "sentiment": "positive"
  },
  {
    "headline": "Amgen Faces Headwinds from Biosimilar Competition to Prolia and XGEVA",
    "summary": "Amgen warned that Prolia and XGEVA face accelerated sales erosion in 2026 from increased biosimilar competition as multiple denosumab biosimilars launch globally. The company expects its growing biosimilar portfolio and MariTide obesity program to offset the anticipated declines.",
    "source": "Motley Fool",
    "published_at": "2026-02-03T14:00:00",
    "tickers": [
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Visa Quarterly Earnings Beat Expectations on Strong Processed Transactions Growth",
    "summary": "Visa reported fiscal first-quarter earnings per share of $2.75, topping the consensus estimate of $2.62, as total processed transactions grew 10% year-over-year. CEO Ryan McInerney highlighted the company's expanding value-added services business as a key growth driver.",
    "source": "CNBC",
    "published_at": "2026-02-03T16:15:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Eli Lilly Q4 Revenue Soars 43% to $19.3B on Mounjaro and Zepbound Demand",
    "summary": "Eli Lilly reported Q4 2025 revenue of $19.3 billion, a 43% increase driven by a 46% volume surge for Mounjaro and Zepbound. Adjusted EPS of $7.54 beat analysts' $6.96 estimate by over 8%, as the GLP-1 franchise continues to exceed all expectations.",
    "source": "CNBC",
    "published_at": "2026-02-04T06:30:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "AbbVie Reports Record Full-Year 2025 Revenue of $61.2B",
    "summary": "AbbVie reported record adjusted net revenues of $61.2 billion for 2025, exceeding guidance despite substantial Humira erosion. Skyrizi delivered $17.6 billion in global sales with 32.5% growth, while Rinvoq reached $8.3 billion with 29.5% growth, together already surpassing the 2027 long-term guidance.",
    "source": "AbbVie",
    "published_at": "2026-02-04T06:30:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Eli Lilly Issues Blockbuster 2026 Guidance of $80B-$83B Revenue",
    "summary": "Eli Lilly guided 2026 revenue of $80 to $83 billion, far surpassing the $77.62 billion analyst consensus and representing approximately 25% growth at the midpoint. The company cited Medicare coverage, global Mounjaro/Zepbound demand, and the expected Q2 launch of oral orforglipron as key drivers.",
    "source": "CNBC",
    "published_at": "2026-02-04T07:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Original Film Wins Best Picture at Sundance, Boosting Content Strategy",
    "summary": "Netflix's original film 'The Weight of Water' won the Grand Jury Prize at Sundance Film Festival 2026. The win reinforces Netflix's strategy of investing in prestige content alongside mainstream entertainment.",
    "source": "Bloomberg",
    "published_at": "2026-02-04T07:00:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "AMD Q4 Revenue Tops $10B but Stock Sinks 17% on Soft Guidance",
    "summary": "AMD reported record Q4 revenue of $10.27 billion, beating estimates of $9.67 billion, but shares plunged 17% after the company guided Q1 revenue to $9.8 billion. While the guidance technically beat consensus of $9.38 billion, some analysts had expected a stronger outlook given AI momentum.",
    "source": "CNBC",
    "published_at": "2026-02-04T09:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Goldman Sachs Asset Management Launches Suite of Active ETFs",
    "summary": "Goldman Sachs Asset Management debuted a suite of six actively managed ETFs spanning U.S. equities, international stocks, and fixed income. The launch represents Goldman's latest push into the rapidly growing ETF market, where active strategies have gained significant traction with retail investors.",
    "source": "Barron's",
    "published_at": "2026-02-04T09:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Shares Give Back All Post-Earnings Gains in Sharp Reversal",
    "summary": "After initially surging 10% on strong Q4 results, Meta shares reversed course and fell roughly 10% from their post-earnings peak. Investors grew concerned about the company's $115-$135 billion capex guidance, questioning whether the massive AI spending will deliver adequate returns.",
    "source": "Motley Fool",
    "published_at": "2026-02-04T09:30:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "AbbVie Forecasts Skyrizi and Rinvoq Combined Sales Above $31B in 2026",
    "summary": "AbbVie projected combined Skyrizi and Rinvoq sales of more than $31 billion in 2026, having already exceeded its previous 2027 target by $500 million. The immunology duo has successfully offset the Humira biosimilar impact, with Skyrizi emerging as one of the world's fastest-growing drugs.",
    "source": "Fierce Pharma",
    "published_at": "2026-02-04T10:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Expands Copilot for Healthcare With FDA-Cleared Diagnostic Tools",
    "summary": "Microsoft launched a specialized version of Copilot for healthcare providers, featuring FDA-cleared diagnostic assistance tools for radiology and pathology. The product integrates directly with electronic health record systems and is available to U.S. hospital networks.",
    "source": "Reuters",
    "published_at": "2026-02-04T10:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Lilly's GLP-1 Growth Only Getting Started as Novo Nordisk Braces for Decline",
    "summary": "With Q4 results showing a 43% revenue surge, Eli Lilly's GLP-1 dominance is accelerating while competitor Novo Nordisk braces for a sales decline in 2026. Lilly holds 60% of the U.S. GLP-1 market and expects tirzepatide patent protection to extend into the back half of the 2030s.",
    "source": "CNBC",
    "published_at": "2026-02-04T12:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Boeing 737 MAX Production Rate Approved to Increase to 42 Per Month",
    "summary": "The FAA approved Boeing's request to increase 737 MAX production to 42 aircraft per month, up from 38. The approval follows months of enhanced quality inspections and comes amid strong airline demand for narrowbody jets.",
    "source": "WSJ",
    "published_at": "2026-02-04T13:00:00",
    "tickers": [
      "BA"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Lilly Reports Global Pricing Decline in Low-to-Mid Teens for GLP-1 Drugs",
    "summary": "Eli Lilly disclosed a global pricing decline in the low-to-mid teens percentages for its GLP-1 products in 2026, following the Most Favored Nation deals struck with the Trump administration. However, management expects the lower prices to eventually increase prescription volumes and expand market access.",
    "source": "CNBC",
    "published_at": "2026-02-04T14:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Texas Instruments Sees Early Signs of Inventory Normalization in Auto Sector",
    "summary": "Texas Instruments management told investors at a Goldman Sachs conference that automotive customers are beginning to draw down excess inventory. The company expects auto-related chip orders to improve sequentially in the second half of 2026.",
    "source": "CNBC",
    "published_at": "2026-02-04T14:45:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "AbbVie Stock Falls Despite Earnings Beat on Cautious Market Sentiment",
    "summary": "AbbVie shares declined following its Q4 earnings report despite beating estimates for both earnings and sales and issuing an upbeat 2026 outlook. Investors appeared to take profits after the strong run, with some analysts noting the stock's premium valuation relative to pharma peers.",
    "source": "Yahoo Finance",
    "published_at": "2026-02-04T16:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Alphabet Reports Blowout Cloud Revenue, Announces $70 Billion Buyback",
    "summary": "Alphabet's Google Cloud division posted 32% revenue growth in Q4, exceeding all estimates, while the company announced a massive $70 billion share repurchase program. Shares surged 8% after hours, lifting the broader tech sector.",
    "source": "CNBC",
    "published_at": "2026-02-04T16:20:00",
    "tickers": [
      "GOOGL",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Beats on Revenue but AWS Growth Slows, Sending Mixed Signals",
    "summary": "Amazon reported Q4 revenue of $182 billion, topping estimates, but AWS growth decelerated to 17% from 19% the prior quarter. Investors were split on whether the cloud slowdown reflects cyclical softness or competitive pressures from Azure and Google Cloud.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-04T16:25:00",
    "tickers": [
      "AMZN",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Mastercard Acquires AI Fraud Detection Startup for $850 Million",
    "summary": "Mastercard agreed to acquire a London-based artificial intelligence startup specializing in real-time transaction fraud detection for approximately $850 million in cash. The deal is expected to bolster Mastercard's cybersecurity and fraud prevention capabilities across its global network.",
    "source": "Bloomberg",
    "published_at": "2026-02-05T07:30:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Accenture Partners with Microsoft on Enterprise Copilot Deployments",
    "summary": "Accenture announced a deepened partnership with Microsoft to deploy Copilot AI assistants across Fortune 500 enterprises. The consulting firm said it has already signed over 200 Copilot-related implementation deals worth a combined $1.8 billion.",
    "source": "WSJ",
    "published_at": "2026-02-05T07:30:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Merck's Two-Drug HIV Regimen Matches Gilead's Biktarvy in Phase 3 Trials",
    "summary": "Merck announced late-breaking Phase 3 data at CROI 2026 showing its investigational doravirine/islatravir once-daily HIV regimen matched Gilead's blockbuster Biktarvy across key efficacy endpoints. The two-drug combination is now under FDA review and could offer a simplified treatment option for adults living with HIV-1.",
    "source": "Merck",
    "published_at": "2026-02-05T08:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "January Jobs Report Shows 198,000 Payrolls Added, Unemployment Ticks Up to 4.2%",
    "summary": "The economy added 198,000 jobs in January, roughly in line with expectations, while the unemployment rate edged up to 4.2%. The modest cooling in the labor market was seen as a Goldilocks scenario, neither too hot nor too cold for the Fed.",
    "source": "AP",
    "published_at": "2026-02-05T08:30:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "neutral"
  },
  {
    "headline": "AMD Stock Drops 17% After Earnings Despite Revenue Beat",
    "summary": "AMD shares suffered their worst single-day decline in over a year, falling 17% despite posting record quarterly revenue. The sell-off was driven by concerns that the company's first-quarter guidance, while above consensus, fell short of some bullish expectations for AI chip demand growth.",
    "source": "CNBC",
    "published_at": "2026-02-05T09:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Alphabet Faces Antitrust Trial Over Ad Tech Market Dominance",
    "summary": "The U.S. Department of Justice's antitrust trial against Alphabet over its advertising technology business entered its opening arguments phase. Prosecutors argue that Google has maintained an illegal monopoly over the digital ad supply chain.",
    "source": "WSJ",
    "published_at": "2026-02-05T09:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Oracle Launches Generative AI Studio for Enterprise Application Development",
    "summary": "Oracle introduced a new Generative AI Studio within OCI, enabling enterprises to fine-tune and deploy large language models without specialized AI expertise. The platform supports models from Cohere, Meta, and Oracle's own proprietary models.",
    "source": "WSJ",
    "published_at": "2026-02-05T11:30:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "ExxonMobil Faces New EPA Scrutiny Over Permian Basin Emissions",
    "summary": "The EPA has opened a new investigation into methane emissions at several ExxonMobil facilities in the Permian Basin. The probe could result in fines and mandatory equipment upgrades costing hundreds of millions.",
    "source": "WSJ",
    "published_at": "2026-02-05T14:30:00",
    "tickers": [
      "XOM"
    ],
    "sector": "Energy",
    "sentiment": "negative"
  },
  {
    "headline": "Apple's M5 Chip Benchmarks Leak, Showing 40% Performance Gain Over M4",
    "summary": "Leaked benchmark results for Apple's upcoming M5 processor show a 40% improvement in multi-core performance compared to the M4. The chip is expected to debut in updated MacBook Pro and Mac Studio models in the second half of 2026.",
    "source": "Bloomberg",
    "published_at": "2026-02-06T06:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Workers in Germany Stage Largest Strike in Company History",
    "summary": "Over 8,000 Amazon warehouse workers across Germany went on a coordinated strike demanding higher wages and improved working conditions. Amazon said the strike had minimal impact on deliveries but analysts warned of potential escalation across Europe.",
    "source": "Financial Times",
    "published_at": "2026-02-06T06:45:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Merck Reaches Agreement with U.S. Government on Drug Pricing",
    "summary": "Merck announced an agreement with the U.S. government to expand access to medicines and lower costs, offering key products including Januvia, Janumet, and Janumet XR at discounts of up to 70% through a direct-to-consumer program. The deal is part of the Trump administration's Most Favored Nation initiative.",
    "source": "Merck",
    "published_at": "2026-02-06T09:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "OpenAI Takes 10% Stake in AMD as Part of Multi-Year Chip Deal",
    "summary": "OpenAI's deal with AMD, first announced in October, will see the AI startup deploy 6 gigawatts of AMD Instinct GPUs over multiple years. The initial 1-gigawatt rollout begins in the second half of 2026, with OpenAI's 10% stake providing AMD a strategic anchor customer.",
    "source": "Bloomberg",
    "published_at": "2026-02-06T10:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "McDonald's Accelerates Drive-Thru Automation with AI Voice Ordering",
    "summary": "McDonald's announced it will deploy AI-powered voice ordering at 10,000 U.S. drive-thru locations by mid-2026. Early tests showed a 25% reduction in order times and improved accuracy rates above 95%.",
    "source": "Bloomberg",
    "published_at": "2026-02-06T12:00:00",
    "tickers": [
      "MCD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "Oil Prices Spike to $82 as OPEC+ Holds Production Cuts Amid Tariff Uncertainty",
    "summary": "Brent crude surged to $82 per barrel after OPEC+ decided to maintain its current production limits through March, citing demand uncertainty from the U.S.-China trade conflict. Energy stocks rallied on the news, with the XLE ETF gaining 2.4%.",
    "source": "Reuters",
    "published_at": "2026-02-06T12:00:00",
    "tickers": [
      "SPY",
      "XLE",
      "CVX",
      "XOM"
    ],
    "sector": "Energy",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Warns of Elevated Commercial Real Estate Losses Through 2026",
    "summary": "JPMorgan Chase's chief risk officer told investors that the bank expects commercial real estate losses to remain elevated throughout 2026, particularly in the office sector. The bank added $400 million to its CRE loan loss reserves during the quarter as a precaution.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-06T13:30:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "NVIDIA Stock Falls to Year-to-Date Low Amid Export Control Concerns",
    "summary": "NVIDIA shares fell to their lowest level of 2026 as investors worried about tightening US export controls on AI chips to China. The DeepSeek controversy and congressional scrutiny of NVIDIA's China business weighed on sentiment despite strong underlying demand.",
    "source": "Reuters",
    "published_at": "2026-02-06T14:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Broadcom Stock Hits All-Time High on AI Revenue Momentum",
    "summary": "Broadcom shares surged 7% to a record closing price after the company disclosed that AI-related revenue now accounts for over 35% of its semiconductor segment. Institutional investors have been steadily increasing positions in the stock.",
    "source": "CNBC",
    "published_at": "2026-02-06T16:30:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Platforms Jumps 9% After AI-Driven Ad Revenue Beats Estimates",
    "summary": "Meta reported Q4 advertising revenue of $44.8 billion, a 22% increase driven by AI-enhanced ad targeting and Reels monetization. The company projected continued strong growth into 2026 as AI tools improve advertiser ROI across its platforms.",
    "source": "Bloomberg",
    "published_at": "2026-02-06T16:30:00",
    "tickers": [
      "META",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Lilly's Orforglipron Outperforms Oral Semaglutide in Head-to-Head Trial",
    "summary": "Lilly's oral GLP-1 orforglipron delivered superior blood sugar control and weight loss compared to Novo Nordisk's oral semaglutide in the head-to-head ACHIEVE-3 trial published in The Lancet. The results give Lilly a significant clinical edge as it prepares to launch the first oral obesity pill in the U.S.",
    "source": "The Lancet",
    "published_at": "2026-02-07T06:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Partners With Toyota on AI-Powered Manufacturing Platform",
    "summary": "Microsoft and Toyota announced a strategic partnership to develop an AI-driven manufacturing optimization platform built on Azure. The multi-year deal is valued at an estimated $1.2 billion and aims to reduce production costs by up to 20%.",
    "source": "Financial Times",
    "published_at": "2026-02-07T07:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Agrees to $100 Billion Multi-Year AI Hardware Partnership With AMD",
    "summary": "Meta Platforms signed a multi-year AI hardware partnership with AMD valued at over $100 billion, diversifying its chip supply beyond NVIDIA. The deal covers deployment of AMD's Instinct MI350 and next-generation MI400 GPUs across Meta's expanding data center network.",
    "source": "Bloomberg",
    "published_at": "2026-02-07T09:00:00",
    "tickers": [
      "META",
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Stock Rallies 8% After Activist Investor Takes $3 Billion Stake",
    "summary": "Elliott Management disclosed a $3 billion position in Salesforce, pushing for accelerated share buybacks and deeper cost cuts. Salesforce shares surged 8.1% on the news, reaching a new 52-week high.",
    "source": "Reuters",
    "published_at": "2026-02-07T09:30:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Wall Street Analysts Warn of AI Bubble Parallels to Dot-Com Era",
    "summary": "A widely circulated Goldman Sachs research note compared current AI valuations to the late 1990s tech bubble, noting that many AI-adjacent stocks trade at over 50 times forward earnings. The report triggered a brief sell-off in semiconductor names before buyers stepped in.",
    "source": "Financial Times",
    "published_at": "2026-02-07T09:30:00",
    "tickers": [
      "NVDA",
      "QQQ",
      "AMD",
      "AVGO",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Berkshire Hathaway's See's Candies Reports Record Valentine's Day Sales",
    "summary": "See's Candies, the iconic confectionery owned by Berkshire Hathaway, reported its strongest Valentine's Day sales period ever, with revenue up 11% from the prior year. The brand's premium positioning and loyal customer base continue to generate outsized returns on Berkshire's original 1972 investment.",
    "source": "CNBC",
    "published_at": "2026-02-07T10:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Cisco Expands Wi-Fi 7 Enterprise Portfolio Ahead of Major Refresh Cycle",
    "summary": "Cisco launched six new Wi-Fi 7 access points targeting large enterprise and campus deployments. Industry analysts expect the Wi-Fi 7 upgrade cycle to drive $8 billion in enterprise wireless spending over the next three years.",
    "source": "Reuters",
    "published_at": "2026-02-07T10:00:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "RTX Pratt & Whitney Faces Extended GTF Engine Inspections",
    "summary": "Pratt & Whitney disclosed that its geared turbofan engine inspection program will require grounding an additional 150 aircraft in 2026. The ongoing quality issue continues to weigh on airline operations and RTX's repair costs.",
    "source": "WSJ",
    "published_at": "2026-02-07T13:30:00",
    "tickers": [
      "RTX"
    ],
    "sector": "Industrials",
    "sentiment": "negative"
  },
  {
    "headline": "Intel 18A Process Node Achieves Yield Milestone Ahead of Schedule",
    "summary": "Intel announced that its 18A manufacturing process has reached a key yield threshold three months ahead of the internal schedule. The milestone is critical for Intel's competitiveness against TSMC and Samsung in advanced chip manufacturing.",
    "source": "The Information",
    "published_at": "2026-02-08T06:45:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Musk's Political Activities Drive European Dealership Protests",
    "summary": "Protests erupted at Tesla dealerships across Europe as consumers expressed anger over Elon Musk's spending of nearly $300 million to help elect President Trump and his role leading federal agency cuts. The demonstrations underscore the brand damage threatening Tesla's international sales.",
    "source": "CNBC",
    "published_at": "2026-02-08T08:30:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "J&J Reaches Agreement with Trump Administration on Drug Pricing, Completing Industry Effort",
    "summary": "Johnson & Johnson's agreement brought 15 of 17 major pharmaceutical companies into the Trump administration's Most Favored Nation drug pricing initiative. J&J committed to offering select medicines at reduced prices through TrumpRx.gov and expanding patient access programs.",
    "source": "AJMC",
    "published_at": "2026-02-08T09:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Google Pixel 11 Pre-Orders Exceed Expectations, Boosting Hardware Outlook",
    "summary": "Pre-orders for Google's Pixel 11 smartphone surpassed internal projections by 35%, according to sources familiar with the matter. The device's AI-first camera system and competitive pricing have driven strong consumer interest.",
    "source": "TechCrunch",
    "published_at": "2026-02-08T11:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Analysts Rate AMD a Buy Despite Post-Earnings Sell-Off",
    "summary": "Despite the 17% post-earnings drop, 34 Wall Street analysts maintain a Buy consensus on AMD with an average price target of $265.18. Bulls argue the sell-off was overdone given AMD's growing AI chip pipeline and strategic partnerships with OpenAI and Meta.",
    "source": "Seeking Alpha",
    "published_at": "2026-02-08T12:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Tests Interactive AI-Powered Storytelling Feature with Select Users",
    "summary": "Netflix is piloting an AI-driven interactive storytelling feature that allows viewers to influence plot directions in real time. The feature, currently available for three titles, uses generative AI to create branching narratives based on viewer choices.",
    "source": "CNBC",
    "published_at": "2026-02-08T12:15:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Coca-Cola Faces Headwinds from Strong Dollar in International Markets",
    "summary": "Currency headwinds are expected to reduce Coca-Cola's 2026 revenue by approximately $1.2 billion, the company disclosed in its latest investor update. The strong U.S. dollar is particularly impacting results in Latin America and Africa.",
    "source": "Reuters",
    "published_at": "2026-02-08T14:00:00",
    "tickers": [
      "KO"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Federal Reserve Holds Rates Steady, Bank Stocks Mixed on Hawkish Commentary",
    "summary": "The Federal Reserve held its benchmark rate unchanged at 4.25-4.50% and Chair Jerome Powell signaled the central bank is unlikely to cut rates before the second half of the year. Bank stocks traded mixed as investors weighed the benefit of higher net interest margins against concerns about loan demand.",
    "source": "Reuters",
    "published_at": "2026-02-08T15:00:00",
    "tickers": [
      "JPM",
      "GS",
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Lilly and U.S. Government Agree to Expand Access to Obesity Medicines",
    "summary": "Eli Lilly and the U.S. government reached an agreement to expand access to obesity medicines for millions of Americans. Under the deal, Medicare beneficiaries will pay no more than $50 per month for tirzepatide, while a multidose pen will be available at $299 for the lowest dose through self-pay channels.",
    "source": "Eli Lilly",
    "published_at": "2026-02-09T08:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "NextEra Energy Faces Rising Interest Rate Headwinds on Capital Plans",
    "summary": "NextEra Energy warned that persistently elevated interest rates are increasing the cost of financing its massive renewable energy buildout. The company's $50 billion capital plan through 2028 is particularly sensitive to borrowing costs.",
    "source": "MarketWatch",
    "published_at": "2026-02-09T08:15:00",
    "tickers": [
      "NEE"
    ],
    "sector": "Utilities",
    "sentiment": "negative"
  },
  {
    "headline": "Visa Announces $15 Billion Share Buyback Authorization",
    "summary": "Visa's board of directors authorized a new $15 billion share repurchase program, replacing the prior authorization that was nearly exhausted. The company also declared a quarterly dividend of $0.65 per share, representing a 10% increase from the previous payout.",
    "source": "MarketWatch",
    "published_at": "2026-02-09T08:30:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Warns of Supply Chain Disruptions Due to Taiwan Strait Tensions",
    "summary": "Apple issued a cautionary note to investors regarding potential supply chain disruptions stemming from escalating geopolitical tensions in the Taiwan Strait. The company said it is accelerating supplier diversification efforts to mitigate risks to chip production.",
    "source": "Reuters",
    "published_at": "2026-02-09T08:45:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Mizuho Reiterates Outperform on NVIDIA, Cites Blackwell Demand",
    "summary": "Mizuho Securities reiterated its Outperform rating on NVIDIA, highlighting that Blackwell GPU demand remains 'off the charts' with allocations fully committed through mid-2026. The firm raised its price target, citing the Meta infrastructure partnership and Rubin pipeline as additional catalysts.",
    "source": "Investing.com",
    "published_at": "2026-02-09T10:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Caterpillar Benefits from U.S. Infrastructure Bill Spending Ramp",
    "summary": "Caterpillar management highlighted accelerating orders tied to Infrastructure Investment and Jobs Act projects, particularly in highway and bridge construction. The company expects infrastructure-related revenue to grow 15% in 2026.",
    "source": "MarketWatch",
    "published_at": "2026-02-09T10:00:00",
    "tickers": [
      "CAT"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm Demonstrates On-Device AI Model Running 70B Parameters on Snapdragon",
    "summary": "At Mobile World Congress, Qualcomm showcased a 70-billion-parameter language model running entirely on a Snapdragon X Elite chip without cloud connectivity. The demonstration underscored Qualcomm's push into on-device AI for smartphones, PCs, and automotive applications.",
    "source": "Bloomberg",
    "published_at": "2026-02-09T13:00:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Raises Full-Year Revenue Guidance on Strong AI Product Demand",
    "summary": "Adobe raised its fiscal year 2026 revenue guidance to $23.5 billion from $22.8 billion, citing stronger-than-expected demand for Firefly and AI-powered creative tools. The stock rose 4.7% in after-hours trading on the announcement.",
    "source": "Bloomberg",
    "published_at": "2026-02-09T16:00:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Sales Collapse Nearly 90% in Norway, EV Capital of Europe",
    "summary": "Tesla's January registrations in Norway plummeted 88% to just 83 vehicles, a devastating decline in what was once the company's strongest European market per capita. The collapse reflects both political backlash and intense competition from Chinese EV makers gaining market share.",
    "source": "Carscoops",
    "published_at": "2026-02-10T07:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Oracle and Salesforce Compete for SAP Migration Contracts as ERP Modernization Accelerates",
    "summary": "A growing number of enterprises are migrating away from SAP's legacy ERP systems, creating a competitive opportunity for Oracle and Salesforce. Both companies have launched dedicated migration programs offering discounts and technical support to attract SAP customers.",
    "source": "MarketWatch",
    "published_at": "2026-02-10T08:00:00",
    "tickers": [
      "ORCL",
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Texas Instruments and Intel Seek Additional CHIPS Act Incentives",
    "summary": "Texas Instruments and Intel are among several chipmakers lobbying Congress for an expansion of CHIPS Act manufacturing tax credits. The companies argue that additional incentives are needed to keep pace with semiconductor subsidies offered by the EU and Japan.",
    "source": "WSJ",
    "published_at": "2026-02-10T08:15:00",
    "tickers": [
      "TXN",
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "AMD Previews MI400 Series GPUs to Battle NVIDIA in 2026",
    "summary": "AMD revealed details of its next-generation Instinct MI400 series, featuring HBM4 memory with 432GB capacity and 19.6 TB/s bandwidth. The MI400 promises double the AI compute performance of the MI350, with analyst estimates suggesting up to $12 billion in 2026 GPU revenue potential.",
    "source": "Wccftech",
    "published_at": "2026-02-10T09:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Trump Launches TrumpRx.gov to Bring Lower Drug Prices to Patients",
    "summary": "The White House launched TrumpRx.gov, a platform enabling patients to purchase 40 of the most popular and expensive branded medicines at significantly reduced prices. The initiative builds on Most Favored Nation deals struck with 16 pharmaceutical manufacturers since September 2025.",
    "source": "White House",
    "published_at": "2026-02-10T10:00:00",
    "tickers": [
      "LLY",
      "MRK",
      "ABBV",
      "JNJ",
      "AMGN"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Goldman Sachs Fined $75 Million by SEC for Supervisory Failures",
    "summary": "The Securities and Exchange Commission fined Goldman Sachs $75 million for failing to properly supervise communications by employees who used unauthorized messaging platforms. Goldman accepted the fine without admitting or denying the findings and said it has since strengthened its compliance procedures.",
    "source": "Bloomberg",
    "published_at": "2026-02-10T11:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Trump Pauses EU Auto Tariff Threat After Bilateral Trade Talks Progress",
    "summary": "The White House announced a 90-day pause on the threatened 25% tariff on European automobile imports following productive trade negotiations in Davos. European markets rallied on the news, and U.S. automakers saw modest gains.",
    "source": "Reuters",
    "published_at": "2026-02-10T13:00:00",
    "tickers": [
      "SPY",
      "DIA",
      "GM",
      "F"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Chevron Cuts 2026 Capex Guidance Amid Permian Slowdown",
    "summary": "Chevron reduced its 2026 capital expenditure budget by $2 billion to $15.5 billion, citing softer near-term oil price expectations. The company will slow drilling activity in the Permian Basin while maintaining its Guyana growth plans.",
    "source": "Bloomberg",
    "published_at": "2026-02-10T13:15:00",
    "tickers": [
      "CVX"
    ],
    "sector": "Energy",
    "sentiment": "negative"
  },
  {
    "headline": "Amazon Invests $8 Billion in New AI Data Centers Across the U.S. Southeast",
    "summary": "Amazon announced an $8 billion investment to build four new AI-focused data centers in Georgia and North Carolina. The facilities will support growing demand for AWS generative AI services and are expected to create 5,000 jobs.",
    "source": "WSJ",
    "published_at": "2026-02-10T14:30:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tech Sector Sells Off as Treasury Yields Spike to 5.2%",
    "summary": "Major technology stocks including Apple, Microsoft, and Alphabet declined sharply as the 10-year Treasury yield surged to 5.2%, its highest level since 2007. Investors rotated out of growth stocks amid concerns about higher-for-longer interest rates.",
    "source": "CNBC",
    "published_at": "2026-02-10T15:00:00",
    "tickers": [
      "AAPL",
      "MSFT",
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Fed's Waller: Rate Cut Possible in June if Inflation Continues to Ease",
    "summary": "Federal Reserve Governor Christopher Waller indicated that a rate cut could be on the table by mid-year if inflation data shows sustained improvement. His comments marked a slightly more dovish shift from the hawkish tone of the January meeting.",
    "source": "CNBC",
    "published_at": "2026-02-10T15:30:00",
    "tickers": [
      "SPY",
      "QQQ",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Accenture Cuts 8,000 Jobs in Shift from Legacy IT Services to AI",
    "summary": "Accenture announced plans to reduce its workforce by approximately 8,000 positions over the next 12 months, primarily in legacy IT outsourcing roles. The company said it will reinvest the savings into hiring AI engineers and data scientists.",
    "source": "Bloomberg",
    "published_at": "2026-02-11T07:00:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Netflix Faces Content Spending Debate as Productions Exceed $20 Billion Annual Budget",
    "summary": "Netflix's content spending is on track to exceed $20 billion in 2026, up from $17 billion in 2025. While the investment supports subscriber growth, some analysts argue the spending level is unsustainable and could pressure free cash flow.",
    "source": "Financial Times",
    "published_at": "2026-02-11T07:30:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Eli Lilly Plans Orforglipron Self-Pay Launch at $149 Starting Dose via LillyDirect",
    "summary": "Eli Lilly announced that upon FDA approval, self-pay patients will be able to access orforglipron through the LillyDirect pharmacy channel with the lowest dose starting at $149 and additional doses up to $399. The aggressive pricing strategy aims to make the oral GLP-1 pill accessible to a broad patient population.",
    "source": "Eli Lilly",
    "published_at": "2026-02-11T08:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Launches Sovereign Cloud Offering for European Governments",
    "summary": "Microsoft introduced a dedicated sovereign cloud platform for European Union governments, addressing data residency and digital sovereignty requirements. The service is hosted exclusively in EU data centers and complies with GDPR and the EU Data Act.",
    "source": "Bloomberg",
    "published_at": "2026-02-11T09:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Plans Robotaxis in Half of US States by Year-End",
    "summary": "Tesla disclosed plans to roll out its robotaxi service in half of US states by the end of 2026, with Elon Musk claiming the company will have hundreds of thousands of self-driving cars operating by December. Skeptics noted the company's history of missed autonomous driving timelines.",
    "source": "Reuters",
    "published_at": "2026-02-11T10:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "neutral"
  },
  {
    "headline": "Sector Rotation Accelerates as Investors Shift from Tech to Value",
    "summary": "Fund flow data showed a notable rotation out of technology ETFs and into financials, industrials, and healthcare over the past two weeks. Strategists attributed the shift to stretched tech valuations and improving prospects for cyclical sectors.",
    "source": "MarketWatch",
    "published_at": "2026-02-11T10:00:00",
    "tickers": [
      "QQQ",
      "DIA",
      "IWM",
      "XLF",
      "XLI"
    ],
    "sector": "Market",
    "sentiment": "neutral"
  },
  {
    "headline": "Home Depot Sees Signs of Housing Recovery as Mortgage Rates Dip",
    "summary": "Home Depot management expressed cautious optimism as 30-year mortgage rates dropped below 6.5%, potentially unlocking pent-up demand in the housing market. Spring selling season traffic has shown early positive signals.",
    "source": "WSJ",
    "published_at": "2026-02-11T11:30:00",
    "tickers": [
      "HD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard and Visa Report Strong Super Bowl Weekend Spending",
    "summary": "Payment networks Mastercard and Visa both reported a notable spike in consumer spending around Super Bowl weekend, with restaurant and bar transactions up 18% and sports betting-related purchases surging in states with legal wagering. The data underscores the resilience of U.S. discretionary spending.",
    "source": "CNBC",
    "published_at": "2026-02-11T14:00:00",
    "tickers": [
      "MA",
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Google DeepMind's AlphaFold 4 Achieves New Breakthrough in Drug Discovery",
    "summary": "Google DeepMind released AlphaFold 4, which can predict protein-drug interactions with unprecedented accuracy, accelerating pharmaceutical research timelines. Several major drugmakers have already signed licensing agreements to use the technology.",
    "source": "Financial Times",
    "published_at": "2026-02-11T14:30:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Reportedly in Talks to Acquire AI Music Startup for $600 Million",
    "summary": "Apple is in advanced discussions to acquire AI music generation startup SonicAI for approximately $600 million, according to people familiar with the matter. The deal would bolster Apple Music's capabilities with personalized AI-generated playlists and compositions.",
    "source": "Bloomberg",
    "published_at": "2026-02-12T06:15:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "UnitedHealth Declares $2.21 Quarterly Dividend Despite Revenue Challenges",
    "summary": "The UnitedHealth Group board of directors authorized a cash dividend of $2.21 per share, payable on March 17, 2026, to shareholders of record as of March 9. The dividend maintains UNH's commitment to shareholder returns even as the company navigates a projected revenue decline in 2026.",
    "source": "Stock Titan",
    "published_at": "2026-02-12T08:00:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Philip Morris ZYN Nicotine Pouches See 50% U.S. Volume Growth",
    "summary": "Philip Morris reported that ZYN nicotine pouch shipment volumes in the U.S. grew 50% year-over-year in January, reaching 600 million cans on an annualized basis. The company is investing $600 million to expand U.S. manufacturing capacity.",
    "source": "MarketWatch",
    "published_at": "2026-02-12T08:30:00",
    "tickers": [
      "PM"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "January CPI Surprises to the Downside at 2.8% Year-Over-Year",
    "summary": "Consumer prices rose 2.8% year-over-year in January, below the 3.0% consensus, with core CPI easing to 3.2%. The better-than-expected inflation reading fueled a broad market rally and boosted expectations for a potential Fed rate cut in the summer.",
    "source": "Bloomberg",
    "published_at": "2026-02-12T08:35:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan and Philip Securities Downgrade Tesla to Sell",
    "summary": "Two major firms revised their Tesla ratings to Sell in February, citing deteriorating European sales, aging product lineup, and uncertainty around the robotaxi timeline. The downgrades pushed the average analyst consensus to Hold with a 12-month target of $393.51.",
    "source": "Bloomberg",
    "published_at": "2026-02-12T09:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "JPMorgan Chase to Hire 2,000 Technology Staff in AI and Cloud Computing",
    "summary": "JPMorgan Chase announced plans to hire 2,000 additional technology professionals focused on artificial intelligence, cloud computing, and cybersecurity by mid-2026. The bank has been among the most aggressive on Wall Street in deploying large language models to improve productivity and client services.",
    "source": "Financial Times",
    "published_at": "2026-02-12T09:15:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom Custom Silicon Wins New Hyperscaler Client, Analysts Say",
    "summary": "Broadcom reportedly secured a new custom AI chip contract with a major hyperscale cloud provider, bringing its total hyperscaler customer count to four. Analysts estimate the deal could add $2-3 billion in incremental annual revenue starting in 2027.",
    "source": "The Information",
    "published_at": "2026-02-12T09:30:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Procter & Gamble Launches AI-Powered Supply Chain Overhaul",
    "summary": "P&G unveiled a major initiative to integrate AI across its global supply chain, targeting $1.5 billion in efficiency savings over three years. The system uses real-time demand sensing to optimize inventory and reduce waste.",
    "source": "Bloomberg",
    "published_at": "2026-02-12T10:30:00",
    "tickers": [
      "PG"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Einstein GPT Achieves SOC 2 Type II Compliance for Healthcare",
    "summary": "Salesforce announced that its Einstein GPT AI platform has achieved SOC 2 Type II compliance for healthcare applications. The certification opens a significant new market as healthcare organizations increasingly adopt AI for patient engagement and operations.",
    "source": "Reuters",
    "published_at": "2026-02-12T10:45:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe and Oracle Form Alliance to Streamline Enterprise Content Management",
    "summary": "Adobe and Oracle announced a joint initiative to integrate Adobe Experience Manager with Oracle's enterprise resource planning systems. The partnership will allow enterprises to manage content workflows and business operations from a single platform.",
    "source": "Bloomberg",
    "published_at": "2026-02-12T13:00:00",
    "tickers": [
      "ADBE",
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Analysts Maintain Buy Rating on UNH with $373 Target Despite Headwinds",
    "summary": "Twenty-four analysts covering UnitedHealth maintain a Buy consensus rating with an average price target of $373.12 as of late February 2026, despite the stock trading near $284. Analysts view the current weakness as temporary, citing UNH's dominant market position and expected recovery in 2027.",
    "source": "Public.com",
    "published_at": "2026-02-12T14:00:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "S&P 500 Closes Above 6,300 for First Time on CPI Optimism",
    "summary": "The S&P 500 surged 1.4% to close above 6,300, a new record, as the favorable inflation data rekindled hopes for monetary policy easing later this year. All eleven sectors finished in the green, with real estate and tech leading gains.",
    "source": "CNBC",
    "published_at": "2026-02-12T16:05:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Market",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway Annual Shareholder Letter Focuses on Succession Planning",
    "summary": "Warren Buffett's annual letter to Berkshire Hathaway shareholders devoted significant attention to the company's succession framework, praising Vice Chairman Greg Abel's leadership capabilities. Buffett also cautioned investors about speculative excess in certain sectors of the equity markets.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-13T07:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Alphabet's Verily Partners With NHS for Large-Scale AI Health Screening",
    "summary": "Alphabet's health sciences subsidiary Verily signed a partnership with the UK's National Health Service to deploy AI-powered screening tools for early cancer detection. The program will initially cover 10 million patients across England.",
    "source": "Reuters",
    "published_at": "2026-02-13T08:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Retail Sales Fall 0.3% in January, First Decline in Four Months",
    "summary": "U.S. retail sales unexpectedly declined 0.3% in January, weighed down by severe winter weather and a pullback in auto purchases. Economists cautioned against reading too much into one month of data but noted that consumer momentum may be moderating.",
    "source": "AP",
    "published_at": "2026-02-13T08:30:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Amazon Pharmacy Expands Same-Day Delivery to 30 New U.S. Cities",
    "summary": "Amazon Pharmacy now offers same-day prescription delivery in 50 major U.S. cities, up from 20. The expansion intensifies competition with CVS and Walgreens, as Amazon leverages its logistics network to disrupt the $500 billion pharmacy market.",
    "source": "CNBC",
    "published_at": "2026-02-13T09:00:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Merck Stock Hits 52-Week High at $123.30 on Pipeline Optimism",
    "summary": "Merck shares reached a 52-week high of $123.30 as Barclays initiated coverage with an overweight rating, pointing to expected drug launches and clinical trial results in 2026. Analysts highlighted the anticipated launch of enlicitide and the HIV regimen under FDA review as catalysts.",
    "source": "Barclays",
    "published_at": "2026-02-13T10:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "AMD Helios AI Rack System Targets NVIDIA's Data Center Dominance",
    "summary": "AMD unveiled its Helios reference design for AI rack infrastructure, integrating EPYC Venice CPUs, MI400 GPUs, and Pensando Vulcano AI NICs into a unified system. The rack supports up to 72 MI400 GPUs with 260 TB/s of scale-up bandwidth, directly challenging NVIDIA's DGX ecosystem.",
    "source": "Data Center Dynamics",
    "published_at": "2026-02-13T11:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Cisco Reports Backlog Normalization as Supply Chain Improves",
    "summary": "Cisco said its order backlog has returned to pre-pandemic levels as supply chain constraints have fully eased. While the backlog normalization reduces near-term revenue visibility, the company said underlying demand trends remain healthy.",
    "source": "MarketWatch",
    "published_at": "2026-02-13T11:00:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Microsoft Azure Outage Disrupts Services for Thousands of Enterprise Customers",
    "summary": "A major Azure outage lasting approximately six hours affected thousands of enterprise customers across North America and Europe. Microsoft attributed the disruption to a configuration error in its networking infrastructure and said it is implementing safeguards to prevent recurrence.",
    "source": "WSJ",
    "published_at": "2026-02-13T11:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "GE Aerospace Faces Supply Chain Delays on LEAP Engine Deliveries",
    "summary": "GE Aerospace disclosed that supply chain constraints are delaying LEAP engine deliveries by 4-6 weeks, impacting both Boeing and Airbus production schedules. Titanium and nickel alloy shortages remain the primary bottleneck.",
    "source": "Reuters",
    "published_at": "2026-02-13T14:15:00",
    "tickers": [
      "GE"
    ],
    "sector": "Industrials",
    "sentiment": "negative"
  },
  {
    "headline": "Johnson & Johnson Loses Talc Trial, Adding to 67,000+ Active Lawsuits",
    "summary": "A jury found Johnson & Johnson liable in a talc baby powder-linked ovarian cancer trial on February 13, 2026. The verdict adds to over 67,000 active talc lawsuits against the company, following a $1.5 billion Baltimore jury award in December 2025 and a $40 million California verdict.",
    "source": "Asbestos.com",
    "published_at": "2026-02-13T15:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Merck Positive Data for ENFLONSIA RSV Treatment in At-Risk Infants",
    "summary": "Merck announced positive new data for ENFLONSIA (clesrovimab) in infants and children under 2 at increased risk for severe RSV disease, showing consistent protection over two RSV seasons. The results strengthen Merck's position in the growing RSV prevention market.",
    "source": "Merck",
    "published_at": "2026-02-14T07:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Intel Downgraded by Two Analysts on Continued Execution Concerns",
    "summary": "Analysts at Barclays and UBS both downgraded Intel to neutral, citing uncertainty around the company's foundry ramp and ongoing market share losses in PC and server processors. Both firms lowered their price targets by approximately 15%.",
    "source": "Bloomberg",
    "published_at": "2026-02-14T07:30:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "China Signals Willingness to Negotiate on Tariffs, Markets Rally Globally",
    "summary": "Chinese Vice Premier He Lifeng said Beijing is open to constructive dialogue to resolve the tariff standoff with Washington. Global equity markets rallied on the de-escalation signal, with the S&P 500 gaining 0.9% and the Shanghai Composite surging 2.1%.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-14T07:45:00",
    "tickers": [
      "SPY",
      "QQQ",
      "AAPL",
      "NVDA"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "BYD Doubles European Market Share as Tesla Retreats",
    "summary": "Chinese EV giant BYD more than doubled its market share across the EU, UK, Switzerland, Norway, and Iceland in January, filling the vacuum left by Tesla's sales decline. The shift underscores the competitive threat facing Tesla from lower-priced Chinese EVs in international markets.",
    "source": "Reuters",
    "published_at": "2026-02-14T08:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Goldman Sachs IPO Pipeline Signals Dealmaking Recovery in 2026",
    "summary": "Goldman Sachs executives disclosed that the firm's IPO pipeline is the fullest it has been since early 2021, with several large technology and healthcare companies preparing to go public. The expected wave of offerings could generate hundreds of millions in underwriting fees for the bank.",
    "source": "Barron's",
    "published_at": "2026-02-14T08:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "PepsiCo Invests $500 Million in U.S. Manufacturing Expansion",
    "summary": "PepsiCo announced a $500 million investment to build two new manufacturing plants in Texas and Georgia. The facilities will produce Frito-Lay snacks and Gatorade beverages, creating approximately 800 jobs.",
    "source": "Reuters",
    "published_at": "2026-02-14T08:00:00",
    "tickers": [
      "PEP"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "J&J Stock Rallies 62% Over Past Year Despite Talc Litigation Overhang",
    "summary": "Johnson & Johnson shares have surged 62% over the past year from February 2025 to February 2026, driven by soaring oncology profits and strong MedTech sales. Analysts maintain a Buy consensus with an average price target of $227.29, though ongoing talc litigation remains a risk factor.",
    "source": "Trefis",
    "published_at": "2026-02-14T09:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Siri Overhaul With LLM Integration Set for WWDC 2026",
    "summary": "Apple is preparing a major overhaul of Siri powered by its proprietary large language model for announcement at WWDC in June 2026. The updated assistant is expected to support multi-turn conversations, complex task execution, and deep app integration.",
    "source": "The Verge",
    "published_at": "2026-02-14T10:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Meta LLAMA 4 Integration Boosts Ray-Ban Glasses AI Capabilities",
    "summary": "Meta's integration of its LLAMA 4 large language model into Ray-Ban smart glasses has significantly improved the device's conversational AI capabilities. Users report more natural interactions and faster responses, positioning the glasses as a leading wearable AI product.",
    "source": "The Verge",
    "published_at": "2026-02-14T11:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Linde Faces Margin Pressure from Rising Natural Gas Costs in Europe",
    "summary": "Linde cautioned that elevated European natural gas prices are compressing margins in its EMEA segment, which accounts for 25% of revenue. The company is accelerating contract repricing to pass through higher energy costs.",
    "source": "WSJ",
    "published_at": "2026-02-14T14:00:00",
    "tickers": [
      "LIN"
    ],
    "sector": "Materials",
    "sentiment": "negative"
  },
  {
    "headline": "Oracle Q3 Earnings Miss on Consulting Revenue Weakness",
    "summary": "Oracle reported Q3 FY2026 earnings that fell short of analyst expectations, with consulting services revenue declining 6% year-over-year. While cloud infrastructure remained strong, the consulting miss raised questions about enterprise IT spending momentum.",
    "source": "MarketWatch",
    "published_at": "2026-02-14T16:30:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Netflix Shares Drop 4% on Reports of Slowing Growth in Asia-Pacific Markets",
    "summary": "Netflix stock declined 4.2% after reports indicated subscriber growth in Asia-Pacific is slowing due to intense competition from local streaming services. The region had been one of Netflix's fastest-growing markets over the past two years.",
    "source": "Bloomberg",
    "published_at": "2026-02-15T07:15:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Merck Wins FDA Approval for NUMELVI Allergy Tablet for Dogs",
    "summary": "Merck received FDA approval for NUMELVI, the first second-generation JAK inhibitor for control of pruritus associated with allergic dermatitis in dogs six months of age and older. The product is expected to be available at veterinary clinics nationwide in spring 2026.",
    "source": "Stock Titan",
    "published_at": "2026-02-15T08:00:00",
    "tickers": [
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Memory Costs Soar Amid Global HBM Shortage",
    "summary": "NVIDIA flagged rising memory costs as a key challenge, with the global shortage of HBM3E chips driving prices higher. The shortage affects every Blackwell and Rubin GPU, with TSMC's advanced packaging capacity unable to keep pace with AI-driven demand.",
    "source": "DigiTimes",
    "published_at": "2026-02-15T09:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Google Faces Class Action Lawsuit Over AI-Generated Content in Search Results",
    "summary": "A class action lawsuit was filed against Alphabet alleging that Google's AI-generated search summaries have caused significant traffic losses to independent publishers. The plaintiffs seek damages of $4.5 billion and an injunction against AI Overviews in search.",
    "source": "MarketWatch",
    "published_at": "2026-02-15T09:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Visa's New Tap-to-Pay Technology Achieves 80% Penetration in Major U.S. Metros",
    "summary": "Visa announced that its contactless tap-to-pay technology has reached 80% penetration at point-of-sale terminals in the top 20 U.S. metropolitan areas. The milestone marks a significant shift in American payment habits, which historically lagged behind European and Asian markets in contactless adoption.",
    "source": "Reuters",
    "published_at": "2026-02-15T10:30:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm and Cisco Partner on Private 5G Network Solutions",
    "summary": "Qualcomm and Cisco announced a joint solution for enterprise private 5G networks, combining Qualcomm's 5G modem technology with Cisco's networking and security stack. The partnership targets manufacturing, logistics, and healthcare facilities seeking dedicated wireless connectivity.",
    "source": "Reuters",
    "published_at": "2026-02-15T10:30:00",
    "tickers": [
      "QCOM",
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Costco Plans 30 New Warehouse Openings in Fiscal 2026",
    "summary": "Costco announced plans to open 30 new warehouse locations in fiscal 2026, with a focus on underserved suburban markets and international expansion in China and Japan. The expansion is the most aggressive in the company's history.",
    "source": "WSJ",
    "published_at": "2026-02-15T11:00:00",
    "tickers": [
      "COST"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft and Nvidia Deepen AI Chip Collaboration for Azure Data Centers",
    "summary": "Microsoft and Nvidia announced an expanded collaboration to develop custom AI accelerators optimized for Azure data centers. The partnership aims to deliver next-generation inference performance improvements of up to 3x over current GPU-based architectures.",
    "source": "CNBC",
    "published_at": "2026-02-15T12:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard Partners with African Central Banks on Mobile Payment Infrastructure",
    "summary": "Mastercard signed agreements with central banks in Kenya, Nigeria, and Ghana to build out mobile payment infrastructure aimed at boosting financial inclusion. The initiative will connect millions of unbanked consumers to the formal financial system through mobile-first payment solutions.",
    "source": "Bloomberg",
    "published_at": "2026-02-16T06:30:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Watch Ultra 3 With Blood Glucose Monitoring Gets FDA Clearance",
    "summary": "Apple received FDA clearance for a non-invasive blood glucose monitoring feature on the Apple Watch Ultra 3, a long-anticipated health technology breakthrough. The feature uses optical sensors to provide continuous glucose readings without the need for a needle.",
    "source": "Bloomberg",
    "published_at": "2026-02-16T08:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Tesla Robotaxi Status: 8 Months In, Only 19% Availability",
    "summary": "An analysis of Tesla's Austin robotaxi fleet revealed only 19% availability eight months after launch, with most of Musk's promises still unfulfilled. The service operates in a limited geofenced area and has struggled with weather, night driving, and complex intersections.",
    "source": "Electrek",
    "published_at": "2026-02-16T10:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce Completes Acquisition of AI Data Analytics Firm Databricks Integration",
    "summary": "Salesforce finalized a deep integration partnership with Databricks, allowing seamless data sharing between the two platforms. The partnership gives Salesforce customers access to advanced data lakehouse capabilities for AI model training and deployment.",
    "source": "WSJ",
    "published_at": "2026-02-16T10:00:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Creative Cloud Enterprise Contracts Grow 22% Year-Over-Year",
    "summary": "Adobe reported that enterprise Creative Cloud contracts grew 22% in value year-over-year, offsetting softness in the consumer and SMB segments. Large organizations are increasingly standardizing on Adobe's AI-enhanced creative suite.",
    "source": "Reuters",
    "published_at": "2026-02-16T14:00:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Walmart Faces Labor Pressure as Minimum Wage Debate Intensifies",
    "summary": "Walmart is facing renewed pressure to raise its starting wage above $15 per hour as several states move to implement higher minimums. The company currently employs 1.6 million U.S. workers, making labor costs a key margin driver.",
    "source": "WSJ",
    "published_at": "2026-02-16T14:45:00",
    "tickers": [
      "WMT"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Texas Instruments CFO Says Capex Will Peak in 2026 as Fab Build-Out Continues",
    "summary": "Texas Instruments CFO Rafael Lizardi told investors that capital expenditures will peak in 2026 at approximately $5.5 billion before declining in 2027. The spending supports the company's long-term strategy to bring more manufacturing capacity in-house.",
    "source": "CNBC",
    "published_at": "2026-02-16T15:00:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Accenture Expands in Japan with Acquisition of NTT Data Consulting Unit",
    "summary": "Accenture agreed to acquire NTT Data's strategic consulting division for $1.2 billion, significantly expanding its presence in Japan. The deal adds over 3,000 consultants and strengthens Accenture's ability to serve Japanese enterprise clients undergoing digital transformation.",
    "source": "Reuters",
    "published_at": "2026-02-17T05:00:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon, Oracle Among Bidders for TikTok U.S. Operations Amid Divestiture Deadline",
    "summary": "Amazon and Oracle have reportedly submitted bids for TikTok's U.S. operations as the divestiture deadline approaches. Both companies see TikTok's user base and content algorithm as complementary to their existing platforms.",
    "source": "Financial Times",
    "published_at": "2026-02-17T06:30:00",
    "tickers": [
      "AMZN",
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Analyst Downgrades Microsoft Citing Stretched Valuation and Capex Concerns",
    "summary": "Morgan Stanley downgraded Microsoft from Overweight to Equal Weight, citing concerns about the company's elevated capital expenditure on AI infrastructure relative to near-term returns. The firm lowered its price target from $500 to $460.",
    "source": "MarketWatch",
    "published_at": "2026-02-17T06:45:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Danaher Announces $9.9B Acquisition of Masimo Corporation",
    "summary": "Danaher agreed to acquire medical technology company Masimo for $9.9 billion in an all-cash deal at $180 per share, a nearly 40% premium. Masimo, which specializes in pulse oximetry and patient monitoring, generated $2.18 billion in trailing 12-month revenue, and the deal is expected to close in H2 2026.",
    "source": "24/7 Wall St",
    "published_at": "2026-02-17T07:00:00",
    "tickers": [
      "DHR"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Alphabet Invests $3 Billion in Southeast Asian Cloud Infrastructure",
    "summary": "Alphabet announced a $3 billion investment to build new Google Cloud data centers in Indonesia, Vietnam, and Thailand. The expansion targets the rapidly growing Southeast Asian enterprise cloud market, which is projected to reach $60 billion by 2028.",
    "source": "Financial Times",
    "published_at": "2026-02-17T07:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "FDA Approves J&J's Rybrevant Faspro for Monthly Dosing in Lung Cancer",
    "summary": "The FDA approved a new monthly dosing schedule for Johnson & Johnson's Rybrevant Faspro for first-line treatment of EGFR-mutated advanced non-small cell lung cancer. The monthly subcutaneous injection offers a fivefold reduction in administration-related reactions compared to intravenous delivery.",
    "source": "Johnson & Johnson",
    "published_at": "2026-02-17T08:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Starbucks U.S. Traffic Improves in February on Menu Simplification",
    "summary": "Early data suggests Starbucks is seeing improved U.S. store traffic following its menu simplification rollout, with morning daypart transactions up 3%. Analysts say the turnaround strategy is showing encouraging initial signs.",
    "source": "MarketWatch",
    "published_at": "2026-02-17T08:45:00",
    "tickers": [
      "SBUX"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA and Meta Forge Massive Multi-Year AI Alliance",
    "summary": "NVIDIA and Meta announced a multiyear, multigenerational strategic partnership spanning on-premises, cloud, and AI infrastructure. The deal covers large-scale deployment of millions of NVIDIA Blackwell and Rubin GPUs, as well as the first large-scale NVIDIA Grace-only CPU deployment.",
    "source": "CNBC",
    "published_at": "2026-02-17T09:00:00",
    "tickers": [
      "NVDA",
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Nvidia Surpasses $4 Trillion Market Cap as AI Demand Shows No Signs of Slowing",
    "summary": "Nvidia's market capitalization briefly exceeded $4 trillion during intraday trading, making it the second most valuable public company globally. The milestone was driven by pre-order demand for its Blackwell Ultra chips and bullish analyst price target revisions.",
    "source": "Bloomberg",
    "published_at": "2026-02-17T11:30:00",
    "tickers": [
      "NVDA",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Danaher-Masimo Deal Marks One of 2026's Largest Medtech Buyouts",
    "summary": "Danaher expects the Masimo acquisition to generate over $530 million in EBITDA by 2027, with $125 million in annual cost synergies and $50 million in revenue synergies by year five. The deal is expected to be accretive to adjusted diluted EPS by $0.15 to $0.20 in the first year.",
    "source": "PR Newswire",
    "published_at": "2026-02-17T12:00:00",
    "tickers": [
      "DHR"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan's Jamie Dimon Warns of Geopolitical Risks to Global Markets",
    "summary": "JPMorgan Chase CEO Jamie Dimon warned that escalating geopolitical tensions represent the most significant risk to global financial stability, citing flashpoints in Eastern Europe and the South China Sea. Dimon urged regulators and policymakers to prepare for potential disruptions to trade and capital flows.",
    "source": "CNBC",
    "published_at": "2026-02-17T12:45:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Meta Expands NVIDIA Deal to Include Millions of AI Chips and Standalone CPUs",
    "summary": "Meta's expanded partnership with NVIDIA includes deployment of Arm-based Grace CPUs for data center production applications and plans to integrate Spectrum-X Ethernet switches. The companies are also collaborating on NVIDIA's Vera CPUs with potential large-scale deployment in 2027.",
    "source": "CNBC",
    "published_at": "2026-02-17T14:00:00",
    "tickers": [
      "NVDA",
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Expands India Manufacturing With New Chennai Assembly Plant",
    "summary": "Apple confirmed plans to open a new iPhone assembly facility in Chennai, India, in partnership with Tata Electronics. The plant is expected to produce 20 million iPhones annually by 2028, further reducing Apple's dependence on Chinese manufacturing.",
    "source": "Reuters",
    "published_at": "2026-02-18T05:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "J&J's Rybrevant Faspro Receives FDA Breakthrough Designation for Head and Neck Cancer",
    "summary": "The FDA granted Breakthrough Therapy Designation for J&J's subcutaneous Rybrevant Faspro in adults with recurrent or metastatic HPV-unrelated head and neck squamous cell carcinoma. The designation provides an expedited development pathway and signals the FDA sees potential for meaningful benefit over existing therapies.",
    "source": "Johnson & Johnson",
    "published_at": "2026-02-18T07:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Lilly's Orforglipron Maintains Weight Loss After Switching from Injectables",
    "summary": "Eli Lilly reported results from a first-of-its-kind Phase 3 trial showing orforglipron helped patients maintain weight loss after switching from injectable GLP-1 therapies. The data supports a key use case where patients transition from injections to a more convenient daily pill without losing treatment benefits.",
    "source": "Eli Lilly",
    "published_at": "2026-02-18T07:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway Reports Record Operating Earnings for 2025",
    "summary": "Berkshire Hathaway reported full-year 2025 operating earnings of $42.8 billion, a 16% increase over the prior year, led by strong results in insurance underwriting and BNSF Railway. Book value per share grew 14.2% for the year, outpacing the S&P 500's total return.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-18T08:00:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Broadcom Networking Revenue Surges 28% on Data Center Buildout",
    "summary": "Broadcom's networking semiconductor division posted 28% year-over-year revenue growth in the latest quarter, driven by demand for Memory switches and custom ASICs. The company said it expects networking revenue to remain strong through the rest of fiscal 2026.",
    "source": "WSJ",
    "published_at": "2026-02-18T08:00:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Announces $15 Billion Share Buyback Program",
    "summary": "Netflix's board approved a new $15 billion share repurchase program, its largest ever. The company said the buyback reflects confidence in its long-term growth trajectory and strong free cash flow generation.",
    "source": "CNBC",
    "published_at": "2026-02-18T08:30:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Housing Starts Plunge 8% as High Mortgage Rates Dampen Construction",
    "summary": "U.S. housing starts fell 8% in January to an annualized rate of 1.32 million units, the lowest since mid-2024. The 30-year fixed mortgage rate near 7.1% continued to suppress both new construction and existing home sales activity.",
    "source": "Reuters",
    "published_at": "2026-02-18T08:30:00",
    "tickers": [
      "SPY",
      "IWM",
      "XHB"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Stock Forecast: Analysts Divided Between $25 and $600",
    "summary": "Tesla remains the most polarizing stock on Wall Street, with price targets ranging from GLJ Research's $25 bear case to Wedbush's $600 bull case. The extreme divergence reflects fundamental disagreement about the value of Tesla's robotaxi and AI initiatives versus its declining core auto business.",
    "source": "Barron's",
    "published_at": "2026-02-18T09:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "neutral"
  },
  {
    "headline": "McDonald's Plans 2,000 New Restaurant Openings Globally in 2026",
    "summary": "McDonald's unveiled plans to open approximately 2,000 new restaurants worldwide in 2026, the fastest pace of expansion in two decades. The growth is concentrated in China, India, and Southeast Asia.",
    "source": "WSJ",
    "published_at": "2026-02-18T10:30:00",
    "tickers": [
      "MCD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "J&J Announces $1B+ Cell Therapy Manufacturing Site",
    "summary": "Johnson & Johnson announced plans for a new cell therapy manufacturing site with investment exceeding $1 billion. The facility will support the company's growing CAR-T therapy portfolio and reflects J&J's commitment to expanding its oncology manufacturing capabilities to meet rising demand.",
    "source": "Johnson & Johnson",
    "published_at": "2026-02-18T14:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Gaming Division Reports Record Quarter Led by Game Pass Growth",
    "summary": "Microsoft's gaming division posted record quarterly revenue of $6.8 billion, driven by Game Pass subscriptions surpassing 50 million members. The Activision Blizzard integration continues to contribute strong title launches and engagement metrics.",
    "source": "CNBC",
    "published_at": "2026-02-18T14:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Goldman Sachs Partners with European Bank on Carbon Credit Trading Platform",
    "summary": "Goldman Sachs and a major European bank announced a joint venture to create a digital platform for trading voluntary carbon credits. The platform aims to bring greater transparency and liquidity to the fragmented carbon offset market, which Goldman estimates could reach $100 billion by 2030.",
    "source": "Financial Times",
    "published_at": "2026-02-18T15:30:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Boeing Reports Q4 Loss as Defense Unit Continues to Drag",
    "summary": "Boeing reported a fourth-quarter net loss of $1.1 billion, driven by continued cost overruns in its defense and space division. The commercial aviation unit showed improvement with positive operating margins for the first time in two years.",
    "source": "CNBC",
    "published_at": "2026-02-19T07:30:00",
    "tickers": [
      "BA"
    ],
    "sector": "Industrials",
    "sentiment": "negative"
  },
  {
    "headline": "Visa Stock Downgraded by Major Brokerage on Valuation Concerns",
    "summary": "Analysts at a major Wall Street brokerage downgraded Visa shares to hold from buy, arguing that the stock's premium valuation of 32 times forward earnings leaves limited upside. The analysts acknowledged Visa's strong fundamentals but said growth expectations are already fully priced in.",
    "source": "MarketWatch",
    "published_at": "2026-02-19T07:45:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Model Y Turns Four as Buyers Seek Fresher Alternatives",
    "summary": "Tesla's best-selling Model Y marked its fourth year on the market without a major redesign, contributing to waning consumer interest. European and Chinese buyers have increasingly turned to newer offerings from BYD, Hyundai, and Volkswagen that offer competitive range and features.",
    "source": "Reuters",
    "published_at": "2026-02-19T08:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Faces Labor Complaint From Retail Workers Seeking Unionization",
    "summary": "The National Labor Relations Board filed a complaint against Apple alleging the company interfered with unionization efforts at several retail stores in New York and California. Apple denied the allegations, stating it respects employees' rights to organize.",
    "source": "WSJ",
    "published_at": "2026-02-19T08:15:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Amgen's Biosimilar Pipeline Advances with Opdivo and Keytruda Candidates",
    "summary": "Amgen disclosed that ABP-206 (biosimilar to Opdivo) and ABP-234 (biosimilar to Keytruda) have completed enrollment in their comparative clinical studies. Successful development of these biosimilars could position Amgen to capture share when Bristol-Myers and Merck's blockbuster cancer immunotherapies face patent expirations.",
    "source": "Amgen",
    "published_at": "2026-02-19T09:00:00",
    "tickers": [
      "AMGN",
      "MRK"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "NVIDIA GB300 Systems Take Center Stage in Meta AI Alliance",
    "summary": "NVIDIA's GB300 GPU systems are at the heart of the newly announced Meta infrastructure partnership, with the next-generation Blackwell Ultra architecture delivering significant performance improvements for large-scale AI training. Meta plans to deploy GB300 racks across multiple new hyperscale data centers.",
    "source": "Next Platform",
    "published_at": "2026-02-19T10:00:00",
    "tickers": [
      "NVDA",
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Google Maps Integrates Real-Time AI Traffic Prediction, Reducing Commute Times",
    "summary": "Google launched a major update to Google Maps featuring AI-powered real-time traffic prediction that the company claims reduces average commute times by 12%. The feature uses Gemini models to process traffic patterns, weather data, and local events simultaneously.",
    "source": "TechCrunch",
    "published_at": "2026-02-19T10:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Coca-Cola Expands Alcohol Portfolio with New RTD Cocktail Line",
    "summary": "Coca-Cola is launching a line of premium ready-to-drink cocktails under its mixer brand in partnership with Brown-Forman. The move deepens Coca-Cola's push into the $30 billion U.S. spirits market.",
    "source": "CNBC",
    "published_at": "2026-02-19T10:15:00",
    "tickers": [
      "KO"
    ],
    "sector": "Consumer Staples",
    "sentiment": "neutral"
  },
  {
    "headline": "UnitedHealth Continues Cooperation with DOJ Medicare Billing Investigation",
    "summary": "UnitedHealth Group confirmed ongoing cooperation with the Department of Justice's civil and criminal investigations into its Medicare Advantage billing practices and Optum Rx operations. The DOJ is examining whether UnitedHealth inflated risk scores and diagnoses to drive higher payments from CMS.",
    "source": "Healthcare Dive",
    "published_at": "2026-02-19T11:00:00",
    "tickers": [
      "UNH"
    ],
    "sector": "Healthcare",
    "sentiment": "negative"
  },
  {
    "headline": "Intel Arrow Lake Desktop CPUs Gain Positive Reviews, Market Share Stabilizing",
    "summary": "Independent benchmarks show Intel's Arrow Lake desktop processors closing the performance gap with AMD's Ryzen 9000 series. Tech reviewers praised the power efficiency improvements, and retail channel data suggests Intel's desktop market share has stabilized after months of decline.",
    "source": "MarketWatch",
    "published_at": "2026-02-19T12:00:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Mastercard CFO Says Buy-Now-Pay-Later Adoption Is Complementary, Not Disruptive",
    "summary": "Mastercard's CFO told analysts at an industry conference that buy-now-pay-later services are increasingly flowing through traditional card networks rather than displacing them. She noted that Mastercard processes a growing share of BNPL transactions through its installment payment programs.",
    "source": "Barron's",
    "published_at": "2026-02-19T14:00:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Fed Minutes Reveal Growing Concern Over Tariff-Driven Inflation Risks",
    "summary": "The minutes from the January FOMC meeting showed that several participants expressed concern that new tariffs could reignite inflationary pressures. The discussion underscored the Fed's dilemma of balancing growth support with price stability in a rapidly shifting trade environment.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-19T14:00:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Salesforce Revenue Growth Slows to 9% as Large Deal Cycles Lengthen",
    "summary": "Salesforce reported fiscal Q4 revenue growth of 9%, its slowest pace in two years, as large enterprise deals took longer to close. The company maintained that its pipeline remains robust but acknowledged that macroeconomic caution is affecting deal velocity.",
    "source": "Bloomberg",
    "published_at": "2026-02-19T15:00:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Tech Sector Selloff Hits Cloud and Enterprise Software Stocks",
    "summary": "A broad selloff in technology stocks pulled down shares of Amazon, Salesforce, Adobe, Oracle, and Netflix by 2-4% on rising interest rate concerns. The Nasdaq fell 2.7% in its worst session of 2026 as Treasury yields climbed to 4.8%.",
    "source": "MarketWatch",
    "published_at": "2026-02-19T16:45:00",
    "tickers": [
      "AMZN",
      "CRM",
      "ADBE",
      "ORCL",
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Cisco Stock Falls After CFO Departure Announcement",
    "summary": "Cisco shares dropped 3% after the company disclosed that CFO Scott Herren plans to retire in June 2026. While the transition was described as planned, investors expressed concern about leadership continuity during a critical period of strategic transformation.",
    "source": "Bloomberg",
    "published_at": "2026-02-19T16:45:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Alphabet Explores Spin-Off of Waymo as Standalone Public Company",
    "summary": "Alphabet is reportedly evaluating a potential IPO or spin-off of Waymo, its autonomous vehicle subsidiary valued at an estimated $45 billion. A decision is expected by the end of Q2 2026, according to people briefed on the discussions.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T06:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Walmart Earnings Top Estimates, but Retailer Warns Tariffs Will Raise Prices",
    "summary": "Walmart reported Q4 earnings per share of $1.92, beating the $1.85 consensus, on strong grocery and e-commerce sales. However, the company warned that new tariffs on Chinese imports would likely lead to higher prices on many consumer goods by spring.",
    "source": "CNBC",
    "published_at": "2026-02-20T07:00:00",
    "tickers": [
      "WMT",
      "SPY",
      "DIA"
    ],
    "sector": "Consumer Staples",
    "sentiment": "neutral"
  },
  {
    "headline": "Qualcomm Faces New FTC Investigation Over Modem Chip Licensing Practices",
    "summary": "The Federal Trade Commission has opened a new inquiry into Qualcomm's modem chip licensing terms with smartphone manufacturers. The investigation revisits concerns about whether Qualcomm's royalty structure constitutes anticompetitive behavior in the 5G modem market.",
    "source": "WSJ",
    "published_at": "2026-02-20T09:00:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Shares Drop on Reports of Robotaxi Shortcomings",
    "summary": "Tesla shares fell in early trading following reports highlighting persistent shortcomings in its Austin robotaxi operation. The service struggles with weather conditions, complex intersections, and night driving, raising questions about the timeline for profitable scaling.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T09:30:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "negative"
  },
  {
    "headline": "Microsoft Dynamics 365 Gains Market Share Against Salesforce in CRM",
    "summary": "New market research data shows Microsoft Dynamics 365 has captured 22% of the global CRM market, narrowing the gap with Salesforce's 24% share. AI-powered sales forecasting and customer insights features have been key differentiators for Microsoft.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T09:30:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Exxon Raises Dividend for 44th Consecutive Year",
    "summary": "ExxonMobil increased its quarterly dividend by 4% to $1.01 per share, extending its streak as a Dividend Aristocrat. Management cited strong free cash flow generation and a disciplined capital allocation strategy.",
    "source": "MarketWatch",
    "published_at": "2026-02-20T09:45:00",
    "tickers": [
      "XOM"
    ],
    "sector": "Energy",
    "sentiment": "positive"
  },
  {
    "headline": "Amazon Launches AI-Powered Product Design Tool for Sellers",
    "summary": "Amazon introduced an AI tool that helps third-party sellers automatically generate product images, listings, and A/B test variations. The tool, powered by Amazon Bedrock, is free for sellers with Professional accounts.",
    "source": "Reuters",
    "published_at": "2026-02-20T10:00:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Tops Bank Customer Satisfaction Rankings for Third Consecutive Year",
    "summary": "JPMorgan Chase ranked first in J.D. Power's annual U.S. retail banking customer satisfaction survey for the third year running, scoring highly in digital experience, branch service, and account offerings. The result reflects JPMorgan's substantial investments in technology and branch modernization.",
    "source": "Reuters",
    "published_at": "2026-02-20T10:00:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Meta Quest 4 VR Headset Pushed Back to 2027 or Later",
    "summary": "Leakers indicate Meta's next-generation Quest 4 VR headset has been pushed back from its original late 2026 timeline to 2027 or even 2028. The company appears to be redirecting resources toward AI glasses and infrastructure rather than standalone VR hardware.",
    "source": "UploadVR",
    "published_at": "2026-02-20T11:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "RTX Collins Aerospace Wins Major Avionics Contract with Airbus",
    "summary": "RTX's Collins Aerospace division secured a multi-billion dollar avionics supply agreement with Airbus for the A320neo family. The long-term contract covers flight displays, communications systems, and flight management computers.",
    "source": "CNBC",
    "published_at": "2026-02-20T11:00:00",
    "tickers": [
      "RTX"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Exact Sciences Stockholders Approve $21B Acquisition by Abbott",
    "summary": "Exact Sciences stockholders overwhelmingly approved the acquisition by Abbott, with more than 99% of votes cast in favor, representing approximately 67% of total outstanding shares. The $105-per-share all-cash deal is expected to close before the end of Q2 2026, pending remaining regulatory approvals.",
    "source": "Business Wire",
    "published_at": "2026-02-20T12:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway's Precision Castparts Sees Aerospace Demand Rebound",
    "summary": "Precision Castparts, the aerospace parts manufacturer owned by Berkshire Hathaway, reported a 22% increase in orders as commercial aircraft production ramps up at Boeing and Airbus. The recovery is a welcome development after the unit took significant write-downs during the pandemic-era downturn.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T13:15:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Adobe Faces Patent Infringement Suit from AI Startup Over Image Generation Technology",
    "summary": "A San Francisco-based AI startup filed a patent infringement lawsuit against Adobe, claiming that Firefly's image generation technology violates three of its patents. Adobe said it will vigorously defend itself and believes its technology was independently developed.",
    "source": "WSJ",
    "published_at": "2026-02-20T13:30:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Bitcoin Surges Past $115,000 as Institutional Adoption Accelerates",
    "summary": "Bitcoin hit a new all-time high above $115,000 as several major pension funds disclosed allocations to spot Bitcoin ETFs. The rally extended to the broader crypto market, with the total market cap surpassing $4.5 trillion.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T14:00:00",
    "tickers": [
      "SPY",
      "QQQ"
    ],
    "sector": "Market",
    "sentiment": "positive"
  },
  {
    "headline": "Texas Instruments Outperforms Peers as Analog Chip Cycle Turns",
    "summary": "Texas Instruments shares rose 5% after the company reported preliminary data showing February orders tracking above seasonal norms. Analysts at Bernstein said the data confirms that the analog semiconductor downturn has bottomed and a recovery is underway.",
    "source": "Bloomberg",
    "published_at": "2026-02-20T14:30:00",
    "tickers": [
      "TXN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft and Apple Vie for Pentagon's $15 Billion Cloud Contract",
    "summary": "The U.S. Department of Defense announced that Microsoft and Apple are among the final bidders for a $15 billion cloud and AI services contract. The multi-vendor award is expected to be announced in Q3 2026 and will shape military technology infrastructure for the next decade.",
    "source": "Reuters",
    "published_at": "2026-02-21T08:00:00",
    "tickers": [
      "MSFT",
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Oracle Expands Sovereign Cloud Offerings to 15 New Countries",
    "summary": "Oracle announced the expansion of its sovereign cloud services to 15 new countries, including Brazil, India, and Saudi Arabia. The sovereign cloud model, which keeps data within national borders, has become a key differentiator for Oracle in government contracts.",
    "source": "Financial Times",
    "published_at": "2026-02-21T08:15:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Accenture's AI Revenue Run Rate Tops $12 Billion Annually",
    "summary": "Accenture revealed that its AI-related services now generate over $12 billion in annualized revenue, making it the largest AI consulting practice globally. The rapid growth has been driven by demand for generative AI strategy, implementation, and change management services.",
    "source": "CNBC",
    "published_at": "2026-02-21T08:30:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Initial Jobless Claims Fall to 195,000, Lowest Since October",
    "summary": "Weekly initial unemployment claims dropped to 195,000, indicating continued labor market tightness. The low reading was at odds with softening consumer spending data, presenting a mixed picture of the economic outlook.",
    "source": "MarketWatch",
    "published_at": "2026-02-21T08:30:00",
    "tickers": [
      "SPY",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "February 26 Could Be a Huge Day for the Stock Market",
    "summary": "Analysts warned that NVIDIA's Q4 FY2026 earnings release on February 25, with results digested on February 26, could significantly move the broader market. NVIDIA's outsized influence on the S&P 500 and Nasdaq means its results often set the tone for tech sector sentiment.",
    "source": "Motley Fool",
    "published_at": "2026-02-21T09:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Home Depot Launches In-Store AI Design Consultations for Kitchens",
    "summary": "Home Depot is rolling out AI-powered kitchen design consultations at 500 stores, allowing customers to visualize renovations using augmented reality. The initiative aims to boost conversion rates on high-value remodeling projects.",
    "source": "Reuters",
    "published_at": "2026-02-21T09:00:00",
    "tickers": [
      "HD"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "neutral"
  },
  {
    "headline": "Goldman Sachs Launches Retail Investment App Targeting Affluent Millennials",
    "summary": "Goldman Sachs unveiled a new mobile investment platform targeting affluent millennials with personalized portfolio management and alternative investment access at lower minimums. The app represents Goldman's latest attempt to reach a broader customer base after retreating from mass-market consumer banking.",
    "source": "CNBC",
    "published_at": "2026-02-21T09:30:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "AMD CEO Lisa Su Highlights AI as Largest Growth Opportunity",
    "summary": "AMD CEO Lisa Su told investors that artificial intelligence represents the largest growth opportunity in the company's history, projecting AI-related GPU revenue could reach $12 billion in 2026. She highlighted the OpenAI partnership and MI400 roadmap as key competitive differentiators.",
    "source": "CNBC",
    "published_at": "2026-02-21T10:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Pay Later Reaches 30 Million Users, Gains Ground in Buy-Now-Pay-Later Market",
    "summary": "Apple disclosed that Apple Pay Later has attracted 30 million active users since its expanded launch, processing over $12 billion in loan originations. The growth positions Apple as a significant fintech competitor alongside Affirm and Klarna.",
    "source": "CNBC",
    "published_at": "2026-02-21T11:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Gaming Division Reaches 100 Million Monthly Active Users",
    "summary": "Netflix disclosed that its mobile gaming platform now has over 100 million monthly active users, up from 55 million a year ago. The company has released 120 games to date and is investing in cloud gaming capabilities expected to launch later this year.",
    "source": "Bloomberg",
    "published_at": "2026-02-21T11:00:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Nvidia Q4 Earnings Crush Estimates With $42 Billion in Revenue",
    "summary": "Nvidia reported fourth-quarter revenue of $42 billion, a 68% year-over-year increase that handily beat the $39.5 billion consensus. Data center revenue was the primary driver, though the company's forward guidance slightly disappointed investors expecting even more aggressive growth.",
    "source": "CNBC",
    "published_at": "2026-02-21T16:15:00",
    "tickers": [
      "NVDA",
      "QQQ",
      "SPY",
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa and Mastercard Settle U.K. Interchange Fee Lawsuit for $720 Million",
    "summary": "Visa and Mastercard agreed to a combined $720 million settlement with a group of U.K. retailers who alleged the card networks charged excessive interchange fees for over a decade. The settlement removes a longstanding legal overhang but does not set a binding precedent for future fee disputes.",
    "source": "Financial Times",
    "published_at": "2026-02-22T06:00:00",
    "tickers": [
      "V",
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "Broadcom Prices $10 Billion Bond Offering to Refinance VMware Debt",
    "summary": "Broadcom priced a $10 billion multi-tranche bond offering with yields ranging from 4.5% to 5.2%. The proceeds will be used to refinance higher-cost debt taken on during the VMware acquisition, reducing annual interest expenses by approximately $300 million.",
    "source": "Reuters",
    "published_at": "2026-02-22T07:15:00",
    "tickers": [
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "P&G Market Share Slips in U.S. Laundry as Private Labels Gain",
    "summary": "Procter & Gamble's Tide brand lost 1.2 percentage points of U.S. market share in the latest Nielsen data as budget-conscious consumers shifted to store brands. Analysts say the trend could pressure margins if discounting becomes necessary.",
    "source": "MarketWatch",
    "published_at": "2026-02-22T08:30:00",
    "tickers": [
      "PG"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Tesla Elon Musk Promises Hundreds of Thousands of Self-Driving Cars by Year-End",
    "summary": "Elon Musk reiterated his ambitious claim that Tesla will have hundreds of thousands of self-driving cars operating in the US by the end of 2026. Analysts expressed skepticism given the company's limited Austin deployment and track record of missed autonomous driving deadlines.",
    "source": "Bloomberg",
    "published_at": "2026-02-22T09:00:00",
    "tickers": [
      "TSLA"
    ],
    "sector": "Consumer Cyclical",
    "sentiment": "neutral"
  },
  {
    "headline": "Apple Rolls Out Satellite Emergency SOS in 12 New Countries",
    "summary": "Apple expanded its satellite-based Emergency SOS feature to 12 additional countries across Europe and Asia-Pacific, bringing the total to 30 countries. The service has been credited with saving over 500 lives since its original launch in late 2022.",
    "source": "TechCrunch",
    "published_at": "2026-02-22T09:00:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Introduces AI Agent Marketplace with 500+ Pre-Built Solutions",
    "summary": "Salesforce launched an AI agent marketplace on AppExchange featuring over 500 pre-built autonomous agent solutions. The marketplace enables enterprises to deploy AI agents for sales, marketing, and support without custom development.",
    "source": "CNBC",
    "published_at": "2026-02-22T09:30:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Philip Morris Raises Full-Year Guidance on Strong Smoke-Free Momentum",
    "summary": "Philip Morris raised its 2026 adjusted EPS guidance to $7.40-7.55, up from $7.20-7.40 previously, citing faster-than-expected growth in smoke-free products. The company now expects IQOS users to surpass 35 million globally by year-end.",
    "source": "CNBC",
    "published_at": "2026-02-22T10:00:00",
    "tickers": [
      "PM"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Nvidia Slides 4% Despite Earnings Beat as Guidance Fails to Wow Bulls",
    "summary": "Despite crushing Q4 expectations, Nvidia shares fell 4% as the company's Q1 revenue guidance of $43 billion came in only slightly above consensus. Investors who had priced in a blowout quarter took profits, highlighting the elevated expectations embedded in the stock.",
    "source": "Bloomberg",
    "published_at": "2026-02-22T10:00:00",
    "tickers": [
      "NVDA",
      "QQQ",
      "SPY"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Google Ad Revenue Growth Stabilizes, Easing Investor Fears About AI Disruption",
    "summary": "New data from advertising industry trackers shows Google's ad revenue growth has stabilized at approximately 11% year-over-year, alleviating concerns that AI search alternatives were eroding its core business. Alphabet shares rose 3% on the report.",
    "source": "MarketWatch",
    "published_at": "2026-02-22T10:30:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan Chase Opens 50 New Branches in Southeast Expansion Push",
    "summary": "JPMorgan Chase opened 50 new retail bank branches across Florida, Georgia, and the Carolinas as part of its ongoing national expansion strategy. The bank said it sees strong demand for in-person banking services in high-growth sunbelt markets despite the shift toward digital channels.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-22T11:00:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Reports Progress on Carbon Negative Goal, Reduces Emissions 15%",
    "summary": "Microsoft published its annual sustainability report showing a 15% reduction in Scope 1 and 2 emissions year-over-year, despite significant data center expansion. The company reaffirmed its commitment to becoming carbon negative by 2030.",
    "source": "Financial Times",
    "published_at": "2026-02-23T07:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Amazon Web Services Suffers Multi-Hour Outage Affecting Major Customers",
    "summary": "AWS experienced a significant outage in its US-East-1 region lasting over four hours, disrupting services for thousands of businesses including several Fortune 500 companies. Amazon attributed the incident to a networking configuration error and said it is implementing safeguards to prevent recurrence.",
    "source": "Reuters",
    "published_at": "2026-02-23T07:00:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Abbott Sells $20B in Bonds to Finance Exact Sciences Acquisition",
    "summary": "Abbott Laboratories sold $20 billion of bonds to help fund its $21 billion acquisition of Exact Sciences. The massive bond offering reflects strong investor demand for Abbott's investment-grade debt and positions the company to complete the transformative cancer diagnostics deal in Q2 2026.",
    "source": "Bloomberg",
    "published_at": "2026-02-23T08:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "neutral"
  },
  {
    "headline": "Trump Raises China Tariffs to 15%, Cites Lack of Progress in Negotiations",
    "summary": "President Trump increased the tariff rate on Chinese imports from 10% to 15%, citing insufficient progress in trade talks despite earlier signals of willingness to negotiate from Beijing. The escalation sent the Dow Jones down over 400 points at the open.",
    "source": "Reuters",
    "published_at": "2026-02-23T08:00:00",
    "tickers": [
      "SPY",
      "DIA",
      "QQQ",
      "AAPL"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Berkshire Hathaway's Gen Re Division Reports Lower Catastrophe Claims",
    "summary": "General Reinsurance, the Berkshire Hathaway reinsurance unit, reported a decline in catastrophe-related claims for the first quarter of 2026 compared to the prior year. The favorable claims environment contributed to improved underwriting margins across the property and casualty book.",
    "source": "Reuters",
    "published_at": "2026-02-23T08:15:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "DeepSeek Reportedly Trained on NVIDIA Blackwell Chips Despite US Ban",
    "summary": "A senior Trump administration official revealed that China's DeepSeek trained its latest AI model on NVIDIA's restricted Blackwell chips, potentially violating US export controls. The Blackwell GPUs were reportedly clustered at a data center in Inner Mongolia.",
    "source": "Reuters",
    "published_at": "2026-02-23T09:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "AMD Stock Rebounds 5% as Dip Buyers Step In",
    "summary": "AMD shares bounced 5% as value-oriented investors bought the post-earnings dip. Analysts at Motley Fool argued the 17% sell-off was overdone given AMD's $10 billion quarterly revenue milestone and growing AI chip partnerships with OpenAI and Meta.",
    "source": "Motley Fool",
    "published_at": "2026-02-23T09:00:00",
    "tickers": [
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NextEra Lands Major Data Center Power Supply Agreement with Microsoft",
    "summary": "NextEra Energy signed a 20-year power purchase agreement with Microsoft to supply 1.5 GW of renewable energy to new data centers in the Southeast. The deal is one of the largest corporate clean energy agreements ever signed.",
    "source": "WSJ",
    "published_at": "2026-02-23T09:30:00",
    "tickers": [
      "NEE"
    ],
    "sector": "Utilities",
    "sentiment": "positive"
  },
  {
    "headline": "AbbVie Plans $380M Investment in Two API Manufacturing Facilities",
    "summary": "AbbVie announced plans to invest $380 million in two active pharmaceutical ingredient manufacturing facilities at its Illinois campus. The investment supports domestic drug manufacturing and aligns with AbbVie's commitment under its Most Favored Nation agreement with the Trump administration.",
    "source": "AbbVie",
    "published_at": "2026-02-23T10:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Costco Gold Bar Sales Surpass $1 Billion Amid Safe-Haven Demand",
    "summary": "Costco revealed that its gold bar sales have exceeded $1 billion on an annualized basis as consumers flock to precious metals amid economic uncertainty. The retailer has struggled to keep one-ounce bars in stock online.",
    "source": "CNBC",
    "published_at": "2026-02-23T10:00:00",
    "tickers": [
      "COST"
    ],
    "sector": "Consumer Staples",
    "sentiment": "neutral"
  },
  {
    "headline": "Cisco and Broadcom Compete for AI Data Center Networking Dominance",
    "summary": "A new IDC report shows Cisco and Broadcom are locked in a tight race for AI data center Ethernet switching revenue. Cisco leads in traditional enterprise deployments while Broadcom dominates in hyperscale back-end fabrics, with both companies investing heavily in 800G technology.",
    "source": "The Information",
    "published_at": "2026-02-23T10:00:00",
    "tickers": [
      "CSCO",
      "AVGO"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Adobe and Netflix Collaborate on AI-Powered Post-Production Pipeline",
    "summary": "Adobe and Netflix revealed a collaboration to build AI-powered post-production tools that reduce editing time by up to 40%. The partnership will integrate Adobe Premiere Pro's AI features directly into Netflix's content production workflow.",
    "source": "MarketWatch",
    "published_at": "2026-02-23T12:00:00",
    "tickers": [
      "ADBE",
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Google Workers Stage Walkout Over AI Ethics Concerns and Military Contracts",
    "summary": "Approximately 2,000 Google employees staged a walkout at the company's Mountain View headquarters, protesting the use of AI technology in defense contracts and demanding greater transparency in AI ethics review processes. Alphabet's management said it would engage in dialogue with employees.",
    "source": "WSJ",
    "published_at": "2026-02-23T14:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Goldman Sachs Predicts S&P 500 Will Reach 6,500 by Year-End",
    "summary": "Goldman Sachs equity strategists raised their year-end S&P 500 target to 6,500, citing stronger-than-expected corporate earnings growth and the prospect of modest Fed rate cuts in the second half. The bullish call represents approximately 8% upside from current levels.",
    "source": "Bloomberg",
    "published_at": "2026-02-23T14:30:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Intel Board Approves Potential IPO of Altera FPGA Division",
    "summary": "Intel's board of directors approved preparations for a potential initial public offering of its Altera programmable chip division. The move would allow Intel to unlock shareholder value from the unit acquired for $16.7 billion in 2015 while retaining a controlling stake.",
    "source": "WSJ",
    "published_at": "2026-02-23T17:00:00",
    "tickers": [
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "AbbVie's Real-World Vraylar Study in Bipolar I Disorder Completed",
    "summary": "AbbVie announced completion of its real-world Vraylar study in Bipolar I disorder, adding to the evidence base for one of its key neuroscience products. Vraylar has become an increasingly important revenue contributor as AbbVie diversifies beyond its immunology franchise.",
    "source": "AbbVie",
    "published_at": "2026-02-24T07:00:00",
    "tickers": [
      "ABBV"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Apple's AI-Powered Photo Editing Tools Drive Record iCloud Storage Subscriptions",
    "summary": "Apple reported that its AI-enhanced photo editing features in iOS 19 have driven a 25% increase in iCloud+ storage subscriptions. The tools, which include generative AI-based photo enhancement and object removal, require cloud processing that encourages paid tier upgrades.",
    "source": "Bloomberg",
    "published_at": "2026-02-24T08:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Abbott FDA Clearance for Amplatzer Piccolo System for Premature Infants",
    "summary": "Abbott announced FDA clearance and CE Mark for the Amplatzer Piccolo Delivery System to treat patent ductus arteriosus in premature infants. The device is designed for the tiniest babies and enables single-catheter procedures, expanding Abbott's structural heart portfolio into neonatal care.",
    "source": "Abbott",
    "published_at": "2026-02-24T09:00:00",
    "tickers": [
      "ABT"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Caterpillar Raises Quarterly Dividend 8% to $1.41 Per Share",
    "summary": "Caterpillar announced an 8% increase in its quarterly dividend to $1.41 per share, reflecting confidence in its cash flow outlook. The company also authorized an additional $10 billion share repurchase program.",
    "source": "WSJ",
    "published_at": "2026-02-24T09:30:00",
    "tickers": [
      "CAT"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "Consumer Confidence Drops to 14-Month Low on Tariff and Inflation Worries",
    "summary": "The Conference Board's Consumer Confidence Index fell to 98.7 in February, its lowest reading since December 2024, as households grew pessimistic about future economic conditions. Expectations for inflation over the next year rose sharply to 4.2%.",
    "source": "AP",
    "published_at": "2026-02-24T10:00:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Oracle Named Leader in Gartner Magic Quadrant for Cloud Database Management",
    "summary": "Gartner positioned Oracle as a leader in its 2026 Magic Quadrant for Cloud Database Management Systems, citing the strength of Autonomous Database and multi-cloud capabilities. It is the third consecutive year Oracle has achieved leader status.",
    "source": "WSJ",
    "published_at": "2026-02-24T10:30:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Mastercard Expands Biometric Payment Pilot to 15 Countries",
    "summary": "Mastercard expanded its biometric checkout program, which allows consumers to pay using facial recognition or palm scanning, to 15 countries from the initial five. Early results from pilot markets show a 40% reduction in checkout times and higher consumer satisfaction scores compared to traditional payment methods.",
    "source": "CNBC",
    "published_at": "2026-02-24T10:45:00",
    "tickers": [
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Qualcomm 5G Modem Shipments Hit Record as Emerging Markets Upgrade",
    "summary": "Qualcomm shipped a record 245 million 5G modem chips in Q4 2025, fueled by rapid 5G adoption in India, Southeast Asia, and Latin America. The company's lower-cost Snapdragon 4 Gen 3 platform has been particularly successful in driving 5G penetration in sub-$200 smartphones.",
    "source": "Bloomberg",
    "published_at": "2026-02-24T11:30:00",
    "tickers": [
      "QCOM"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Chevron and Occidental Vie for Key Gulf of Mexico Lease Blocks",
    "summary": "Chevron and Occidental Petroleum are competing aggressively in the latest Gulf of Mexico lease sale, with combined bids exceeding $800 million. Analysts say the bidding reflects renewed confidence in deepwater economics.",
    "source": "WSJ",
    "published_at": "2026-02-24T11:45:00",
    "tickers": [
      "CVX"
    ],
    "sector": "Energy",
    "sentiment": "neutral"
  },
  {
    "headline": "Microsoft and Alphabet Among Companies Targeted in New Data Privacy Bill",
    "summary": "A comprehensive federal data privacy bill introduced in the U.S. Senate would impose strict limits on how tech companies collect and use consumer data for AI training. Microsoft and Alphabet, which rely on large datasets to train AI models, could face significant compliance costs.",
    "source": "Reuters",
    "published_at": "2026-02-24T12:00:00",
    "tickers": [
      "MSFT",
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Amazon Announces Plans to Integrate Anthropic AI Models Across All Consumer Products",
    "summary": "Amazon revealed plans to embed Anthropic's Claude AI models into Alexa, Amazon Shopping, and Kindle. The integration deepens Amazon's $4 billion investment in Anthropic and positions it to compete with Google and Apple in consumer AI experiences.",
    "source": "Bloomberg",
    "published_at": "2026-02-24T14:15:00",
    "tickers": [
      "AMZN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa CFO Reaffirms Full-Year Guidance Despite Currency Headwinds",
    "summary": "Visa's chief financial officer reaffirmed the company's full-year revenue growth guidance of 10-12% at an investor conference, noting that a strengthening U.S. dollar would create a modest headwind but underlying payment volume trends remain healthy. Shares rose 1.3% on the reassurance.",
    "source": "MarketWatch",
    "published_at": "2026-02-24T15:00:00",
    "tickers": [
      "V"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Healthcare Sector Emerges as Safe Haven Amid Trade War Turbulence",
    "summary": "The S&P 500 healthcare sector outperformed the broader index by over 3 percentage points in February as investors sought defensive positioning. Pharmaceutical and managed care stocks led the rally, benefiting from domestic revenue bases largely insulated from tariffs.",
    "source": "MarketWatch",
    "published_at": "2026-02-24T15:00:00",
    "tickers": [
      "XLV",
      "SPY",
      "UNH",
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Salesforce Faces Backlash Over AI-Generated Customer Communications",
    "summary": "Several Salesforce enterprise customers reported issues with AI-generated email communications containing inaccurate information sent to their clients. Salesforce apologized and said it is adding additional human review safeguards to its Agentforce platform.",
    "source": "Financial Times",
    "published_at": "2026-02-25T07:30:00",
    "tickers": [
      "CRM"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Eli Lilly Takes Two Major Steps Forward in Obesity Drug Market",
    "summary": "Eli Lilly advanced its obesity drug portfolio with positive orforglipron maintenance data and continued Zepbound commercial momentum. Analysts expect the FDA decision on orforglipron to come as early as March, which would make it the first oral GLP-1 therapy approved for obesity treatment.",
    "source": "Motley Fool",
    "published_at": "2026-02-25T08:00:00",
    "tickers": [
      "LLY"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan and Goldman Sachs Among Banks Stress-Tested Under New Fed Scenario",
    "summary": "The Federal Reserve released details of its 2026 stress test scenarios, which include a severe global recession with unemployment reaching 10% and a 45% decline in equity markets. JPMorgan and Goldman Sachs are among the systemically important banks required to demonstrate capital adequacy under the harsh assumptions.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-25T08:00:00",
    "tickers": [
      "JPM",
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "neutral"
  },
  {
    "headline": "Texas Instruments and Accenture Collaborate on Smart Factory Solutions",
    "summary": "Texas Instruments and Accenture announced a joint initiative to develop smart factory reference designs combining TI's industrial sensors and processors with Accenture's Industry X consulting capabilities. The partnership targets manufacturers seeking to modernize production lines with IoT and AI technology.",
    "source": "Reuters",
    "published_at": "2026-02-25T09:00:00",
    "tickers": [
      "TXN",
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "February Flash PMI Shows Manufacturing Contraction Deepening on Tariff Impact",
    "summary": "The S&P Global Flash U.S. Manufacturing PMI fell to 47.1 in February, the weakest reading in 14 months, as new export orders contracted sharply under the weight of retaliatory tariffs. The services PMI remained in expansion territory at 52.8 but also softened.",
    "source": "Financial Times",
    "published_at": "2026-02-25T09:50:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "negative"
  },
  {
    "headline": "Microsoft GitHub Copilot Enterprise Adoption Doubles in Six Months",
    "summary": "Microsoft reported that GitHub Copilot Enterprise subscriptions have doubled over the past six months, with 150,000 organizations now using the AI coding assistant. The tool has generated over 5 billion lines of accepted code suggestions since launch.",
    "source": "TechCrunch",
    "published_at": "2026-02-25T10:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Starbucks Partners with DoorDash to Expand Delivery Nationwide",
    "summary": "Starbucks announced a new delivery partnership with DoorDash, complementing its existing Uber Eats relationship. The expanded delivery footprint will cover 95% of U.S. Starbucks locations by March 2026.",
    "source": "CNBC",
    "published_at": "2026-02-25T11:00:00",
    "tickers": [
      "SBUX"
    ],
    "sector": "Consumer Discretionary",
    "sentiment": "positive"
  },
  {
    "headline": "Google Fiber Expands to 10 New Markets, Intensifying Broadband Competition",
    "summary": "Alphabet's Google Fiber division announced expansion into 10 new U.S. markets, including Denver, Las Vegas, and Baltimore. The aggressive rollout puts pressure on incumbent ISPs and signals Alphabet's renewed commitment to its broadband business.",
    "source": "The Verge",
    "published_at": "2026-02-25T12:30:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "PepsiCo CEO Signals Caution on Consumer Spending Outlook",
    "summary": "PepsiCo CEO Ramon Laguarta told analysts that lower-income consumers are showing increased signs of spending fatigue heading into 2026. The company is adjusting its pricing strategy to emphasize value packs and smaller formats.",
    "source": "CNBC",
    "published_at": "2026-02-25T13:00:00",
    "tickers": [
      "PEP"
    ],
    "sector": "Consumer Staples",
    "sentiment": "negative"
  },
  {
    "headline": "Treasury Secretary Bessent Downplays Recession Fears, Says Tariffs Are Temporary",
    "summary": "Treasury Secretary Scott Bessent pushed back on growing recession concerns, arguing that tariffs are a negotiating tool rather than a permanent feature of trade policy. He projected GDP growth of 2.5% for 2026 and described the economy as fundamentally strong.",
    "source": "CNBC",
    "published_at": "2026-02-25T13:30:00",
    "tickers": [
      "SPY",
      "DIA"
    ],
    "sector": "Economy",
    "sentiment": "neutral"
  },
  {
    "headline": "Meta Stock Up 2.3% as Analysts Reiterate Strong Buy Rating",
    "summary": "Meta shares gained 2.3% as 62 analysts maintained a Strong Buy rating with an average 12-month price target of $861.42. The positive sentiment reflects confidence in Meta's AI monetization strategy and the NVIDIA infrastructure partnership announced earlier in the month.",
    "source": "MarketBeat",
    "published_at": "2026-02-25T14:00:00",
    "tickers": [
      "META"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Berkshire Hathaway Class B Shares Approach $500 Mark Amid Broad Market Rally",
    "summary": "Berkshire Hathaway Class B shares traded near the $500 level for the first time, as investors continued to favor the conglomerate's diversified business model and strong cash position. Year-to-date, BRK-B shares have outperformed the S&P 500 by approximately 3 percentage points.",
    "source": "Barron's",
    "published_at": "2026-02-25T14:15:00",
    "tickers": [
      "BRK-B"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Apple Shares Surge 4% After Warren Buffett's Berkshire Increases Stake",
    "summary": "Apple shares jumped 4% after Berkshire Hathaway's 13F filing revealed that Warren Buffett increased his Apple holdings by $3.2 billion during Q4 2025. The vote of confidence from the legendary investor boosted sentiment around the stock.",
    "source": "CNBC",
    "published_at": "2026-02-25T15:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Semiconductor Sector ETF Hits Record as AI Spending Shows No Signs of Slowing",
    "summary": "The SOXX semiconductor ETF reached an all-time high as investors remained bullish on AI-driven chip demand. Broadcom, Qualcomm, and Texas Instruments were among the top contributors to the index's gains, while Intel lagged due to ongoing restructuring uncertainty.",
    "source": "MarketWatch",
    "published_at": "2026-02-25T15:30:00",
    "tickers": [
      "AVGO",
      "QCOM",
      "TXN",
      "INTC"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix, Amazon, and Adobe Lead S&P 500 Tech Sector Rally on AI Optimism",
    "summary": "Technology stocks rallied broadly as investors rotated back into growth names on positive AI adoption data. Netflix gained 3.5%, Amazon rose 2.8%, and Adobe climbed 3.1%, leading the S&P 500 information technology sector higher.",
    "source": "CNBC",
    "published_at": "2026-02-25T16:00:00",
    "tickers": [
      "NFLX",
      "AMZN",
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Q4 FY2026 Revenue Hits Record $68.1 Billion",
    "summary": "NVIDIA reported record fourth-quarter fiscal 2026 revenue of $68.1 billion, up 73% year-over-year and 20% sequentially. Data center revenue surged 75% to $62.3 billion, driven by massive demand for Blackwell AI accelerators from hyperscale cloud providers.",
    "source": "CNBC",
    "published_at": "2026-02-25T16:15:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Guides Q1 FY2027 Revenue to $78 Billion, Beating Estimates",
    "summary": "NVIDIA guided first-quarter fiscal 2027 revenue to $78 billion plus or minus 2%, roughly $6 billion above Wall Street consensus. The guidance reflects continued insatiable demand for AI infrastructure and the ramp of next-generation Rubin GPUs in the second half of the year.",
    "source": "Bloomberg",
    "published_at": "2026-02-25T16:30:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA EPS Surges 82% YoY to $1.62, Data Center Dominance Continues",
    "summary": "NVIDIA reported earnings per share of $1.62 for Q4 FY2026, an 82% increase year-over-year. The data center segment contributed over 91% of total revenue at $62.3 billion, cementing NVIDIA's position as the dominant supplier of AI training and inference hardware.",
    "source": "Reuters",
    "published_at": "2026-02-25T17:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Vera Rubin AI Platform to Ship Second Half of 2026",
    "summary": "NVIDIA confirmed that its Vera Rubin AI platform will begin shipping in the second half of 2026, with major customers including OpenAI, Anthropic, Amazon, Google, and Microsoft already queued for multi-billion dollar allocations. The platform promises significant performance gains over Blackwell.",
    "source": "CNBC",
    "published_at": "2026-02-25T18:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Wall Street Consensus: Big Tech Poised for Strong 2026 Despite Regulatory Headwinds",
    "summary": "A survey of 30 Wall Street analysts shows a consensus Overweight rating for Apple, Microsoft, and Alphabet heading into the remainder of 2026. While regulatory risks remain, analysts cite AI monetization, strong cash flows, and shareholder returns as key tailwinds.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T07:00:00",
    "tickers": [
      "AAPL",
      "MSFT",
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Visa and Mastercard to Implement Lower Swipe Fees Under DOJ Settlement Terms",
    "summary": "Visa and Mastercard confirmed they will begin implementing reduced swipe fees for merchants as part of the terms of a landmark antitrust settlement reached in 2024. The fee reductions, phased in over five years, are expected to save U.S. merchants an estimated $30 billion collectively.",
    "source": "Reuters",
    "published_at": "2026-02-26T07:00:00",
    "tickers": [
      "V",
      "MA"
    ],
    "sector": "Financials",
    "sentiment": "negative"
  },
  {
    "headline": "DeepSeek Blocks NVIDIA, AMD From New AI Model Release",
    "summary": "Chinese AI startup DeepSeek announced it will exclude American chipmakers NVIDIA and AMD from its next major AI model release, shifting to domestically produced hardware. The move signals China's accelerating push for semiconductor self-sufficiency in AI development.",
    "source": "Reuters",
    "published_at": "2026-02-26T08:00:00",
    "tickers": [
      "NVDA",
      "AMD"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Mitsubishi UFJ Acquires Additional Johnson & Johnson Shares",
    "summary": "Mitsubishi UFJ Asset Management Co. Ltd. disclosed acquisition of additional JNJ shares, reflecting continued institutional confidence in Johnson & Johnson's diversified healthcare portfolio. The buying comes amid JNJ's strong oncology growth trajectory and MedTech expansion.",
    "source": "MarketBeat",
    "published_at": "2026-02-26T08:00:00",
    "tickers": [
      "JNJ"
    ],
    "sector": "Healthcare",
    "sentiment": "positive"
  },
  {
    "headline": "Walmart Advertising Business Surges 40%, Rivaling Amazon",
    "summary": "Walmart Connect, the retailer's advertising platform, grew revenue by 40% year-over-year to $4.2 billion annualized. The high-margin business is becoming a significant profit contributor and competitive threat to Amazon's ad dominance.",
    "source": "MarketWatch",
    "published_at": "2026-02-26T08:00:00",
    "tickers": [
      "WMT"
    ],
    "sector": "Consumer Staples",
    "sentiment": "positive"
  },
  {
    "headline": "Accenture Named Leader in Forrester's AI Services Wave Report",
    "summary": "Forrester Research ranked Accenture as the top leader in its 2026 AI Services Wave report, citing the firm's breadth of capabilities, proprietary AI tools, and deep industry expertise. The recognition is expected to further strengthen Accenture's competitive position in winning large AI transformation deals.",
    "source": "CNBC",
    "published_at": "2026-02-26T08:00:00",
    "tickers": [
      "ACN"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Durable Goods Orders Surprise to the Upside With 1.2% January Gain",
    "summary": "Orders for durable goods rose 1.2% in January, beating the 0.5% estimate, boosted by a rebound in aircraft orders and steady demand for business equipment. The data suggested capital spending remains resilient despite trade uncertainty.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T08:35:00",
    "tickers": [
      "SPY",
      "DIA",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  },
  {
    "headline": "Oracle Cloud Revenue Run Rate Crosses $25 Billion Annualized",
    "summary": "Oracle confirmed that its total cloud revenue run rate has crossed $25 billion on an annualized basis. The milestone represents a doubling of cloud revenue in under two years and cements Oracle's position as a top-four cloud provider globally.",
    "source": "Reuters",
    "published_at": "2026-02-26T09:00:00",
    "tickers": [
      "ORCL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "GE Aerospace Raises 2026 Revenue Guidance on Record Order Backlog",
    "summary": "GE Aerospace raised its full-year 2026 revenue guidance by $1 billion, citing a record order backlog of $150 billion. CEO Larry Culp said air travel demand remains robust across all major global markets.",
    "source": "WSJ",
    "published_at": "2026-02-26T09:00:00",
    "tickers": [
      "GE"
    ],
    "sector": "Industrials",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Stock Drops 5.5% Despite Record Earnings as Investors Book Profits",
    "summary": "Despite reporting record Q4 revenue of $68.1 billion and above-consensus guidance, NVIDIA shares fell 5.5% to $184.89, the biggest one-day drop since April. Analysts attributed the sell-off to profit-taking and elevated expectations rather than any fundamental weakness.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T09:30:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "negative"
  },
  {
    "headline": "Apple Finalizes Deal With Broadcom for Custom 5G Modem Chips",
    "summary": "Apple confirmed a multi-year agreement with Broadcom to co-develop custom 5G modem chips, ending its long-running dependence on Qualcomm for cellular connectivity. The first Apple-designed modems are expected to ship in iPhones starting in 2027.",
    "source": "WSJ",
    "published_at": "2026-02-26T09:30:00",
    "tickers": [
      "AAPL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "NVIDIA Rosy Revenue Forecast Shows AI Boom Remains Strong",
    "summary": "Analysts highlighted that NVIDIA's Q1 FY2027 revenue guidance of $78 billion demonstrates the AI infrastructure buildout is far from peaking. Multiple firms noted that the guidance implies continued double-digit sequential growth, driven by Blackwell ramp and early Rubin orders.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T10:00:00",
    "tickers": [
      "NVDA"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "S&P 500 Enters Consolidation Phase, Trading Sideways for Two Weeks",
    "summary": "After reaching record highs in mid-February, the S&P 500 has been range-bound between 6,200 and 6,330, reflecting uncertainty over the trajectory of trade policy and inflation. Volatility as measured by the VIX remained elevated around 18, above its long-term average.",
    "source": "Wall Street Journal",
    "published_at": "2026-02-26T10:00:00",
    "tickers": [
      "SPY",
      "QQQ",
      "DIA"
    ],
    "sector": "Market",
    "sentiment": "neutral"
  },
  {
    "headline": "Linde Expands Semiconductor Gas Supply with New Taiwan Facility",
    "summary": "Linde announced the construction of a new ultra-high-purity gas facility in southern Taiwan to serve expanding TSMC fabrication plants. The $800 million investment reflects growing industrial gas demand from the AI chip buildout.",
    "source": "CNBC",
    "published_at": "2026-02-26T10:30:00",
    "tickers": [
      "LIN"
    ],
    "sector": "Materials",
    "sentiment": "positive"
  },
  {
    "headline": "Microsoft Invests $500 Million in AI Education Initiative for Developing Nations",
    "summary": "Microsoft announced a $500 million global initiative to provide AI training and education resources to universities and vocational programs in developing countries. The five-year program aims to train 10 million students and professionals in AI skills.",
    "source": "Reuters",
    "published_at": "2026-02-26T11:00:00",
    "tickers": [
      "MSFT"
    ],
    "sector": "Technology",
    "sentiment": "neutral"
  },
  {
    "headline": "Adobe Announces Integration of Firefly AI into Microsoft 365 Suite",
    "summary": "Adobe and Microsoft announced a partnership to integrate Firefly generative AI capabilities into Microsoft 365 applications. Users will be able to generate and edit images directly within PowerPoint, Word, and Teams using Adobe's AI models.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T11:30:00",
    "tickers": [
      "ADBE"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "JPMorgan's Asset Management Arm Surpasses $4 Trillion in Client Assets",
    "summary": "JPMorgan Asset Management reported total client assets under management surpassed $4 trillion for the first time, driven by inflows into fixed income strategies and alternative investments. The milestone cements JPMorgan's position as one of the world's largest asset managers alongside BlackRock and Vanguard.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T11:30:00",
    "tickers": [
      "JPM"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Cisco Increases Share Buyback Authorization by $15 Billion",
    "summary": "Cisco's board approved an additional $15 billion in share repurchase authorization, bringing the total available to $18 billion. The move signals management's confidence in the company's cash flow generation and reflects a commitment to returning capital to shareholders.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T12:00:00",
    "tickers": [
      "CSCO"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Alphabet Reports Strong Early Adoption of Gemini Pro API by Enterprise Developers",
    "summary": "Alphabet disclosed that over 50,000 enterprise customers are now using the Gemini Pro API, a threefold increase from the prior quarter. The demand is driving higher Google Cloud consumption and contributing to improved unit economics in the cloud division.",
    "source": "Bloomberg",
    "published_at": "2026-02-26T14:00:00",
    "tickers": [
      "GOOGL"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Netflix Expands Ad-Supported Tier to 12 New International Markets",
    "summary": "Netflix launched its ad-supported subscription plan in 12 additional countries across Latin America, Europe, and Southeast Asia. The expansion is expected to drive subscriber growth in price-sensitive markets while diversifying Netflix's revenue streams.",
    "source": "WSJ",
    "published_at": "2026-02-26T14:00:00",
    "tickers": [
      "NFLX"
    ],
    "sector": "Technology",
    "sentiment": "positive"
  },
  {
    "headline": "Goldman Sachs Sees Record M&A Advisory Backlog Heading into Spring",
    "summary": "Goldman Sachs disclosed that its mergers and acquisitions advisory backlog has reached record levels heading into the spring, with particular strength in technology, energy, and financial services sectors. The bank expects several multi-billion-dollar transactions to close in the second quarter.",
    "source": "Financial Times",
    "published_at": "2026-02-26T14:00:00",
    "tickers": [
      "GS"
    ],
    "sector": "Financials",
    "sentiment": "positive"
  },
  {
    "headline": "Fed's Bostic: Two Rate Cuts Still Possible in 2026 if Data Cooperates",
    "summary": "Atlanta Fed President Raphael Bostic said he still sees a path to two 25-basis-point rate cuts this year, contingent on continued improvement in inflation data and no further trade escalation. He noted that the neutral rate may be higher than previously assumed.",
    "source": "Reuters",
    "published_at": "2026-02-26T14:15:00",
    "tickers": [
      "SPY",
      "QQQ",
      "IWM"
    ],
    "sector": "Economy",
    "sentiment": "positive"
  }
]